
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	злСобытияФормОценкаПроизводительности.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	злСобытияФормОценкаПроизводительностиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// << 16.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1404
	//МассивСсылок = ТекущийОбъект.СписокСсылокНаОбъекты.Получить();    
	//Если ТипЗнч(МассивСсылок) = Тип("Массив") Тогда	
	//	СписокСсылок.ЗагрузитьЗначения(МассивСсылок);
	//КонецЕсли;  
	СписокСсылок.Очистить();
	Если ЗначениеЗаполнено(ТекущийОбъект.СписокСсылокНаОбъекты) Тогда
		МодульКонвертации = КР_ОбщегоНазначениеСервер;		
		Данные = МодульКонвертации.JSONВДанные(ТекущийОбъект.СписокСсылокНаОбъекты); 
		Для Каждого ЭлементМассива Из Данные Цикл 
			СписокСсылок.Добавить(МодульКонвертации.СтруктураВСсылку(ЭлементМассива));
		КонецЦикла;
	КонецЕсли;
	// >> 16.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1404    
// << 25.12.2023 Петухов А.В., Фактор, #3553
	Если Истина
		И ПустаяСтрока(ТекущийОбъект.ТелоСообщения)
		И ТекущийОбъект.ТелоСообщенияСжатое <> Неопределено
	Тогда
		ТелоСообщения = ТекущийОбъект.ТелоСообщенияСжатое.Получить();
	Иначе
		ТелоСообщения = ТекущийОбъект.ТелоСообщения;
	КонецЕсли;
// >> 25.12.2023 Петухов А.В., Фактор, #3553
	
КонецПроцедуры



&НаКлиенте
Процедура ОтправитьВыделенные(Команда)
	Если Запись.Состояние <> ПредопределенноеЗначение("Перечисление.КР_СостоянияСообщенийОбмена.Зарегистрировано") Тогда
		ТекстВопроса = НСтр("ru='Перевести состояние сообщения в [Зарегистрировано]?'");
		ОписаниеВопроса = Новый ОписаниеОповещения("ОтправитьВыделенныеЗаверешениеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОтправитьВыделенныеЗаверешениеВопроса(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура ОтправитьВыделенныеЗаверешениеВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтправитьВыделенныеНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВыделенныеНаСервере()
	
	Запись.Состояние = Перечисления.КР_СостоянияСообщенийОбмена.Зарегистрировано;
	Записать();
	
    МассивСообщений = Новый Массив;	
	МассивСообщений.Добавить(Запись.КлючСообщения);	
	КР_ОбменRabbitВзаимодействиеСАдаптером.ОбменСообщениями(МассивСообщений);
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСсылокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение( , ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
// << 25.12.2023 Петухов А.В., Фактор, #3553
	Если Истина
		И ПустаяСтрока(ТекущийОбъект.ТелоСообщения)
		И ТекущийОбъект.ТелоСообщенияСжатое <> Неопределено
	Тогда
		ТекущийОбъект.ТелоСообщенияСжатое = Новый ХранилищеЗначения(ТелоСообщения, Новый СжатиеДанных (9));
	Иначе
		ТекущийОбъект.ТелоСообщения = ТелоСообщения;
	КонецЕсли;
// >> 25.12.2023 Петухов А.В., Фактор, #3553
КонецПроцедуры

#КонецОбласти

