#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру настроек указанного предопределенного элемента
//
// Параметры:
//  ИмяПредопределенныхДанных  - Строка - Имя предопределенного элемента
//
// Возвращаемое значение:
//   Структура   - Структура с полями:
//					ДоступноЗначение - Булево - видимость элемента Значение на форме
//					ДоступенСписокЗначений - Булево - видимость элемента Список на форме
//					ОграничениеЗначения - ОписаниеТипов - Ограничение типов элемента Значение на форма
//					ОграничениеСписка - ОписаниеТипов - Ограничение типов элементов Списка на форма
//
Функция ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(ИмяПредопределенныхДанных) Экспорт
	
	// см. примеры в конце модуля в области "Пример"
	
	ОграниченияТипов = ДоступныеОграниченияТипов();
	
	#Область СписокОграниченийДоступностиПредопределенныхЭлементов

	СоответствиеНастроек = Новый Соответствие;


	#Область Группа_СкладскойУчет		
	
	// << 09.08.2022, Глухов А.Н., КРОК, Jira№ A2105505-352
	// Описание типа дополнительных настроек предопределенных элементов  
	#Область Группа_Склады		
				
    // << 06.09.2022 Марченко С.Н., КРОК, JIRA№A2105505-416  
	
	// СкладБрака	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладБрака",
		ОграниченияТипов.Склады,
		Неопределено);	       

	// СкладОнлайнПикинг	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладОнлайнПикинг",
		ОграниченияТипов.Склады,
		Неопределено);	       

	// СкладОнлайнКороба	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладОнлайнКороба",
		ОграниченияТипов.Склады,
		Неопределено);	       
	// >> 06.09.2022 Марченко С.Н., КРОК, JIRA№A2105505-416
	
	// << 19.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-702    
	
	// Магазины	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"Магазины",
		Неопределено,
		ОграниченияТипов.Склады);
	
	// ЦентральныеСклады	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ЦентральныеСклады",
		Неопределено,
		ОграниченияТипов.Склады);
	
	// >> 19.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-702
	
	// << 02.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-772
	
	// Склад eSolutions
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладEsolutions",
		ОграниченияТипов.Склады,
		Неопределено);
	
	// >> 02.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-772
	
	// << 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	
	// СкладыТекущейБазыДанных	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладыТекущейБазыДанных",
		Неопределено,
		ОграниченияТипов.Склады);
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладскиеГруппыНоменклатурыБезУпаковок",
		Неопределено,
		ОграниченияТипов.СкладскиеГруппыНоменклатуры);
	// >> 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	
	// << 28.02.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1299
	// СкладОтгрузкиЦентральногоСкладаДляЛогистики
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладОтгрузкиЦентральногоСкладаДляЛогистики",
		ОграниченияТипов.Склады,
		Неопределено);
		
	// СкладыОтгрузкиЦентральногоСклада
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладыОтгрузкиЦентральногоСклада",
		Неопределено,
		ОграниченияТипов.Склады);
	// >> 28.02.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1299
	
	// << 10.07.2023 Марченко С.Н., КРОК, JIRA№A2105505-1934
	// СкладыECom
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладыECom",
		ОграниченияТипов.Склады,
		Неопределено);
	// >> 10.07.2023 Марченко С.Н., КРОК, JIRA№A2105505-1934

	// ГалкинАН #4309 (08.08.2024) galkin.an {
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладОтгрузкиКалининград",
		ОграниченияТипов.Склады,
		Неопределено);
	// #4309 }
	
	// --> Евлахов Игорь Николаевич (Начало) 20.12.2023
	// Задача #3407
	// ВнешняяОбработкаESolutionsSecureFTP
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВнешняяОбработкаESolutionsSecureFTP", ОграниченияТипов.ДополнительныеОтчетыИОбработки, Неопределено);
	// <-- Евлахов Игорь Николаевич (Конец) 20.12.2023
	
	#КонецОбласти	
    // >> 09.08.2022, Глухов А.Н., КРОК, Jira№ A2105505-352	
		
	// << 11.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-723
	
	// СтатьяРасходовСписаниеБрак
 	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СтатьяРасходовСписаниеБрак",
		ОграниченияТипов.СтатьиРасходов,
		Неопределено); 
	
	// СтатьяРасходовСписаниеПрочее
 	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СтатьяРасходовСписаниеПрочее",
		ОграниченияТипов.СтатьиРасходов,
		Неопределено); 
	
	// ФизлицоДляОтраженияВыдачиСпецодежды
 	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ФизлицоДляОтраженияВыдачиСпецодежды",
		ОграниченияТипов.ФизическиеЛица,
		Неопределено); 
	// >> 11.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-723
	
	// << 02.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-912   
	
	// ДатаНачалаДвиженияКоробовПоДокументамУТ11
 	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ДатаНачалаДвиженияКоробовПоДокументамУТ11",
		ОграниченияТипов.Дата,
		Неопределено); 
		
	// >> 02.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-912
	
	// << 16.01.2023 Маскаев П.Ю., КРОК, JIRA№ A2105505-1162
	
	// ГруппаВидовНоменклатурыАксессуаров
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ГруппаВидовНоменклатурыАксессуаров",
		ОграниченияТипов.ВидыНоменклатуры,
		Неопределено); 
	// >> 16.01.2023 Маскаев П.Ю., КРОК, JIRA№ A2105505-1162
	
	// << 17.01.2023 Маскаев П.Ю., КРОК, JIRA№ A2105505-1162
	
	ОграничениеТипаЧисло5_0_Неотр = ПолучитьБазовуюСтруктуруСвойствЭлемента();
	ОграничениеТипаЧисло5_0_Неотр.ОграничениеТипа =
		ОбщегоНазначения.ОписаниеТипаЧисло(5, 0, ДопустимыйЗнак.Неотрицательный);	
	
	// НормативСборкиТовараДляМежскладскогоПеремещенияВДень
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"НормативСборкиТовараДляМежскладскогоПеремещенияВДень",
		ОграничениеТипаЧисло5_0_Неотр,
		Неопределено); 
	// >> 17.01.2023 Маскаев П.Ю., КРОК, JIRA№ A2105505-1162  
		
	// << 02.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1262 
	
	// ТипоразмерБезразмернаяЯчейка 
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ТипоразмерБезразмернаяЯчейка",
		ОграниченияТипов.ТипоразмерыЯчеек,
		Неопределено); 	
	// >> 02.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1262
	
	// << 31.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-2245 
	
	// ОсновнойГрафикСборкиОтгрузкиИзМагазинов
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ОсновнойГрафикСборкиОтгрузкиИзМагазинов",
		ОграниченияТипов.Календари,
		Неопределено); 	
	// >> 31.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-2245
	
	#КонецОбласти	   
	
	// << 30.08.2022, Мельников А.А., КРОК, Jira№ A2105505-376 
    #Область Группа_ВнутренняяЛогистика
	
	 	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
			"ЗоныДоставкиМаркетплейсы",
			ОграниченияТипов.ЗоныДоставки,
			Неопределено);

	    ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
			"ЗоныДоставкиРегионы",
			ОграниченияТипов.ЗоныДоставки,
			Неопределено);

		ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
			"ЗоныДоставкиСегменты",
			ОграниченияТипов.ЗоныДоставки,
			Неопределено);
			
	// << 25.11.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-880
	 	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
			"ПолучателиИзмененнойКонтактнойИнформацииМагазина",
			Неопределено,
			ОграниченияТипов.ФизическиеЛица);
	// >> 25.11.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-880
	
	// << 11.04.2023 Новиков Н.С., КРОК, JIRA№ A2105505-1465
	ОграничениеТипаЧисло5_3_Неотр = ПолучитьБазовуюСтруктуруСвойствЭлемента();
	ОграничениеТипаЧисло5_3_Неотр.ОграничениеТипа =
		ОбщегоНазначения.ОписаниеТипаЧисло(5, 3, ДопустимыйЗнак.Неотрицательный);	
	
	// КоэффициентВесаКороба 
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"КоэффициентВесаКороба",
		ОграничениеТипаЧисло5_0_Неотр,
		Неопределено); 
		
	// КоэффициентОбъемаКороба 
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"КоэффициентОбъемаКороба",
		ОграничениеТипаЧисло5_3_Неотр,
		Неопределено); 	
	// >> 11.04.2023 Новиков Н.С., КРОК, JIRA№ A2105505-1465

	// ГалкинАН #4309 (08.08.2024) galkin.an {
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"БизнесРегионКалининград",
		ОграниченияТипов.БизнесРегионы,
		Неопределено);
	// #4309 }

	#КонецОбласти
	// >> 30.08.2022, Мельников А.А., КРОК, Jira№ A2105505-376 
	
	// << 31.08.2022 Марченко С.Н., КРОК, JIRA№A2105505-434
	#Область Группа_НСИ

	#Область Группа_ВидыЦен

	// ВидЦеныРозничный
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВидЦеныРозничный", ОграниченияТипов.ВидыЦен, Неопределено);
		
	#КонецОбласти	
	
	// << 13.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1210
	// ТомХраненияИзображенийНоменклатуры
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ТомХраненияИзображенийНоменклатуры", ОграниченияТипов.ТомаХраненияФайлов, Неопределено);
	// >> 13.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1210
	
	// << 17.02.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-1179
	// ВидНоменклатурыСОбщимиКатегориямиТоваров
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВидНоменклатурыСОбщимиКатегориямиТоваров",
		ОграниченияТипов.ВидыНоменклатуры,
		Неопределено);
		
	// ШаблонЦенника
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ШаблонЦенника",
		ОграниченияТипов.ШаблоныЭтикетокИЦенников,
		Неопределено);
	// >> 17.02.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-1179
	
	// << 22.03.2023 Федоров Д.Е., КРОК, JIRA№A2105505-955
	// ТестовыеДанныеТСД
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ТестовыеДанныеТСД",
		ОграниченияТипов.Строка1000,
		Неопределено);
	// >> 22.03.2023 Федоров Д.Е., КРОК, JIRA№A2105505-955
	
	// << 16.05.2023 Федоров Д.Е., КРОК, JIRA№ A2105505-1112
	// БизнесРегионыПеремещенийТоваровЧерезЦС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"БизнесРегионыПеремещенийТоваровЧерезЦС",
		Неопределено,
		ОграниченияТипов.БизнесРегионы);
	// >> 16.05.2023 Федоров Д.Е., КРОК, JIRA№ A2105505-1112
	
	#КонецОбласти	
	// >> 31.08.2022 Марченко С.Н., КРОК, JIRA№A2105505-434	        
	
#Область Продажи

#Область ИнтернетМагазин

    // << 26.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-725

	// СбпОплата
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СбпОплата", ОграниченияТипов.ЭквайринговыеТерминалы, Неопределено);
	
	// ЭквайрингОплата
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ЭквайрингОплата", ОграниченияТипов.ЭквайринговыеТерминалы, Неопределено);
	
	// ЭквайрингПодели
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СервисПодели", ОграниченияТипов.ЭквайринговыеТерминалы, Неопределено);
	// >> 26.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-725
	
	// << 16.01.2023, Федоров Д.Е., КРОК, JIRA№ A2105505-802
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ТиповоеСоглашениеДляРозничногоПокупателяИм", ОграниченияТипов.СоглашенияСКлиентами, Неопределено);
	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ПодразделениеИм", ОграниченияТипов.СтруктураПредприятия, Неопределено);
	
	// << 21.03.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1429
	
	// Подели
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"Подели", ОграниченияТипов.ЭквайринговыеТерминалы, Неопределено);
	
	// >> 21.03.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1429
	
	// << 31.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-1407
	
	// ЦеныИМ
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ЦеныИМ", Неопределено, ОграниченияТипов.ВидыЦен);
	
	// >> 31.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-1407
	// >> 16.01.2023, Федоров Д.Е., КРОК, JIRA№ A2105505-802
	
#КонецОбласти

#Область Маркетплейсы

	// << 06.12.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-384
	// Ozon
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"Ozon", ОграниченияТипов.Контрагенты, Неопределено);
	
	// WB
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"WB", ОграниченияТипов.Контрагенты, Неопределено);
	// >> 06.12.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-384
	
	// << 06.02.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-447
	// Lamoda
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"Lamoda", ОграниченияТипов.Контрагенты, Неопределено);
	// >> 06.02.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-447
	
#КонецОбласти

#Область ФулфилментАутсорс

	// << 11.10.2023 Марченко С.Н., КРОК, JIRA№A2105505-2368

	// ВидЦеныДляАнонсаПоставкиНаПФС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВидЦеныДляАнонсаПоставкиНаПФС", ОграниченияТипов.ВидыЦен, Неопределено);

	// >> 11.10.2023 Марченко С.Н., КРОК, JIRA№A2105505-2368

	// << 07.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2457   
	
	// ДоговорКонтрагентаДляУПДНаПФС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ДоговорКонтрагентаДляУПДНаПФС", ОграниченияТипов.ДоговорыКонтрагентов, Неопределено);
	
	// ГрузополучательДляАППНаПФС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ГрузополучательДляАППНаПФС", ОграниченияТипов.Партнеры, Неопределено);
	// >> 07.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2457

#КонецОбласти

#КонецОбласти

	#Область Закупки

	#Область ФормированиеТаможеннойДекларации

	// << 09.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918

	// СтатьяРасходовСборГТД
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СтатьяРасходовСборГТД", ОграниченияТипов.СтатьиРасходов, Неопределено);

	// СтатьяРасходовШтрафГТД
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СтатьяРасходовШтрафГТД", ОграниченияТипов.СтатьиРасходов, Неопределено);
	// >> 09.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	
	#КонецОбласти
	
	#Область ФормированиеПоступлений   
	
	// << 09.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918

	// СкладПоступления
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СкладПоступления", ОграниченияТипов.Склады, Неопределено);
  	// >> 09.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
	
	#КонецОбласти
	
	#КонецОбласти
	
// << 03.02.2023 Федоров Д.Е., КРОК, JIRA№A2105505-860
#Область Закупки

	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СтатьяДоходовДляОприходованияИзлишковТоваров", ОграниченияТипов.СтатьиДоходов, Неопределено);
	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"СтатьяРасходовДляСписанияНедостачТоваров", ОграниченияТипов.СтатьиРасходов, Неопределено);

#КонецОбласти
// >> 03.02.2023 Федоров Д.Е., КРОК, JIRA№A2105505-860
		
	// << 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970
	#Область Кассы
	
	// АнализируемыйПериодДляРасчетаКассовыхЛимитов
	ДобавитьБазовуюСтруктуруСвойстваНастройки(
		СоответствиеНастроек,
		"АнализируемыйПериодДляРасчетаКассовыхЛимитов",
		ОграниченияТипов.СтандартныйПериод,
		Неопределено);
	
	// МагазиныДляАвтоматическогоРасчетаКассовыхЛимитов  
	ОграничениеТипаСкладыСОтбором = ОбщегоНазначения.СкопироватьРекурсивно(ОграниченияТипов.Склады);	
	ОграничениеТипаСкладыСОтбором.ПараметрыВыбора = Новый ФиксированныйМассив(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			Новый ПараметрВыбора("Отбор.ТипСклада", Перечисления.ТипыСкладов.РозничныйМагазин)));      
			
	ДобавитьБазовуюСтруктуруСвойстваНастройки(
		СоответствиеНастроек,
		"МагазиныДляАвтоматическогоРасчетаКассовыхЛимитов",
		Неопределено,
		ОграничениеТипаСкладыСОтбором);
	
	#КонецОбласти 
	// >> 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970
	
	// << 03.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-487
	#Область Расходы     
	
	// КатегорияЭксплуатацииФорменнойОдежды
	ДобавитьБазовуюСтруктуруСвойстваНастройки(
		СоответствиеНастроек,
		"КатегорияЭксплуатацииФорменнойОдежды",
		ОграниченияТипов.КатегорииЭксплуатации,
		Неопределено);
	
	#КонецОбласти
	// >> 03.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-487
	
	// << 13.02.2023, Гашников А.П., КРОК, Jira№ A2105505-1028
	#Область Ценообразование
	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВидЦеныДляЦеныНаЦеннике", ОграниченияТипов.ВидыЦен, Неопределено);
	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВидЦеныПервоначальныйРозничный", ОграниченияТипов.ВидыЦен, Неопределено);
	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"БлокирующаяЦена", ОграниченияТипов.ДенежнаяСуммаНеотрицательная, Неопределено);
	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ФорматыМагазиновOutlet", Неопределено, ОграниченияТипов.ФорматыМагазинов);
	
	#КонецОбласти
	// >> 13.02.2023, Гашников А.П., КРОК, Jira№ A2105505-1028
	
	// << 20.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-777
	#Область УправлениеАссортиментом
	
	#Область РегламентированныйУчет
	
	// ВалютаРасчетаАрендыПоУмолчанию	
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВалютаРасчетаАрендыПоУмолчанию",
		ОграниченияТипов.Валюты,
		Неопределено);	       
		
	#КонецОбласти
		
	// << 25.04.2023, Гашников А.П., КРОК, Jira№ A2105505-1553
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВидНоменклатурыАксессуары",
		ОграниченияТипов.ВидыНоменклатуры,
		Неопределено);
	// >> 25.04.2023, Гашников А.П., КРОК, Jira№ A2105505-1553

	// --> Евлахов Игорь Николаевич (Начало) 11.09.2024
	// Задача #4674
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ЗапретВыгрузкиИзмененийАссортимента", 
		Неопределено, 
		ОграниченияТипов.ЭтапыИзмененияАссортимента);
	// <-- Евлахов Игорь Николаевич (Конец) 11.09.2024
	
	#КонецОбласти
	// >> 20.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-777
	
	#Область Группа_СБИС
	
	// << 23.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1153 
	
	// ПутьКСервисуСБИС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ПутьКСервисуСБИС", ОграниченияТипов.Строка, Неопределено);
	
	// ЛогинСервисаСБИС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ЛогинСервисаСБИС", ОграниченияТипов.Строка, Неопределено);
	
	// ПарольСервисаСБИС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ПарольСервисаСБИС", ОграниченияТипов.Строка, Неопределено);
	
	// МетрикиОбменаСервисаСБИС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"МетрикиОбменаСервисаСБИС", ОграниченияТипов.Соответствие, Неопределено);
	
	// >> 23.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1153
	
	// --> Евлахов Игорь Николаевич (Начало) 20.12.2023
	// Задача #3518
	// ВнешняяОбработкаСБИС
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ВнешняяОбработкаСБИС", ОграниченияТипов.ДополнительныеОтчетыИОбработки, Неопределено);
	// <-- Евлахов Игорь Николаевич (Конец) 20.12.2023
	
	// --> Евлахов Игорь Николаевич (Начало) 29.02.2024
	// Задача #3831
	// ОтправкаВСБИСБезПрисоединенныхФайлов
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ОтправкаВСБИСБезПрисоединенныхФайлов", ОграниченияТипов.Булево, Неопределено);
	// <-- Евлахов Игорь Николаевич (Конец) 29.02.2024
	
	#КонецОбласти 
	
	#Область Группа_Технические
	
	// << 21.09.2023 Марченко С.Н., КРОК, JIRA№A2105505-991
	
	// НастройкиРазвертыванияНовойБазыМагазина
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"НастройкиРазвертыванияНовойБазыМагазина", ОграниченияТипов.Структура, Неопределено);
	
	// ГруппаПользователейАдминистраторовМагазинов
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ГруппаПользователейАдминистраторовМагазинов", ОграниченияТипов.ГруппыПользователей, Неопределено);
	
	// ГруппаПользователейПродавцовМагазинов
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ГруппаПользователейПродавцовМагазинов", ОграниченияТипов.ГруппыПользователей, Неопределено);
	
	// >> 21.09.2023 Марченко С.Н., КРОК, JIRA№A2105505-991
	
	// << 14.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2497  
	
	// ОтветственныйПодсортировки
	ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек,
		"ОтветственныйПодсортировки", ОграниченияТипов.Пользователи, Неопределено);
	// >> 14.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2497

	#КонецОбласти
	
	#КонецОбласти	
	
	Возврат СоответствиеНастроек.Получить(ИмяПредопределенныхДанных);
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// << 28.12.2022, Маскаев П.Ю., КРОК, JIRA№ A2105505-970
Процедура ЗаписатьЗначение(
			ИмяНастройки,
			Значение,
			ВХранилищеЗначения = Ложь,
			КонтролироватьТип = Истина) Экспорт
	
	СтруктураНастройки = ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(ИмяНастройки);
		
	Если СтруктураНастройки = Неопределено Тогда 
		ТекстСообщения = НСтр("ru = 'Для ""%1"" не определены настройки ограничения полей ввода'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяНастройки);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли Не СтруктураНастройки.ДоступноЗначение Тогда 
		ТекстСообщения = НСтр("ru = 'Для ""%1"" недоступна запись значения'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяНастройки);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если КонтролироватьТип Тогда
		ТипыОграничений = СтруктураНастройки.СтруктураСвойствЗначения.ОграничениеТипа.Типы();
		ТипЗначения = ТипЗнч(Значение);
		Если ТипыОграничений.Найти(ТипЗначения) = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Для ""%1"" записываемое значение не соответствует настройкам ограничения'"); 
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяНастройки);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	НастройкаОбъект = Справочники.КР_ДополнительныеНастройкиСистемы[ИмяНастройки].ПолучитьОбъект();
	
	Если ВХранилищеЗначения Тогда
		НастройкаОбъект.ЗначениеВХранилище = Новый ХранилищеЗначения(Значение);
	Иначе
		НастройкаОбъект.Значение = Значение;
	КонецЕсли;
	
	НастройкаОбъект.Записать();
	
КонецПроцедуры // >> 28.12.2022, Маскаев П.Ю., КРОК, JIRA№ A2105505-970

// << 28.12.2022, Маскаев П.Ю., КРОК, JIRA№ A2105505-970
Процедура ЗаписатьМассивЗначений(
			ИмяНастройки,
			МассивЗначений,
			ВХранилищеЗначения = Ложь,
			КонтролироватьТип = Истина) Экспорт
	
	СтруктураНастройки = ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(ИмяНастройки);
	
	Если СтруктураНастройки = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для ""%1"" не определены настройки ограничения полей ввода'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяНастройки);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли Не СтруктураНастройки.ДоступенСписокЗначений Тогда
		ТекстСообщения = НСтр("ru = 'Для ""%1"" недоступна запись массива значений'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяНастройки);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если КонтролироватьТип Тогда
		ТипыОграничений = СтруктураНастройки.СтруктураСвойствСписка.ОграничениеТипа.Типы();
		Для Каждого Значение Из МассивЗначений Цикл
			ТипЗначения = ТипЗнч(Значение);
			Если ТипыОграничений.Найти(ТипЗначения) = Неопределено Тогда
				ТекстСообщения = НСтр("ru = 'Для ""%1"" значения массива не соответствуют настройкам ограничения'"); 
				ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяНастройки);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НастройкаОбъект = Справочники.КР_ДополнительныеНастройкиСистемы[ИмяНастройки].ПолучитьОбъект();
	НастройкаОбъект.СписокЗначений.Очистить();
	
	Для Каждого Значение Из МассивЗначений Цикл
		нСтрока = НастройкаОбъект.СписокЗначений.Добавить();
		Если ВХранилищеЗначения Тогда
			нСтрока.ЗначениеВХранилище = Новый ХранилищеЗначения(Значение);
		Иначе
			нСтрока.Значение = Значение;
		КонецЕсли;
	КонецЦикла;
	
	НастройкаОбъект.Записать();
	
КонецПроцедуры // >> 28.12.2022, Маскаев П.Ю., КРОК, JIRA№ A2105505-970

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеОграниченияТипов()

	ОграниченияТипов = Новый Структура;    
	
	ОграниченияТипов.Вставить("Дата", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Дата.ОграничениеТипа = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ОграниченияТипов.Вставить("Строка50", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Строка50.ОграничениеТипа = ОбщегоНазначения.ОписаниеТипаСтрока(50);
	
	// << 22.03.2023 Федоров Д.Е., КРОК, JIRA№A2105505-955
	ОграниченияТипов.Вставить("Строка1000", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Строка1000.ОграничениеТипа = ОбщегоНазначения.ОписаниеТипаСтрока(1000);
	// >> 22.03.2023 Федоров Д.Е., КРОК, JIRA№A2105505-955
	
	ОграниченияТипов.Вставить("Склады", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Склады.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Склады");    
	
	ОграниченияТипов.Вставить("Контрагенты", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Контрагенты.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	
	ОграниченияТипов.Вставить("СтатьиДоходов", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.СтатьиДоходов.ОграничениеТипа = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиДоходов");
	
	ОграниченияТипов.Вставить("СтатьиРасходов", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.СтатьиРасходов.ОграничениеТипа = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов");
	
	ОграниченияТипов.Вставить("КатегорииЭксплуатации", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.КатегорииЭксплуатации.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КатегорииЭксплуатации");
	
	ОграниченияТипов.Вставить("ЗоныДоставки", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ЗоныДоставки.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЗоныДоставки");
	
	ОграниченияТипов.Вставить("ФизическиеЛица", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ФизическиеЛица.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	ОграниченияТипов.Вставить("ВидыЦен", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ВидыЦен.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");  
	
	ОграниченияТипов.Вставить("УпаковкиЕдиницыИзмерения", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.УпаковкиЕдиницыИзмерения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
	
	ОграниченияТипов.Вставить("ЭквайринговыеТерминалы", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ЭквайринговыеТерминалы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЭквайринговыеТерминалы");
	
	ОграниченияТипов.Вставить("СкладскиеГруппыНоменклатуры", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.СкладскиеГруппыНоменклатуры.ОграничениеТипа 
		= Новый ОписаниеТипов("СправочникСсылка.СкладскиеГруппыНоменклатуры");
	
	ОграниченияТипов.Вставить("СтандартныйПериод", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.СтандартныйПериод.ОграничениеТипа = Новый ОписаниеТипов("СтандартныйПериод");
	
	ОграниченияТипов.Вставить("ВидыНоменклатуры", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ВидыНоменклатуры.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры");
	
	ОграниченияТипов.Вставить("СоглашенияСКлиентами", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.СоглашенияСКлиентами.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами");
	
	ОграниченияТипов.Вставить("СтруктураПредприятия", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.СтруктураПредприятия.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	
	ОграниченияТипов.Вставить("ДенежнаяСуммаНеотрицательная", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ДенежнаяСуммаНеотрицательная.ОграничениеТипа =
		Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип;
	
	ОграниченияТипов.Вставить("ФорматыМагазинов", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ФорматыМагазинов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ФорматыМагазинов");

	ОграниченияТипов.Вставить("ТомаХраненияФайлов", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ТомаХраненияФайлов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТомаХраненияФайлов");
	
	ОграниченияТипов.Вставить("ШаблоныЭтикетокИЦенников", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ШаблоныЭтикетокИЦенников.ОграничениеТипа =
		Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников");
	
	ОграниченияТипов.Вставить("ТипоразмерыЯчеек", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ТипоразмерыЯчеек.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыЯчеек");
	
	// << 20.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-777
	ОграниченияТипов.Вставить("Валюты", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Валюты.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Валюты");
	
	ОграниченияТипов.Вставить("МестаРазмещения", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.МестаРазмещения.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КР_МестаРазмещения");
	// >> 20.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-777
	
	// << 31.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-1407
	ОграниченияТипов.Вставить("ВидыЦен", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ВидыЦен.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");
	// >> 31.03.2023, Маскаев П.Ю., КРОК, Jira№ A2105505-1407
	
	// << 16.05.2023 Федоров Д.Е., КРОК, JIRA№ A2105505-1112
	ОграниченияТипов.Вставить("БизнесРегионы", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.БизнесРегионы.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БизнесРегионы");
	// >> 16.05.2023 Федоров Д.Е., КРОК, JIRA№ A2105505-1112
	
	// << 23.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1153
	ОграниченияТипов.Вставить("Строка", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Строка.ОграничениеТипа = Новый ОписаниеТипов("Строка");

	ОграниченияТипов.Вставить("Соответствие", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Соответствие.ОграничениеТипа = Новый ОписаниеТипов("Соответствие");
	// >> 23.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-1153
	
	// << 31.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-2245
	ОграниченияТипов.Вставить("Календари", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Календари.ОграничениеТипа = 
		Новый ОписаниеТипов("СправочникСсылка.Календари");
	// >> 31.08.2023 Марченко С.Н., КРОК, JIRA№A2105505-2245
	
	// << 21.09.2023 Марченко С.Н., КРОК, JIRA№A2105505-991
	ОграниченияТипов.Вставить("Структура", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Структура.ОграничениеТипа = Новый ОписаниеТипов("Структура");

	ОграниченияТипов.Вставить("ГруппыПользователей", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ГруппыПользователей.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователей");
	// >> 21.09.2023 Марченко С.Н., КРОК, JIRA№A2105505-991

	// << 07.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2457
	ОграниченияТипов.Вставить("ДоговорыКонтрагентов", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ДоговорыКонтрагентов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	
	ОграниченияТипов.Вставить("Партнеры", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Партнеры.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Партнеры");
	// >> 07.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2457
	
	// << 14.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2497
	ОграниченияТипов.Вставить("Пользователи", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Пользователи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	// >> 14.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2497
	
	// --> Евлахов Игорь Николаевич (Начало) 20.12.2023
	// Задача #3518
	ОграниченияТипов.Вставить("ДополнительныеОтчетыИОбработки", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ДополнительныеОтчетыИОбработки.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
	// <-- Евлахов Игорь Николаевич (Конец) 20.12.2023
	
	// --> Евлахов Игорь Николаевич (Начало) 29.02.2024
	// Задача #3831
	ОграниченияТипов.Вставить("Булево", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.Булево.ОграничениеТипа = Новый ОписаниеТипов("Булево");
	// <-- Евлахов Игорь Николаевич (Конец) 29.02.2024
	
	// --> Евлахов Игорь Николаевич (Начало) 11.09.2024
	// Задача #4674
	ОграниченияТипов.Вставить("ЭтапыИзмененияАссортимента", ПолучитьБазовуюСтруктуруСвойствЭлемента());
	ОграниченияТипов.ЭтапыИзмененияАссортимента.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ЭтапыИзмененияАссортимента");
	// <-- Евлахов Игорь Николаевич (Конец) 11.09.2024
	
	Возврат ОграниченияТипов;
	
КонецФункции

// Процедура добавляет в Соответствие настроек ограничений позицию по имени предопределенного элемента
//
// Параметры:
//  СоответствиеНастроек  - Соответствие - общее соответствие настроек, в которое добавляется значение
//  ИмяПредопределенныхДанных  - Строка - Имя предопределенного элемента для настройки
//  СтруктураСвойствЗначения  - Структура - Структура свойств элемента формы Значения (если <> Неопределено, эелмент Значение будет доступен на форме)
//  СтруктураСвойствСписка  - Структура - Структура свойств элемента формы Значение Списка (если <> Неопределено, эелмент Список будет доступен на форме)
//
Процедура ДобавитьБазовуюСтруктуруСвойстваНастройки(СоответствиеНастроек, ИмяПредопределенныхДанных, 
		СтруктураСвойствЗначения, СтруктураСвойствСписка)
		
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ДоступноЗначение", СтруктураСвойствЗначения <> Неопределено);
	СтруктураНастройки.Вставить("ДоступенСписокЗначений", СтруктураСвойствСписка <> Неопределено);
	СтруктураНастройки.Вставить("СтруктураСвойствЗначения", СтруктураСвойствЗначения);
	СтруктураНастройки.Вставить("СтруктураСвойствСписка", СтруктураСвойствСписка);
		
	СоответствиеНастроек.Вставить(ИмяПредопределенныхДанных, СтруктураНастройки);
	
КонецПроцедуры

Функция ПолучитьБазовуюСтруктуруСвойствЭлемента()

	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ОграничениеТипа", Неопределено);	
	СтруктураСвойств.Вставить("ПараметрыВыбора", Неопределено);	
	Возврат СтруктураСвойств;
	
КонецФункции

#КонецОбласти

#КонецЕсли
