///////////////////////////////////////////////////
//// Справочник "ТМХ_ДополнительныеНастройкиСистемы"
//// Создан: 15.06.2021,  Попов.А.С.,  КРОК,  ТД№10198, Jira№TMHRSB-1941

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// << 23.08.2022, Мельников А.А., КРОК, Jira№ A2105505-384  
	// Есть метод получающий значение настройки через повторное использование. 
	// С помощью этой команды хотя бы один человек не будет перезапускать 1Ску при смене настроек. 
	ОбновитьПовторноИспользуемыеЗначения();  
	// >> 23.08.2022, Мельников А.А., КРОК, Jira№ A2105505-384
	
КонецПроцедуры   

#КонецОбласти

#КонецЕсли
