
#Область СлужебныеПроцедурыИФункции

Функция НачатьОтправкуКаталогаТоваров(НастройкаЭДО, АдресТаблицыТоваров, РезультатПолученияОтпечатков, ИдентификаторФормы) Экспорт
	
	Возврат НастройкиОтправкиЭДОСлужебный.ОтправитьКаталогТоваров(НастройкаЭДО, АдресТаблицыТоваров,
		РезультатПолученияОтпечатков);
	
КонецФункции

Функция НастройкиОтправки(КлючНастроекОтправки) Экспорт
	
	Возврат НастройкиОтправкиЭДОСлужебный.НастройкиОтправки(КлючНастроекОтправки);
	
КонецФункции

Функция НастройкаПоДоговоруКонтрагента(Договор) Экспорт
	
	Возврат НастройкиОтправкиЭДОСлужебный.НастройкаПоДоговоруКонтрагента(Договор);
	
КонецФункции

Функция СсылкаНаОбъектНастройкиЭДО(Организация, Контрагент, Договор) Экспорт
	
	Возврат НастройкиОтправкиЭДОСлужебный.СсылкаНаОбъектНастройкиЭДО(Организация, Контрагент, Договор);
	
КонецФункции

Функция СоглашениеОбОбменеЭлектроннымиДокументами(Организация, Контрагент, ДоговорКонтрагента) Экспорт
	
	Возврат НастройкиОтправкиЭДОСлужебный.СоглашениеОбОбменеЭлектроннымиДокументами(Организация, Контрагент,
		ДоговорКонтрагента);
	
КонецФункции

#КонецОбласти