#Область ПрограммныйИнтерфейс

#Область ЭтапыРасчета

//++ Локализация

// Этап "ПодготовкаДанныхДляУчетаНДСиУСН"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляУчетаНДСиУСН(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляУчетаНДСиУСН");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьРаспределениеПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияПартийНДС(ПараметрыРасчета),
		ОписаниеЦепочекПартийНДС(ПараметрыРасчета),
		ОписаниеДвиженийПартийНДС(ПараметрыРасчета),
		ОписаниеНезаписываемыхПартийНДС(ПараметрыРасчета));
		
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляПартийНДС(ПараметрыРасчета);
	
	// 3. Получение цепочек из исходных данных
	// 	- формирует временные таблицы Источники и Приемники.
	РасчетСебестоимостиПрикладныеАлгоритмы.ПостроитьЦепочкиДвижений(ПараметрыРасчета);
	
	// 4. Заполнение партий в цепочках
	// 	- заполняет таблицу ПараметрыРасчета.РаспределениеПартий.РасчетныеПартии.
	РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьПартииПоЦепочкам(ПараметрыРасчета);
	
	// 5. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ДетализацияПартийТоваровДляНДСиУСН.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// Формирование движений по регистру
	// 
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН.Имя);
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляДетализацииПартийТоваровДляНДСиУСН(ПараметрыРасчета));
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ДетализацияПартийТоваровДляНДСиУСН.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры

//-- Локализация

// Этап "РаспределениеПартийНДСФИФОСкользящая"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеПартийНДСФИФОСкользящая");
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	ИнициализироватьТаблицыДляДокументовВводаОстатков(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ПодготовкаДанныхРаспределенияНДС
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация,
	|	ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.Сторно) КАК Сторно,
	|	ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.Сторно).СторнируемыйДокумент КАК СторнируемыйДокумент
	|ПОМЕСТИТЬ ВТДокументыСторноПредварительная
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И ДД.Регистратор ССЫЛКА Документ.Сторно
	|ИНДЕКСИРОВАТЬ ПО
	|	СторнируемыйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Сторно,
	|	ДД.СторнируемыйДокумент,
	|	ВЫБОР КОГДА ЕСТЬNULL(ДатыСторно.ДатаРегистратора, &НачалоПериода) < &НачалоПериода
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СторноПредыдущегоПериода
	|ПОМЕСТИТЬ ВТДокументыСторно
	|ИЗ
	|	ВТДокументыСторноПредварительная КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДатыСторно
	|		ПО ДатыСторно.Организация = ДД.Организация
	|		И ДатыСторно.Документ = ДД.СторнируемыйДокумент
	|ИНДЕКСИРОВАТЬ ПО
	|	Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|	(Т.ДопРасходы - Т.ДопРасходыСписание) / Т.ДопРасходы КАК Коэффициент
	|ПОМЕСТИТЬ ВТКоэффициентыДопРасходов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.РазделУчета,
	|		Т.АналитикаУчетаНоменклатуры,
	|		Т.ВидЗапасов,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидДеятельностиНДС,
	|		Т.АналитикаФинансовогоУчета,
	|  		СУММА(Т.ДопРасходыРегл) КАК ДопРасходы,
	|   	СУММА(ВЫБОР КОГДА Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|			ТОГДА Т.ДопРасходыРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДопРасходыСписание
	|	ИЗ
	|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|		И Т.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|		И Т.СлужебноеВидДвиженияПриход
	|		И Т.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы), ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
	|		И Т.ДопРасходыРегл <> 0
	|	СГРУППИРОВАТЬ ПО
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.РазделУчета,
	|		Т.АналитикаУчетаНоменклатуры,
	|		Т.ВидЗапасов,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидДеятельностиНДС,
	|		Т.АналитикаФинансовогоУчета
	|	) КАК Т
	|ГДЕ
	|	Т.ДопРасходыСписание <> 0
	|	И Т.ДопРасходы <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	Т.Ссылка,
	|	0 КАК КоэффициентУпр,
	|	0 КАК КоэффициентРегл
	|ПОМЕСТИТЬ ВТСтатьиПроизводственныхЗатрат
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Т
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	ВЫБОР КОГДА Т.ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентУпр,
	|	ВЫБОР КОГДА Т.ВариантРаспределенияРасходовРегл В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентРегл
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Т
	|ГДЕ
	|	&ЕстьОрганизацииСРаздельнымУчетомПостатейныхЗатрат
	|	И (Т.ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		ИЛИ Т.ВариантРаспределенияРасходовРегл В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|	)
	|	И Т.ВариантРаздельногоУчетаНДС <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	//-- Локализация
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	|	СУММА(ДД.ДопРасходыРегл)	КАК ДопРасходыРегл,
	|	СУММА(ДД.ДопРасходыУпр)		КАК ДопРасходыУпр,
	|	СУММА(ДД.НДСРегл)			КАК НДСРегл,
	|	СУММА(ДД.НДСУпр)			КАК НДСУпр,
	|	СУММА(ДД.Количество)		КАК Количество
	|ПОМЕСТИТЬ СписаниеОтклоненийВСтоимости2_4
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
	|	И НЕ ДД.СлужебноеВидДвиженияПриход
	|	И НЕ ДД.Регистратор ССЫЛКА Документ.Сторно
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|	СУММА(ДД.КоличествоОстаток) КАК Количество,
	|	СУММА(ДД.СтоимостьОстаток) КАК СтоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДСОстаток) КАК СтоимостьБезНДС
	|ПОМЕСТИТЬ ВТОстаткиСебестоимостиДляПартийНДС
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаКонецПредыдущегоПериода,
	|		Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)) КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета
	|ИМЕЮЩИЕ
	|	СУММА(ДД.КоличествоОстаток) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	// Аналитики себестоимости
	|	ДД.Организация КАК Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Кор. аналитики себестоимости
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.КорПартия,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорВидДеятельностиНДС,
	|	ДД.КорАналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.ТипЗаписи,
	|	ДД.Подразделение,
	|	ДД.Сторно,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовАктивов,
	|	НАЧАЛОПЕРИОДА(ДД.ПериодПродажи, МЕСЯЦ) КАК ПериодПродажи,
	|	ДД.ДокументИсточник КАК Реализация,
	|
	// Ресурсы
	|	ДД.Количество КАК Количество
	|ПОМЕСТИТЬ ВТВозвратыПрошлыхПериодов
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиСебестоимостиДляПартийНДС КАК Остатки
	|		ПО ДД.Организация = Остатки.Организация
	|		И ДД.РазделУчета = Остатки.РазделУчета
	|		И ДД.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|		И ДД.ВидЗапасов = Остатки.ВидЗапасов
	|		И ДД.Партия = Остатки.Партия
	|		И ДД.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И ДД.ВидДеятельностиНДС = Остатки.ВидДеятельностиНДС
	|		И ДД.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
	|ГДЕ
	|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И ДД.Партия <> НЕОПРЕДЕЛЕНО
	|   И ДД.СлужебноеВидДвиженияПриход
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов)
	|	И ДД.Количество <> 0
	|	И Остатки.Организация ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодПродажи,
	|	КорАналитикаУчетаНоменклатуры,
	|	Организация,
	|	КорПартия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Реализация КАК Реализация
	|ПОМЕСТИТЬ ВТРеализацииВозвратов
	|ИЗ
	|	ВТВозвратыПрошлыхПериодов КАК Т
	|ГДЕ
	|	Т.Реализация <> НЕОПРЕДЕЛЕНО
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//++ Локализация
	|ВЫБРАТЬ
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.НаправлениеДеятельности,
	|	Т.СтоимостьБезНДС,
	|	Т.НДС,
	|	Т.СтоимостьБезНДСУпр,
	|	Т.НДСУпр
	|ПОМЕСТИТЬ ДетализацияПартийРеализаций
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРеализацииВозвратов КАК Реализации
	|		ПО Т.Регистратор = Реализации.Реализация
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТСебестоимостиРеализаций
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРеализацииВозвратов КАК Реализации
	|		ПО Т.Регистратор = Реализации.Реализация
	|ГДЕ
	|	Т.Регистратор В (ВЫБРАТЬ РАЗЛИЧНЫЕ Отбор.Регистратор ИЗ ДетализацияПартийРеализаций КАК Отбор)
	|	И Т.Количество <> 0
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика,
	|	ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	ПартииНДС.ДокументПоступления,
	|	ПартииНДС.АналитикаУчетаПартийДокументаПоступления,
	|	ПартииНДС.СтоимостьБезНДС / Т.Количество КАК СтоимостьБезНДС,
	|	ПартииНДС.НДС / Т.Количество КАК НДС,
	|	ПартииНДС.СтоимостьБезНДСУпр / Т.Количество КАК СтоимостьБезНДСУпр,
	|	ПартииНДС.НДСУпр / Т.Количество КАК НДСУпр
	|ПОМЕСТИТЬ ВТПартииНДСРеализаций
	|ИЗ
	|	ВТСебестоимостиРеализаций КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДетализацияПартийРеализаций КАК ПартииНДС
	|		ПО Т.Регистратор = ПартииНДС.Регистратор
	|		И Т.Организация = ПартииНДС.Организация
	|		И Т.Партия = ПартииНДС.Партия
	|		И Т.АналитикаУчетаПартий = ПартииНДС.АналитикаУчетаПартий
	|		И (Т.Номенклатура = ПартииНДС.Номенклатура ИЛИ ПартииНДС.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		И (Т.Характеристика = ПартииНДС.Характеристика ИЛИ ПартииНДС.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		И (Т.НаправлениеДеятельности = ПартииНДС.НаправлениеДеятельности ИЛИ ПартииНДС.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//-- Локализация
	|ВЫБРАТЬ
	|	Возвраты.НомерЗаписи,
	|	0 КАК НомерИсточника,
	|	Возвраты.Регистратор КАК Регистратор,
	|	Возвраты.ТипЗаписи,
	|	Возвраты.Подразделение,
	|	Возвраты.Сторно,
	|	Возвраты.СтатьяРасходовАктивов,
	|	Возвраты.АналитикаРасходовАктивов,
	|	Возвраты.ПериодПродажи КАК Период,
	|	Возвраты.Организация,
	|	Возвраты.АналитикаУчетаНоменклатуры,
	|	Возвраты.ВидЗапасов,
	|	Возвраты.РазделУчета,
	|	Возвраты.Партия,
	|	Возвраты.АналитикаУчетаПартий,
	|	Возвраты.АналитикаФинансовогоУчета,
	|	Возвраты.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.СтоимостьСНДС КАК СтоимостьСНДС,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл КАК СтоимостьБезНДСРегл,
	|	Т.НДСРегл КАК НДСРегл,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр,
	|	Возвраты.Количество КАК Количество
	|ПОМЕСТИТЬ ВТЦеныПартииНДСВозвратов
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВозвратыПрошлыхПериодов КАК Возвраты
	|		ПО Т.Организация = Возвраты.Организация
	|		И Т.Партия = Возвраты.Партия
	|		И Т.АналитикаУчетаПартий = Возвраты.АналитикаУчетаПартий
	|		И Т.ВидЗапасов = Возвраты.ВидЗапасов
	|		И Т.Номенклатура = ВЫРАЗИТЬ(Возвраты.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура
	|		И Т.Характеристика = ВЫРАЗИТЬ(Возвраты.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика
	|ГДЕ
	|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И НЕ Т.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Возвраты.НомерЗаписи,
	|	1 КАК НомерИсточника,
	|	Возвраты.Регистратор,
	|	Возвраты.ТипЗаписи,
	|	Возвраты.Подразделение,
	|	Возвраты.Сторно,
	|	Возвраты.СтатьяРасходовАктивов,
	|	Возвраты.АналитикаРасходовАктивов,
	|	Т.Период,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|	0 КАК СтоимостьСНДС,
	|	0 КАК СтоимостьБезНДС,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДСРегл,
	|	Т.НДС КАК НДСРегл,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр,
	|	Возвраты.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВозвратыПрошлыхПериодов КАК Возвраты
	|		ПО Т.Период = Возвраты.ПериодПродажи
	|		И Т.Организация = Возвраты.Организация
	|		И Т.РазделУчета = Возвраты.РазделУчета
	|		И Т.АналитикаУчетаНоменклатуры = Возвраты.КорАналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Возвраты.КорВидЗапасов
	|		И Т.Партия = Возвраты.КорПартия
	|		И Т.АналитикаУчетаПартий = Возвраты.КорАналитикаУчетаПартий
	//  в возврате прошлого периода кор.виддеятельности НДС не заполняется из документа реализации
	|		И Т.АналитикаФинансовогоУчета = Возвраты.КорАналитикаФинансовогоУчета
	|ГДЕ
	|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И НЕ Т.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Возвраты.НомерЗаписи,
	|	2 КАК НомерИсточника,
	|	Возвраты.Регистратор,
	|	Возвраты.ТипЗаписи,
	|	Возвраты.Подразделение,
	|	Возвраты.Сторно,
	|	Возвраты.СтатьяРасходовАктивов,
	|	Возвраты.АналитикаРасходовАктивов,
	|	Возвраты.ПериодПродажи КАК Период,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Возвраты.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|	0 КАК СтоимостьСНДС,
	|	0 КАК СтоимостьБезНДС,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДСРегл,
	|	Т.НДС КАК НДСРегл,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр,
	|	Возвраты.Количество КАК Количество
	|ИЗ
	|	ВТПартииНДСРеализаций КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВозвратыПрошлыхПериодов КАК Возвраты
	|		ПО Т.Регистратор = Возвраты.Реализация
	|		И Т.Организация = Возвраты.Организация
	|		И Т.РазделУчета = Возвраты.РазделУчета
	|		И Т.АналитикаУчетаНоменклатуры = Возвраты.КорАналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Возвраты.КорВидЗапасов
	|		И Т.Партия = Возвраты.КорПартия
	|		И Т.АналитикаУчетаПартий = Возвраты.КорАналитикаУчетаПартий
	|		И Т.АналитикаФинансовогоУчета = Возвраты.КорАналитикаФинансовогоУчета
	|
	//-- Локализация
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаписи,
	|	НомерИсточника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерЗаписи,
	|	МИНИМУМ(Т.НомерИсточника) КАК НомерИсточника
	|ПОМЕСТИТЬ ИсточникиЦенВозвратов
	|ИЗ
	|	ВТЦеныПартииНДСВозвратов КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.НомерЗаписи
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерЗаписи,
	|	НомерИсточника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПредыдущегоПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов,
	|	Остатки.РазделУчета,
	|	Остатки.Партия КАК Партия,
	|	Остатки.АналитикаУчетаПартий,
	|	Остатки.АналитикаФинансовогоУчета,
	|	Остатки.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.ЗатратыПредыдущихПеределов,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьСНДС) КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДС) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСРегл) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСРегл) КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСУпр) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСУпр) КАК ЧИСЛО(31,10)) КАК НДСУпр,
	|	СУММА(Остатки.Количество) КАК КоличествоПартии
	|ПОМЕСТИТЬ ВТЦеныПартийТоваровНаНачалоПериода
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиСебестоимостиДляПартийНДС КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Номенклатура = ВЫРАЗИТЬ(Остатки.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура
	|		И Т.Характеристика = ВЫРАЗИТЬ(Остатки.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика
	|		И (Остатки.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			ИЛИ Остатки.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатурыНЗП)
	|ГДЕ
	|	Т.ПериодРегистрации < &НачалоПериода
	|	И Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Организация,
	|	Остатки.АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов,
	|	Остатки.РазделУчета,
	|	Остатки.Партия,
	|	Остатки.АналитикаУчетаПартий,
	|	Остатки.АналитикаФинансовогоУчета,
	|	Остатки.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.ЗатратыПредыдущихПеределов
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(Т.Период), МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ПериодПредыдущегоРассчитанногоПериода
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период < &НачалоПериода
	|	И Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	//++ Локализация
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ВЫРАЗИТЬ(СУММА(Остатки.СтоимостьСНДС / Остатки.Количество) КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(СУММА(Остатки.СтоимостьБезНДС / Остатки.Количество) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДС) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.НДС) КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСУпр) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСУпр) КАК ЧИСЛО(31,10)) КАК НДСУпр,
	|	СУММА(Т.КоличествоПартии) КАК КоличествоПартии
	|ПОМЕСТИТЬ ВТЦеныПартийНДСНаНачалоПериодаПредварительная
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодПредыдущегоРассчитанногоПериода КАК ПериодДвижений
	|		ПО Т.Период = ПериодДвижений.Период
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиСебестоимостиДляПартийНДС КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.РазделУчета = Остатки.РазделУчета
	|		И Т.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И Т.ВидДеятельностиНДС = Остатки.ВидДеятельностиНДС
	|		И Т.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
	|ГДЕ
	|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И НЕ Т.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|	И Т.КоличествоПартии >= 0
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Партия
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТЦеныПартийНДСПеременные
	|ИЗ
	|	ВТЦеныПартийНДСНаНачалоПериодаПредварительная КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Партия
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтоимостьСНДС,
	|	Т.СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл,
	|	Т.НДСРегл,
	|	Т.СтоимостьБезНДСУпр,
	|	Т.НДСУпр,
	|	Т.КоличествоПартии,
	|	ВЫБОР КОГДА ПартииПеременные.Организация ЕСТЬ NULL
	|		ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоПеременныеЗатраты
	|ПОМЕСТИТЬ ВТЦеныПартийНДСНаНачалоПериода
	|ИЗ
	|	ВТЦеныПартийНДСНаНачалоПериодаПредварительная КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныПартийНДСПеременные КАК ПартииПеременные
	|		ПО Т.Организация = ПартииПеременные.Организация
	|		И Т.Номенклатура = ПартииПеременные.Номенклатура
	|		И Т.Характеристика = ПартииПеременные.Характеристика
	|		И Т.ВидЗапасов = ПартииПеременные.ВидЗапасов
	|		И Т.Партия = ПартииПеременные.Партия
	|		И Т.АналитикаУчетаПартий = ПартииПеременные.АналитикаУчетаПартий
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партия
	|;
	//-- Локализация
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК КодИсточника,
	|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
	|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	// Аналитики партий НДС
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ВЫБОР
	|		КОГДА НЕ Корректировка.ВидКорректировки ЕСТЬ NULL
	|		 И (Корректировка.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
	|			ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения))
	|			ТОГДА Корректировка.ДокументОснование
	//++ Локализация
	|		КОГДА НЕ СчетФактура.Исправление ЕСТЬ NULL И СчетФактура.Исправление
	|			ТОГДА СчетФактура.СчетФактураОснование
	//-- Локализация
	|		ИНАЧЕ ДД.Регистратор
	|	КОНЕЦ КАК ДокументПоступления,
	|	ВЫБОР
	|		КОГДА ДД.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		КОГДА ДД.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|		 И ДД.Количество = 0
	|		 И ДД.КорАналитикаУчетаПартий <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия) И ДД.Количество = 0
	|		 И ДД.КорАналитикаУчетаПартий <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		ИНАЧЕ ДД.АналитикаУчетаПартий
	|	КОНЕЦ КАК АналитикаУчетаПартийДокументаПоступления,
	|	
	// Аналитики себестоимости
	|	ДД.Организация КАК Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.ТипЗаписи,
	|	ДД.Подразделение,
	|	ДД.Сторно,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.СтатьяРасходовСписания
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.СтатьяАктивовПассивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КОНЕЦ КАК СтатьяРасходовАктивов,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.АналитикаРасходов
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.АналитикаАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК АналитикаРасходовАктивов,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|	(ВЫБОР
	|		КОГДА ДД.ДопРасходыРегл <> 0 ТОГДА ИСТИНА
	|		КОГДА ДД.СтоимостьРегл = 0 И ДД.НДСРегл <> 0 ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЭтоДопРасходы,
	|
	// Ресурсы
	|	СУММА(ДД.Стоимость) КАК СтоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл + ДД.ДопРасходыРегл
	|		+ ВЫБОР
	|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -ДД.НДСРегл
	|			КОГДА ДД.Регистратор ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт
	|			 И ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -ДД.НДСРегл
	|			ИНАЧЕ 0
	|	КОНЕЦ - ЕСТЬNULL(СписаниеОтклонений.ДопРасходыРегл, 0)) КАК СтоимостьБезНДСРегл,
	|	СУММА(ДД.НДСРегл - ЕСТЬNULL(СписаниеОтклонений.НДСРегл, 0)) КАК НДСРегл,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр
	|		+ ВЫБОР
	|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -ДД.НДСУпр
	|			КОГДА ДД.Регистратор ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт
	|			 И ДД.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -ДД.НДСРегл
	|			ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(СписаниеОтклонений.ДопРасходыУпр, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьБезНДСУпр,
	|	СУММА(ВЫБОР
	|		КОГДА &УправленческийУчетОрганизаций
	|			ТОГДА ДД.НДСУпр - ЕСТЬNULL(СписаниеОтклонений.НДСУпр, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК НДСУпр,
	|	СУММА(ДД.Количество) КАК Количество
	|
	|ПОМЕСТИТЬ ПриходыТоваровНДС2_4
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаРасчетов
	|		ПО АналитикаРасчетов.Ссылка = ДД.АналитикаУчетаПоПартнерам
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Договоры.Ссылка = АналитикаРасчетов.Договор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
	|		ПО Корректировка.Ссылка = ДД.Регистратор
	//++ Локализация
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйНалоговыйАгент КАК СчетФактура
	|		ПО СчетФактура.Ссылка = ДД.Регистратор
	//-- Локализация
	|	ЛЕВОЕ СОЕДИНЕНИЕ СписаниеОтклоненийВСтоимости2_4 КАК СписаниеОтклонений
	|		ПО СписаниеОтклонений.Организация = ДД.Организация
	|		И СписаниеОтклонений.РазделУчета = ДД.РазделУчета
	|		И СписаниеОтклонений.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И СписаниеОтклонений.ВидЗапасов = ДД.ВидЗапасов
	|		И СписаниеОтклонений.Партия = ДД.Партия
	|		И СписаниеОтклонений.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
	|		И СписаниеОтклонений.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
	|		И СписаниеОтклонений.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
	|		И ДД.СлужебноеВидДвиженияПриход
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = ДД.ДокументИсточник
	|		И НЕ Реестр.ДополнительнаяЗапись
	|		И Реестр.Ссылка <> НЕОПРЕДЕЛЕНО
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыСторно КАК ДокументыСторно
	|		ПО ДокументыСторно.Сторно = ДД.Регистратор
	|		И ДокументыСторно.СторноПредыдущегоПериода
	|ГДЕ
	|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И ДД.Партия <> НЕОПРЕДЕЛЕНО
	|   И (ДД.СлужебноеВидДвиженияПриход
	|		ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
	|		ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	// Исключаем суммовую корректировку приобретения, если корректируемый документ относится к периоду с выключенным партионным учетом.
	|	И НЕ (
	|		ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
	|		И ДД.СлужебноеВидДвиженияПриход
	|		И ДД.Количество = 0
	|		И Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
	|		И &ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ЛОЖЬ)
	// Исключаем возвратные отходы в производственных затратах
	|	И НЕ (
	|		ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
	|		И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|		)
	// Исключаем выпуск продукции по плановой стоимости
	|	И НЕ (
	|		ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|		И ДД.Количество <> 0
	|		И ДД.СтоимостьРегл <> 0
	|		)
	|	И (ДД.ТипЗаписи В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение))
	|		ИЛИ (ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|			И ТИПЗНАЧЕНИЯ(ДД.Регистратор) В (
	|				ТИП(Документ.ПоступлениеТоваровНаСклад),
	|				ТИП(Документ.КорректировкаПриобретения)))
	|		)
	|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	И (ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|		ИЛИ ДД.СлужебноеВидДвиженияПриход
	|			И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|		)
	|	И НЕ ДД.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
	|	И НЕ ДД.Регистратор ССЫЛКА Документ.ВводОстатков
	|	И НЕ ДД.Регистратор ССЫЛКА Документ.ВводОстатковТоваров
	//++ Локализация
	//-- Локализация
	|	И НЕ ДД.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|	И ДокументыСторно.Сторно ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
	|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		КОГДА ДД.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|		 И ДД.Количество = 0
	|		 И ДД.КорАналитикаУчетаПартий <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия) И ДД.Количество = 0
	|		 И ДД.КорАналитикаУчетаПартий <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		ИНАЧЕ ДД.АналитикаУчетаПартий
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ Корректировка.ВидКорректировки ЕСТЬ NULL
	|		 И (Корректировка.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
	|			ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения))
	|			ТОГДА Корректировка.ДокументОснование
	//++ Локализация
	|		КОГДА НЕ СчетФактура.Исправление ЕСТЬ NULL И СчетФактура.Исправление
	|			ТОГДА СчетФактура.СчетФактураОснование
	//-- Локализация
	|		ИНАЧЕ ДД.Регистратор
	|	КОНЕЦ,
	|	
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Подразделение,
	|	ДД.Сторно,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.СтатьяРасходовСписания
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.СтатьяАктивовПассивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.АналитикаРасходов
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.АналитикаАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ,
	|	ДД.ТипЗаписи,
	|	(ВЫБОР
	|		КОГДА ДД.ДопРасходыРегл <> 0 ТОГДА ИСТИНА
	|		КОГДА ДД.СтоимостьРегл = 0 И ДД.НДСРегл <> 0 ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) // КАК ЭтоДопРасходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Списание отклонений в стоимости
	|ВЫБРАТЬ
	|	1 КАК КодИсточника,
	|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
	|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		ИНАЧЕ ДД.АналитикаУчетаПартий
	|	КОНЕЦ,
	|	
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.ТипЗаписи,
	|	ДД.Подразделение,
	|	ДД.Сторно,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.СтатьяРасходовСписания
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.СтатьяАктивовПассивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КОНЕЦ КАК СтатьяРасходовАктивов,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.АналитикаРасходов
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.АналитикаАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК АналитикаРасходовАктивов,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|	ИСТИНА КАК ЭтоДопРасходы,
	|
	|	СУММА(ДД.Стоимость) КАК СтоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(СписаниеОтклонений.ДопРасходыРегл
	|		+ ВЫБОР
	|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -СписаниеОтклонений.НДСРегл
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьБезНДСРегл,
	|	СУММА(СписаниеОтклонений.НДСРегл) КАК НДСРегл,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА СписаниеОтклонений.ДопРасходыУпр
	|			+ ВЫБОР
	|				КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -СписаниеОтклонений.НДСУпр
	|				ИНАЧЕ 0
	|			  КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьБезНДСУпр,
	|	СУММА(ВЫБОР
	|		КОГДА &УправленческийУчетОрганизаций
	|			ТОГДА СписаниеОтклонений.НДСУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК НДСУпр,
	|	СУММА(ДД.Количество) КАК Количество
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписаниеОтклоненийВСтоимости2_4 КАК СписаниеОтклонений
	|		ПО СписаниеОтклонений.Организация = ДД.Организация
	|		И СписаниеОтклонений.РазделУчета = ДД.РазделУчета
	|		И СписаниеОтклонений.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И СписаниеОтклонений.ВидЗапасов = ДД.ВидЗапасов
	|		И СписаниеОтклонений.Партия = ДД.Партия
	|		И СписаниеОтклонений.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
	|		И СписаниеОтклонений.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
	|		И СписаниеОтклонений.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
	|		И ДД.СлужебноеВидДвиженияПриход
	|ГДЕ
	|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И ДД.Партия <> НЕОПРЕДЕЛЕНО
	|	И ДД.СлужебноеВидДвиженияПриход
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
	|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
	|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	(ВЫБОР
	|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ТОГДА ДД.КорАналитикаУчетаПартий
	|		ИНАЧЕ ДД.АналитикаУчетаПартий КОНЕЦ),
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.Период,
	|	ДД.Подразделение,
	|	ДД.Сторно,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.СтатьяРасходовСписания
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.СтатьяАктивовПассивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.АналитикаРасходов
	|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА ДД.АналитикаАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ,
	|	ДД.ТипЗаписи
	|
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Остатки себестоимости по ценам старого регистра
	|ВЫБРАТЬ
	|	2 КАК КодИсточника,
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	// Аналитики партий НДС
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Цены.ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления,
	|	
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	&НачалоПериода,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР КОГДА Цены.ЭтоПеременныеЗатраты
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Расчетное)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Остаток)
	|	КОНЕЦ КАК ТипЗаписи,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ КАК Сторно,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовАктивов,
	|	ДД.Партия <> Цены.ДокументПоступления КАК ЗатратыПредыдущихПеределов,
	|	Цены.ЭтоПеременныеЗатраты КАК ЭтоДопРасходы,
	|
	// Ресурсы
	|	ВЫРАЗИТЬ(Цены.СтоимостьСНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСУпр,
	|	ДД.Количество КАК Количество
	|ИЗ
	|	ВТОстаткиСебестоимостиДляПартийНДС КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПартийНДСНаНачалоПериода КАК Цены
	|		ПО Цены.Организация = ДД.Организация
	|		И Цены.РазделУчета = ДД.РазделУчета
	|		И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И Цены.ВидЗапасов = ДД.ВидЗапасов
	|		И Цены.Партия = ДД.Партия
	|		И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
	|		И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
	|		И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
	|ГДЕ
	|	Цены.КоличествоПартии > 0
	|	И (Цены.СтоимостьСНДС <> 0
	|		ИЛИ Цены.СтоимостьБезНДС <> 0
	|		ИЛИ Цены.СтоимостьБезНДСРегл <> 0
	|		ИЛИ Цены.НДСРегл <> 0
	|		ИЛИ Цены.СтоимостьБезНДСУпр <> 0
	|		ИЛИ Цены.НДСУпр <> 0)
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Остатки себестоимости по ценам нового регистра
	|ВЫБРАТЬ
	|	3 КАК КодИсточника,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	// Аналитики партий НДС
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Цены.ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления,
	|	
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	&НачалоПериода,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Остаток),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ КАК Сторно,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовАктивов,
	|	Цены.ЗатратыПредыдущихПеределов,
	|	ЛОЖЬ КАК ЭтоДопРасходы,
	|
	// Ресурсы
	|	ВЫРАЗИТЬ(Цены.СтоимостьСНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСУпр,
	|	ДД.Количество КАК Количество
	|ИЗ
	|	ВТОстаткиСебестоимостиДляПартийНДС КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПартийТоваровНаНачалоПериода КАК Цены
	|		ПО Цены.Организация = ДД.Организация
	|		И Цены.РазделУчета = ДД.РазделУчета
	|		И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И Цены.ВидЗапасов = ДД.ВидЗапасов
	|		И Цены.Партия = ДД.Партия
	|		И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
	|		И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
	|		И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
	|ГДЕ
	|	Цены.КоличествоПартии > 0
	|	И (Цены.СтоимостьСНДС <> 0
	|		ИЛИ Цены.СтоимостьБезНДС <> 0
	|		ИЛИ Цены.СтоимостьБезНДСРегл <> 0
	|		ИЛИ Цены.НДСРегл <> 0
	|		ИЛИ Цены.СтоимостьБезНДСУпр <> 0
	|		ИЛИ Цены.НДСУпр <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Возвраты реализаций прошлых периодов
	|ВЫБРАТЬ
	|	4 КАК КодИсточника,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	// Аналитики партий НДС
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	
	// Аналитики себестоимости
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	Т.Период,
	|	Т.Регистратор,
	|	Т.ТипЗаписи,
	|	Т.Подразделение,
	|	Т.Сторно,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходовАктивов,
	|	Т.ЗатратыПредыдущихПеределов,
	|	ЛОЖЬ КАК ЭтоДопРасходы,
	|
	// Ресурсы
	|	ВЫРАЗИТЬ(Т.СтоимостьСНДС * Т.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(Т.СтоимостьБезНДС * Т.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Т.СтоимостьБезНДСРегл * Т.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(Т.НДСРегл * Т.Количество КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(Т.СтоимостьБезНДСУпр * Т.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Т.НДСУпр * Т.Количество КАК ЧИСЛО(31,10)) КАК НДСУпр,
	|	Т.Количество КАК Количество
	|ИЗ
	|	ВТЦеныПартииНДСВозвратов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсточникиЦенВозвратов КАК Возвраты
	|		ПО Т.НомерЗаписи = Возвраты.НомерЗаписи
	|		И Т.НомерИсточника = Возвраты.НомерИсточника
	|ГДЕ
	|	Т.СтоимостьСНДС <> 0
	|		ИЛИ Т.СтоимостьБезНДС <> 0
	|		ИЛИ Т.СтоимостьБезНДСРегл <> 0
	|		ИЛИ Т.НДСРегл <> 0
	|		ИЛИ Т.СтоимостьБезНДСУпр <> 0
	|		ИЛИ Т.НДСУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Ввод остатков товаров
	|ВЫБРАТЬ
	|	6 КАК КодИсточника,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	// Аналитики партий НДС
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	&НачалоПериода КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР КОГДА ДД.ЭтоПеременныеДопРасходы
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Расчетное)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ТипЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ЛОЖЬ КАК Сторно,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовАктивов,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|	ДД.ЭтоПеременныеДопРасходы КАК ЭтоДопРасходы,
	|
	// Ресурсы
	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА ВЫБОР
	|				КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА ДД.СтоимостьБезНДСУпр
	|				ИНАЧЕ ДД.СтоимостьБезНДСУпр + ДД.НДСУпр
	|			  КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ 					КАК СтоимостьСНДС,
	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА ДД.СтоимостьБезНДСУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 					КАК СтоимостьБезНДС,
	|	ДД.СтоимостьБезНДС  	КАК СтоимостьБезНДСРегл,
	|	ДД.НДС  				КАК НДСРегл,
	|	ДД.СтоимостьБезНДСУпр  	КАК СтоимостьБезНДСУпр,
	|	ДД.НДСУпр  				КАК НДСУпр,
	|	ВЫБОР КОГДА ДД.Количество = 0 ТОГДА 1 ИНАЧЕ ДД.Количество КОНЕЦ КАК Количество
	|ИЗ
	|	ВТДвиженияВводаОстатков КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО ДД.СтатьяРасходовАктивов = Статьи.Ссылка
	|ГДЕ
	|	(ДД.СтоимостьБезНДС <> 0
	|		ИЛИ ДД.НДС <> 0
	|		ИЛИ ДД.СтоимостьБезНДСУпр <> 0
	|		ИЛИ ДД.НДСУпр <> 0)
	|	И Статьи.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПеременные,
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПостоянные,
	// Аналитики партий НДС
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаПартийДокументаПоступления,
	|	ДД.ЗатратыПредыдущихПеределов,
	|	ДД.ЭтоДопРасходы,
	|	ДД.ЭтоПеременныеДопРасходы,
	|	
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходовАктивов КАК АналитикаРасходов,
	|
	// Ресурсы
	|	ВЫБОР КОГДА ДД.СтоимостьСНДС < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьСНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДС < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСРегл < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДСРегл,
	|	ВЫБОР КОГДА ДД.НДСРегл < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакНДСРегл,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСУпр < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДСУпр,
	|	ВЫБОР КОГДА ДД.НДСУпр < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакНДСУпр,
	|
	|	ВЫБОР КОГДА ДД.СтоимостьСНДС < 0 ТОГДА -ДД.СтоимостьСНДС ИНАЧЕ ДД.СтоимостьСНДС КОНЕЦ КАК СтоимостьСНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДС < 0 ТОГДА -ДД.СтоимостьБезНДС ИНАЧЕ ДД.СтоимостьБезНДС КОНЕЦ КАК СтоимостьБезНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСРегл < 0 ТОГДА -ДД.СтоимостьБезНДСРегл ИНАЧЕ ДД.СтоимостьБезНДСРегл КОНЕЦ КАК СтоимостьБезНДСРегл,
	|	ВЫБОР КОГДА ДД.НДСРегл < 0 ТОГДА -ДД.НДСРегл ИНАЧЕ ДД.НДСРегл КОНЕЦ КАК НДСРегл,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСУпр < 0 ТОГДА -ДД.СтоимостьБезНДСУпр ИНАЧЕ ДД.СтоимостьБезНДСУпр КОНЕЦ КАК СтоимостьБезНДСУпр,
	|	ВЫБОР КОГДА ДД.НДСУпр < 0 ТОГДА -ДД.НДСУпр ИНАЧЕ ДД.НДСУпр КОНЕЦ КАК НДСУпр
	|ПОМЕСТИТЬ ПриходыТоваровНДС2_4_ДляРешенияСЛУ
	|ИЗ
	|(ВЫБРАТЬ
	// Аналитики партий НДС
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.ДокументПоступления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.АналитикаУчетаПартийДокументаПоступления
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДД.СтатьяРасходовАктивов,
	|	ДД.АналитикаРасходовАктивов,
	|	ДД.ЗатратыПредыдущихПеределов,
	|	ДД.ЭтоДопРасходы,
	|	ВЫБОР КОГДА ДД.ЭтоДопРасходы
	|	 И ДД.ТипЗаписи В
	|	  (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
	|	   ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Расчетное))
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПеременныеДопРасходы,
	|	
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Ресурсы
	|	СУММА(ДД.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(ДД.НДСРегл) КАК НДСРегл,
	|	СУММА(ДД.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(ДД.НДСУпр) КАК НДСУпр
	|ИЗ
	|	ПриходыТоваровНДС2_4 КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.ДокументПоступления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.АналитикаУчетаПартийДокументаПоступления
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяРасходовАктивов,
	|	ДД.АналитикаРасходовАктивов,
	|	ДД.ЗатратыПредыдущихПеределов,
	|	ДД.ЭтоДопРасходы,
	|	ВЫБОР КОГДА ДД.ЭтоДопРасходы
	|	 И ДД.ТипЗаписи В
	|	  (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
	|	   ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Расчетное))
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета
	|) КАК ДД
	|ГДЕ
	|	ДД.СтоимостьСНДС <> 0
	|	ИЛИ ДД.СтоимостьБезНДС <> 0
	|	ИЛИ ДД.СтоимостьБезНДСРегл <> 0
	|	ИЛИ ДД.НДСРегл <> 0
	|	ИЛИ ДД.СтоимостьБезНДСУпр <> 0
	|	ИЛИ ДД.НДСУпр <> 0
    |";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти 
	
	РаспределитьНДСПоСебестоимости(ПараметрыРасчета, "ПриходыТоваровНДС2_4_ДляРешенияСЛУ");
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
		ПараметрыРасчета,
		СуществующиеВТ + ", ПриходыТоваровНДС2_4, ВТОстаткиСебестоимостиДляПартийНДС, ВТВозвратыПрошлыхПериодов, ВТДвиженияВводаОстатков, ВТСтатьиПроизводственныхЗатрат, ВТКоэффициентыДопРасходов");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

// Этап "РаспределениеПартийНДСФИФОСкользящаяПоДопРасходам"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеПартийНДСФИФОСкользящаяПоДопРасходам");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьРаспределениеПартий(
		ПараметрыРасчета,
		ТаблицаРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета),
		ОписаниеЦепочекРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета),
		ОписаниеДвиженийРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета),
		ОписаниеНезаписываемыхРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета));
		
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные
	ПолучитьДанныеДляРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета);
	
	// 3. Получение цепочек из исходных данных
	// 	- формирует временные таблицы Источники и Приемники
	РасчетСебестоимостиПрикладныеАлгоритмы.ПостроитьЦепочкиДвижений(ПараметрыРасчета);
	
	// 4. Заполнение партий в цепочках
	// 	- заполняет таблицу ПараметрыРасчета.РаспределениеПартий.РасчетныеПартии
	РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьПартииПоЦепочкам(ПараметрыРасчета);
	
	// 5. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ВТДопРасходыДляПостатейныхЗатрат
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ПодготовкаДанныхРаспределенияНДС
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Регистратор,
	// Аналитики партий НДС
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	// Аналитики себестоимости
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	// Прочие поля
	|	Т.СтатьяРасходовАктивов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|
	// Ресурсы
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * Т.СтоимостьСНДС КАК ЧИСЛО(31,2))) КАК СтоимостьСНДС,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * Т.СтоимостьБезНДС КАК ЧИСЛО(31,2))) КАК СтоимостьБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * Т.СтоимостьБезНДСРегл КАК ЧИСЛО(31,2))) КАК СтоимостьБезНДСРегл,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * 
	|		ВЫБОР КОГДА Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
	|			ТОГДА 0 
	|		ИНАЧЕ Т.НДСРегл КОНЕЦ КАК ЧИСЛО(31,2))) КАК НДСРегл,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * Т.СтоимостьБезНДСУпр КАК ЧИСЛО(31,2))) КАК СтоимостьБезНДСУпр,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * 
	|		ВЫБОР КОГДА Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
	|			ТОГДА 0
	|		ИНАЧЕ Т.НДСУпр КОНЕЦ КАК ЧИСЛО(31,2))) КАК НДСУпр
	|ПОМЕСТИТЬ ВТДопРасходыНДС2_4
	|ИЗ
	|	ВТДопРасходыДляПостатейныхЗатрат КАК Т
	//++ Локализация
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
	|		ПО Т.КорСтатьяРасходов = Статьи.Ссылка
	//-- Локализация
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Отбор
	|		ПО Т.АналитикаУчетаНоменклатуры = Отбор.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыДопРасходов КАК Коэффициенты
	|		ПО Т.Организация = Коэффициенты.Организация
	|		И Т.РазделУчета = Коэффициенты.РазделУчета
	|		И Т.АналитикаУчетаНоменклатуры = Коэффициенты.АналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Коэффициенты.ВидЗапасов
	|		И Т.Партия = Коэффициенты.Партия
	|		И Т.АналитикаУчетаПартий = Коэффициенты.АналитикаУчетаПартий
	|		И Т.ВидДеятельностиНДС = Коэффициенты.ВидДеятельностиНДС
	|		И Т.АналитикаФинансовогоУчета = Коэффициенты.АналитикаФинансовогоУчета
	|		И Т.Регистратор = Коэффициенты.Регистратор
	|ГДЕ
	|	Т.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией))
	//++ Локализация
	|	И НЕ (Отбор.Ссылка ЕСТЬ NULL
	|		И Статьи.Ссылка ЕСТЬ НЕ NULL
	|		И Т.Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат))
	//-- Локализация
	|	И Т.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходов,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПеременные,
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПостоянные,
	// Аналитики партий НДС
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаПартийДокументаПоступления,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|	ИСТИНА КАК ЭтоДопРасходы,
	|	ЛОЖЬ КАК ЭтоПеременныеДопРасходы,
	|	
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Прочие поля
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|
	// Ресурсы
	|	ВЫБОР КОГДА ДД.СтоимостьСНДС < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьСНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДС < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСРегл < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДСРегл,
	|	ВЫБОР КОГДА ДД.НДСРегл < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакНДСРегл,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСУпр < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДСУпр,
	|	ВЫБОР КОГДА ДД.НДСУпр < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакНДСУпр,
	|
	|	ВЫБОР КОГДА ДД.СтоимостьСНДС < 0 ТОГДА -ДД.СтоимостьСНДС ИНАЧЕ ДД.СтоимостьСНДС КОНЕЦ КАК СтоимостьСНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДС < 0 ТОГДА -ДД.СтоимостьБезНДС ИНАЧЕ ДД.СтоимостьБезНДС КОНЕЦ КАК СтоимостьБезНДС,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСРегл < 0 ТОГДА -ДД.СтоимостьБезНДСРегл ИНАЧЕ ДД.СтоимостьБезНДСРегл КОНЕЦ КАК СтоимостьБезНДСРегл,
	|	ВЫБОР КОГДА ДД.НДСРегл < 0 ТОГДА -ДД.НДСРегл ИНАЧЕ ДД.НДСРегл КОНЕЦ КАК НДСРегл,
	|	ВЫБОР КОГДА ДД.СтоимостьБезНДСУпр < 0 ТОГДА -ДД.СтоимостьБезНДСУпр ИНАЧЕ ДД.СтоимостьБезНДСУпр КОНЕЦ КАК СтоимостьБезНДСУпр,
	|	ВЫБОР КОГДА ДД.НДСУпр < 0 ТОГДА -ДД.НДСУпр ИНАЧЕ ДД.НДСУпр КОНЕЦ КАК НДСУпр
	|ПОМЕСТИТЬ ПриходыДопРасходовНДС2_4_ДляРешенияСЛУ
	|ИЗ
	|(ВЫБРАТЬ
	// Аналитики партий НДС
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.ДокументПоступления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.АналитикаУчетаПартийДокументаПоступления
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	
	// Аналитики себестоимости
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	// Ресурсы
	|	СУММА(ДД.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(ДД.НДСРегл) КАК НДСРегл,
	|	СУММА(ДД.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(ДД.НДСУпр) КАК НДСУпр
	|ИЗ
	|	ВТДопРасходыНДС2_4 КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.ДокументПоступления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
	|		ТОГДА ДД.АналитикаУчетаПартийДокументаПоступления
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета
	|) КАК ДД
	|ГДЕ
	|	ДД.СтоимостьСНДС <> 0
	|	ИЛИ ДД.СтоимостьБезНДС <> 0
	|	ИЛИ ДД.СтоимостьБезНДСРегл <> 0
	|	ИЛИ ДД.НДСРегл <> 0
	|	ИЛИ ДД.СтоимостьБезНДСУпр <> 0
	|	ИЛИ ДД.НДСУпр <> 0
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти
	
	РаспределитьНДСПоСебестоимости(ПараметрыРасчета, "ПриходыДопРасходовНДС2_4_ДляРешенияСЛУ");
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
		ПараметрыРасчета,
		СуществующиеВТ);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
	СформироватьСтоимостьПартийНДСНаКонецПериода(ПараметрыРасчета); // с учетом данных этого и предыдущего этапов
	
КонецПроцедуры

//++ Локализация

// Этап "РаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов");
	
	#Область ДанныеДляРаспределения
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаРаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета),
		,
		"ВТДанныеПостатейныеЗатраты",
		"СтатьяРасходовАктивов, АналитикаРасходов, Подразделение, Организация, НаправлениеДеятельности",
		"ВТСебестоимостьСписаниеТоваров");
		
	ПолучитьДанныеДляРаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерУзла,
	|	Т.К,
	|	Т.ТипЗаписи,
	|	Т.Знаменатель,
	|	Т.ЗнаменательУпр,
	|	Т.ЗнаменательДляИсточников,
	|	Т.ЗнаменательДляИсточниковУпр,
	|	Т.Период,
	|	Т.Регистратор,
	|	Т.ВидДвижения,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	ВЫБОР КОГДА ЕСТЬNULL(Реестр.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) МЕЖДУ &НачалоПериода и &КонецПериода ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ДокументПоступленияВТекущемПериоде,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.НаправлениеДеятельности,
	|	Т.ХозяйственнаяОперация,
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорНаправлениеДеятельности,
	|	Т.Подразделение,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходов,
	|	Т.КорПодразделение,
	|	Т.СтатьяСписанияНДС,
	|	Т.АналитикаСписанияНДС,
	|	Т.РазделУчета,
	|	Т.АналитикаФинансовогоУчета,
	|
	|	Т.СтоимостьСНДС,
	|	Т.СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл,
	|	Т.НДСРегл,
	|	Т.НДСУпр
	|ПОМЕСТИТЬ ВТДанныеПостатейныеЗатратыПоУзлу
	|ИЗ
	|	ВТДанныеПостатейныеЗатраты КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = Т.ДокументПоступления
	|		И Реестр.Организация = Т.Организация
	|		И НЕ Реестр.ДополнительнаяЗапись
	|		И Реестр.Ссылка <> НЕОПРЕДЕЛЕНО
	|		И Т.ДокументПоступления <> НЕОПРЕДЕЛЕНО
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация,
	|	ВЫБОР КОГДА Т.ВариантУчетаНДСПриИзмененииВидаДеятельности = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимостьИлиРасходыВЗависимостиОтПериода)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗависитОтПериод,
	|	Т.СтатьяРасходовНеНДС,
	|	Т.АналитикаРасходовНеНДС,
	|	Т.СтатьяРасходовЕНВД,
	|	Т.АналитикаРасходовЕНВД
	|ПОМЕСТИТЬ ВТНастройкиСписанияНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&НачалоПериода, Организация В(&МассивОрганизаций)) КАК Т
	|ГДЕ
	|	НЕ Т.ВариантУчетаНДСПриИзмененииВидаДеятельности ЕСТЬ NULL
	|	И Т.ВариантУчетаНДСПриИзмененииВидаДеятельности <> ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимость)
	|	И Т.СтатьяРасходовСписаниеНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Источники.К КАК Источник,
	|	Приемники.К КАК Приемник
	|ПОМЕСТИТЬ ВТСвязи1
	|ИЗ
	|	ВТДанныеПостатейныеЗатраты КАК Источники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеПостатейныеЗатраты КАК Приемники
	|		ПО Источники.СтатьяРасходовАктивов = Приемники.СтатьяРасходовАктивов
	|		И Источники.АналитикаРасходов = Приемники.АналитикаРасходов
	|		И Источники.Подразделение = Приемники.Подразделение
	|		И Источники.Организация = Приемники.Организация
	|		И Источники.НаправлениеДеятельности = Приемники.НаправлениеДеятельности
	|ГДЕ
	|	Источники.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыРегл)
	|	И Приемники.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.БазаРегл)
	|ИНДЕКСИРОВАТЬ ПО
	|	Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.К,
	|	Т.ТипЗаписи,
	|	Т.Организация,
	|	Т.ВидДеятельностиНДС,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.СтатьяРасходовАктивов
	|ПОМЕСТИТЬ ВТИсточникиПриемники
	|ИЗ
	|	ВТДанныеПостатейныеЗатраты КАК Т
	|ГДЕ
	|	Т.ТипЗаписи В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.БазаРегл),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускПостатейные))
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.СтатьяРасходовАктивов,
	|	Т.Партия,
	|	Т.Организация,
	|	Т.НаправлениеДеятельности,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Источники.К КАК Источник,
	|	Приемники.К КАК Приемник
	|ПОМЕСТИТЬ ВТСвязи2
	|ИЗ
	|	ВТИсточникиПриемники КАК Источники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсточникиПриемники КАК Приемники
	|		ПО Источники.СтатьяРасходовАктивов = Приемники.СтатьяРасходовАктивов
	|		И Источники.Партия = Приемники.Партия
	|		И Источники.Организация = Приемники.Организация
	|		И Источники.НаправлениеДеятельности = Приемники.НаправлениеДеятельности
	|		И Источники.АналитикаУчетаПартий = Приемники.АналитикаУчетаПартий
	|		И Источники.ВидДеятельностиНДС = Приемники.ВидДеятельностиНДС
	|ГДЕ
	|	Источники.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.БазаРегл)
	|	И Приемники.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускПостатейные)
	|ИНДЕКСИРОВАТЬ ПО
	|	Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТИсточникиПриемники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.К,
	|	Т.ТипЗаписи,
	|	Т.Организация,
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорНаправлениеДеятельности,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.Регистратор
	|ПОМЕСТИТЬ ВТИсточники
	|ИЗ
	|	ВТДанныеПостатейныеЗатраты КАК Т
	|ГДЕ
	|	Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускПостатейные)
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.КорПартия,
	|	Т.КорАналитикаУчетаПартий,
	|	Т.КорНаправлениеДеятельности,
	|	Т.Организация,
	|	Т.КорВидДеятельностиНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.К,
	|	Т.ТипЗаписи,
	|	Т.Организация,
	|	Т.ВидДеятельностиНДС,
	|	Т.НаправлениеДеятельности,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Регистратор
	|ПОМЕСТИТЬ ВТПриемники
	|ИЗ
	|	ВТДанныеПостатейныеЗатраты КАК Т
	|ГДЕ
	|	Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.НаправлениеДеятельности,
	|	Т.Организация,
	|	Т.ВидДеятельностиНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Источники.К КАК Источник,
	|	Приемники.К КАК Приемник
	|ПОМЕСТИТЬ ВТСвязи3
	|ИЗ
	|	ВТИсточники КАК Источники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриемники КАК Приемники
	|		ПО Источники.Регистратор = Приемники.Регистратор
	|		И Источники.КорПартия = Приемники.Партия
	|		И Источники.КорАналитикаУчетаПартий = Приемники.АналитикаУчетаПартий
	|		И Источники.КорНаправлениеДеятельности = Приемники.НаправлениеДеятельности
	|		И Источники.Организация = Приемники.Организация
	|		И Источники.КорВидДеятельностиНДС = Приемники.ВидДеятельностиНДС
	|ИНДЕКСИРОВАТЬ ПО
	|	Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТИсточники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПриемники
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти
	
	СформироватьПромежуточныйРезультатРаспределенияПартийНДС(ПараметрыРасчета, Запрос, 1);
	СформироватьПромежуточныйРезультатРаспределенияПартийНДС(ПараметрыРасчета, Запрос, 2);
	СформироватьПромежуточныйРезультатРаспределенияПартийНДС(ПараметрыРасчета, Запрос, 3); // формируется ВТСписаниеПостатейныхЗатрат 
	
	#Область ПодготовкаДанныхРаспределенияНДС
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(Т.Период), МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ПериодПредыдущегоРассчитанногоПериода
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период < &НачалоПериода
	|	И Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|	СУММА(Т.КоличествоОстаток) КАК Количество,
	|	СУММА(Т.СтоимостьОстаток) КАК СтоимостьСНДС,
	|	СУММА(Т.СтоимостьБезНДСОстаток) КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьРеглОстаток) КАК СтоимостьРегл,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА Т.СтоимостьУпрОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьУпр
	|ПОМЕСТИТЬ ВТОстаткиДляКорректировок
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&НачалоПериода, Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета
	|ИМЕЮЩИЕ
	|	СУММА(Т.КоличествоОстаток) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|
	|	Т.АналитикаФинансовогоУчета,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.Количество КАК Количество,
	|	Т.Стоимость - ВЫРАЗИТЬ(Т.Количество * Остатки.СтоимостьСНДС / Остатки.Количество КАК ЧИСЛО(31,2)) КАК СтоимостьСНДС,
	|	Т.СтоимостьБезНДС - ВЫРАЗИТЬ(Т.Количество * Остатки.СтоимостьБезНДС / Остатки.Количество КАК ЧИСЛО(31,2)) КАК СтоимостьБезНДС,
	|	Т.СтоимостьРегл - ВЫРАЗИТЬ(Т.Количество * Остатки.СтоимостьРегл / Остатки.Количество КАК ЧИСЛО(31,2)) КАК СтоимостьРегл,
	|	ВЫБОР КОГДА Т.СтоимостьРегл <> 0
	|		ТОГДА Т.НДСРегл * (Т.СтоимостьРегл - ВЫРАЗИТЬ(Т.Количество * Остатки.СтоимостьРегл / Остатки.Количество КАК ЧИСЛО(31,2))) / Т.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДСРегл,
	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА Т.СтоимостьУпр - ВЫРАЗИТЬ(Т.Количество * Остатки.СтоимостьУпр / Остатки.Количество КАК ЧИСЛО(31,2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьУпр,
	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций И Т.СтоимостьУпр <> 0
	|		ТОГДА Т.НДСУпр * (Т.СтоимостьУпр - ВЫРАЗИТЬ(Т.Количество * Остатки.СтоимостьУпр / Остатки.Количество КАК ЧИСЛО(31,2))) / Т.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДСУпр
	|ПОМЕСТИТЬ ВТКорректировкиПриобретения
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиДляКорректировок КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.РазделУчета = Остатки.РазделУчета
	|		И Т.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И Т.ВидДеятельностиНДС = Остатки.ВидДеятельностиНДС
	|		И Т.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
	|ГДЕ
	|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Т.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|	И Т.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоПостатейныеПеременные,
	|	ИСТИНА КАК ЭтоПостатейныеПостоянные,
	|	&НачалоПериода КАК Период,
	|	Остатки.Организация,
	|	Остатки.АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов,
	|	Остатки.РазделУчета,
	|	Остатки.Партия,
	|	Остатки.АналитикаУчетаПартий,
	|	Остатки.АналитикаФинансовогоУчета,
	|	Остатки.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.ЗатратыПредыдущихПеределов,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьСНДС) КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДС) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСРегл) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСРегл) КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСУпр) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСУпр) КАК ЧИСЛО(31,10)) КАК НДСУпр,
	|	СУММА(Остатки.Количество) КАК КоличествоПартии
	|ПОМЕСТИТЬ ВТЦеныПартийТоваровНаНачалоПериода
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиСебестоимостиДляПартийНДС КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Номенклатура = ВЫРАЗИТЬ(Остатки.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура
	|		И Т.Характеристика = ВЫРАЗИТЬ(Остатки.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика
	|		И (Остатки.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			ИЛИ Остатки.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатурыНЗП)
	|ГДЕ
	|	Т.ПериодРегистрации < &НачалоПериода
	|	И Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Организация,
	|	Остатки.АналитикаУчетаНоменклатуры,
	|	Остатки.ВидЗапасов,
	|	Остатки.РазделУчета,
	|	Остатки.Партия,
	|	Остатки.АналитикаУчетаПартий,
	|	Остатки.АналитикаФинансовогоУчета,
	|	Остатки.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ЗатратыПредыдущихПеределов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоПостатейныеПеременные,
	|	ИСТИНА КАК ЭтоПостатейныеПостоянные,
	|	Т.ПериодРегистрации,
	|	Возвраты.Организация,
	|	Возвраты.АналитикаУчетаНоменклатуры,
	|	Возвраты.ВидЗапасов,
	|	Возвраты.РазделУчета,
	|	Возвраты.Партия,
	|	Возвраты.АналитикаУчетаПартий,
	|	Возвраты.АналитикаФинансовогоУчета,
	|	Возвраты.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.ЗатратыПредыдущихПеределов,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьСНДС) КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДС) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСРегл) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСРегл) КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСУпр) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСУпр) КАК ЧИСЛО(31,10)) КАК НДСУпр,
	|	СУММА(Возвраты.Количество) КАК КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВозвратыПрошлыхПериодов КАК Возвраты
	|		ПО Т.Организация = Возвраты.Организация
	|		И Т.Партия = Возвраты.Партия
	|		И Т.АналитикаУчетаПартий = Возвраты.АналитикаУчетаПартий
	|		И Т.ВидЗапасов = Возвраты.ВидЗапасов
	|		И Т.Номенклатура = ВЫРАЗИТЬ(Возвраты.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура
	|		И Т.Характеристика = ВЫРАЗИТЬ(Возвраты.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика
	|ГДЕ
	|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|СГРУППИРОВАТЬ ПО
	|	Т.ПериодРегистрации,
	|	Возвраты.Организация,
	|	Возвраты.АналитикаУчетаНоменклатуры,
	|	Возвраты.ВидЗапасов,
	|	Возвраты.РазделУчета,
	|	Возвраты.Партия,
	|	Возвраты.АналитикаУчетаПартий,
	|	Возвраты.АналитикаФинансовогоУчета,
	|	Возвраты.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ЗатратыПредыдущихПеределов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоПостатейныеПеременные,
	|	ЛОЖЬ КАК ЭтоПостатейныеПостоянные,
	|	Т.Период,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьСНДС) КАК ЧИСЛО(31,10)) 		КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДС) КАК ЧИСЛО(31,10)) 	КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСРегл) КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСРегл) КАК ЧИСЛО(31,10)) 			КАК НДСРегл,
	|	ВЫРАЗИТЬ(СУММА(Т.СтоимостьБезНДСУпр) КАК ЧИСЛО(31,10)) 	КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(СУММА(Т.НДСУпр) КАК ЧИСЛО(31,10)) 				КАК НДСУпр,
	|	СУММА(Т.КоличествоПартии) 								КАК КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодПредыдущегоРассчитанногоПериода КАК ПериодДвижений
	|		ПО Т.Период = ПериодДвижений.Период
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиСебестоимостиДляПартийНДС КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.РазделУчета = Остатки.РазделУчета
	|		И Т.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И Т.ВидДеятельностиНДС = Остатки.ВидДеятельностиНДС
	|		И Т.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
	|ГДЕ
	|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.Партия <> Т.ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПеременные,
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПостоянные,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходовАктивов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|
	|	Т.СтоимостьСНДС КАК СтоимостьСНДС,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл КАК СтоимостьБезНДСРегл,
	|	Т.НДСРегл КАК НДСРегл,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр
	|ПОМЕСТИТЬ ПриходыПостатейныхНДС2_4Предварительная
	|ИЗ
	|	ВТСписаниеПостатейныхЗатрат КАК Т
	|ГДЕ
	|	Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
	|	ИЛИ (Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией)
	|		И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Остатки себестоимости по ценам нового регистра
	|ВЫБРАТЬ
	|	Цены.ЭтоПостатейныеПеременные КАК ЭтоОстаткиПостатейныеПеременные,
	|	Цены.ЭтоПостатейныеПостоянные КАК ЭтоОстаткиПостатейныеПостоянные,
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	|	Цены.ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления,
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Цены.СтатьяРасходов,
	|	Цены.АналитикаРасходов,
	|	Цены.ЗатратыПредыдущихПеределов,
	|	
	|	ВЫРАЗИТЬ(Цены.СтоимостьСНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСУпр
	|ИЗ
	|	ВТОстаткиСебестоимостиДляПартийНДС КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПартийТоваровНаНачалоПериода КАК Цены
	|		ПО Цены.Организация = ДД.Организация
	|		И Цены.РазделУчета = ДД.РазделУчета
	|		И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И Цены.ВидЗапасов = ДД.ВидЗапасов
	|		И Цены.Партия = ДД.Партия
	|		И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
	|		И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
	|		И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
	|ГДЕ
	|	Цены.КоличествоПартии > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Возвраты реализаций прошлых периодов по ценам нового регистра
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПеременные,
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПостоянные,
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	|	Цены.ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления,
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Цены.СтатьяРасходов,
	|	Цены.АналитикаРасходов,
	|	Цены.ЗатратыПредыдущихПеределов,
	|
	|	ВЫРАЗИТЬ(Цены.СтоимостьСНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДС * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСРегл,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * ДД.Количество КАК ЧИСЛО(31,10)) КАК НДСУпр
	|ИЗ
	|	ВТВозвратыПрошлыхПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПартийТоваровНаНачалоПериода КАК Цены
	|		ПО Цены.Период = ДД.ПериодПродажи
	|		И Цены.Организация = ДД.Организация
	|		И Цены.РазделУчета = ДД.РазделУчета
	|		И Цены.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
	|		И Цены.ВидЗапасов = ДД.КорВидЗапасов
	|		И Цены.Партия = ДД.КорПартия
	|		И Цены.АналитикаУчетаПартий = ДД.КорАналитикаУчетаПартий
	|		И Цены.АналитикаФинансовогоУчета = ДД.КорАналитикаФинансовогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Корректировки приобретения
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоОстаткиПостатейныеПеременные,
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПостоянные,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|
	|	Т.Регистратор КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|
	|	СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьРегл
	|		+ ВЫБОР
	|			КОГДА Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -Т.НДСРегл
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьБезНДСРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьУпр
	|		+ ВЫБОР
	|			КОГДА Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА -Т.НДСУпр
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьБезНДСУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ИЗ
	|	ВТКорректировкиПриобретения КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.Регистратор
	|ИМЕЮЩИЕ
	|	СУММА(Т.СтоимостьСНДС) <> 0
	|	ИЛИ СУММА(Т.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(Т.СтоимостьРегл) <> 0
	|	ИЛИ СУММА(Т.НДСРегл) <> 0
	|	ИЛИ СУММА(Т.СтоимостьУпр) <> 0
	|	ИЛИ СУММА(Т.НДСУпр) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Ввод остатков товаров
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПеременные,
	|	ЛОЖЬ КАК ЭтоОстаткиПостатейныеПостоянные,
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	ЛОЖЬ КАК ЗатратыПредыдущихПеределов,
	|
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА ВЫБОР
	|				КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА ДД.СтоимостьБезНДСУпр
	|				ИНАЧЕ ДД.СтоимостьБезНДСУпр + ДД.НДСУпр
	|			  КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) 					КАК СтоимостьСНДС,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА ДД.СтоимостьБезНДСУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ) 					КАК СтоимостьБезНДС,
	|	СУММА(ДД.СтоимостьБезНДС)  	КАК СтоимостьБезНДСРегл,
	|	СУММА(ДД.НДС)  				КАК НДСРегл,
	|	СУММА(ДД.СтоимостьБезНДСУпр)  	КАК СтоимостьБезНДСУпр,
	|	СУММА(ДД.НДСУпр)  				КАК НДСУпр
	|ИЗ
	|	ВТДвиженияВводаОстатков КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|		ПО ДД.СтатьяРасходовАктивов = Статьи.Ссылка
	|ГДЕ
	|	(ДД.СтоимостьБезНДС <> 0
	|		ИЛИ ДД.НДС <> 0
	|		ИЛИ ДД.СтоимостьБезНДСУпр <> 0
	|		ИЛИ ДД.НДСУпр <> 0)
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаДокументаПоступления,
	|	ДД.СтатьяРасходовАктивов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ЗатратыПредыдущихПеределов,
	|	ВЫБОР КОГДА Т.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДопРасходы,
	|	ЛОЖЬ КАК ЭтоПеременныеДопРасходы,
	|
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьСНДС) < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьСНДС,
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьБезНДС) < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДС,
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьБезНДСРегл) < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДСРегл,
	|	ВЫБОР КОГДА СУММА(Т.НДСРегл) < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакНДСРегл,
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьБезНДСУпр) < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакСтоимостьБезНДСУпр,
	|	ВЫБОР КОГДА СУММА(Т.НДСУпр) < 0 ТОГДА -1 ИНАЧЕ 1 КОНЕЦ КАК ЗнакНДСУпр,
	|
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьСНДС) < 0 ТОГДА -СУММА(Т.СтоимостьСНДС) ИНАЧЕ СУММА(Т.СтоимостьСНДС) КОНЕЦ КАК СтоимостьСНДС,
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьБезНДС) < 0 ТОГДА -СУММА(Т.СтоимостьБезНДС) ИНАЧЕ СУММА(Т.СтоимостьБезНДС) КОНЕЦ КАК СтоимостьБезНДС,
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьБезНДСРегл) < 0 ТОГДА -СУММА(Т.СтоимостьБезНДСРегл) ИНАЧЕ СУММА(Т.СтоимостьБезНДСРегл) КОНЕЦ КАК СтоимостьБезНДСРегл,
	|	ВЫБОР КОГДА СУММА(Т.НДСРегл) < 0 ТОГДА -СУММА(Т.НДСРегл) ИНАЧЕ СУММА(Т.НДСРегл) КОНЕЦ КАК НДСРегл,
	|	ВЫБОР КОГДА СУММА(Т.СтоимостьБезНДСУпр) < 0 ТОГДА -СУММА(Т.СтоимостьБезНДСУпр) ИНАЧЕ СУММА(Т.СтоимостьБезНДСУпр) КОНЕЦ КАК СтоимостьБезНДСУпр,
	|	ВЫБОР КОГДА СУММА(Т.НДСУпр) < 0 ТОГДА -СУММА(Т.НДСУпр) ИНАЧЕ СУММА(Т.НДСУпр) КОНЕЦ КАК НДСУпр
	|ПОМЕСТИТЬ ПриходыПостатейныхНДС2_4
	|ИЗ
	|	ПриходыПостатейныхНДС2_4Предварительная КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ЗатратыПредыдущихПеределов,
	|	ВЫБОР КОГДА Т.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ //ЭтоДопРасходы
	|ИМЕЮЩИЕ
	|	СУММА(Т.СтоимостьСНДС) <> 0
	|	ИЛИ СУММА(Т.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(Т.СтоимостьБезНДСРегл) <> 0
	|	ИЛИ СУММА(Т.НДСРегл) <> 0
	|	ИЛИ СУММА(Т.СтоимостьБезНДСУпр) <> 0
	|	ИЛИ СУММА(Т.НДСУпр) <> 0
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ПриходыПостатейныхНДС2_4") > 0 Тогда
		
		РаспределитьНДСПоСебестоимости(ПараметрыРасчета, "ПриходыПостатейныхНДС2_4");
		
	КонецЕсли;
	
	#Область ПодготовкаДанныхНЗП
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&НачалоПериода КАК Период,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|		ТОГДА Т.СтатьяРасходовАктивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Подразделение) = ТИП(Справочник.СтруктураПредприятия)
	|		ТОГДА Т.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|
	|	Т.Регистратор КАК ДокументДвижения,
	|	ВЫБОР КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПриходЗатрат,
	|	Т.КорВидДеятельностиНДС,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.КорАналитикаУчетаНоменклатуры) = ТИП(Справочник.КлючиАналитикиУчетаНоменклатуры)
	|		ТОГДА Т.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КорАналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.КорВидЗапасов) = ТИП(Справочник.ВидыЗапасов)
	|		ТОГДА Т.КорВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ КАК КорВидЗапасов,
	|	ВЫБОР КОГДА Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
	|		ТОГДА Т.НаправлениеДеятельности
	|		ИНАЧЕ Т.КорНаправлениеДеятельности
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.КорПодразделение) = ТИП(Справочник.СтруктураПредприятия)
	|		ТОГДА Т.КорПодразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК КорПодразделение,
	|	ЛОЖЬ
	|		КАК ЭтоПартияПроизводства,
	|
	|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДС,
	|	СУММА(Т.НДСРегл) КАК НДС,
	|	СУММА(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ДвиженияПартийПрочихРасходовНДС2_4
	|ИЗ
	|	ВТСписаниеПостатейныхЗатрат КАК Т
	|ГДЕ
	|	Т.ТипЗаписи В 
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускПостатейные))
	|	И ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументаДвиженияНЗП)
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|		ТОГДА Т.СтатьяРасходовАктивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	КОНЕЦ,
	|	Т.АналитикаРасходов,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Подразделение) = ТИП(Справочник.СтруктураПредприятия)
	|		ТОГДА Т.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.КорПодразделение) = ТИП(Справочник.СтруктураПредприятия)
	|		ТОГДА Т.КорПодразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	Т.Регистратор,
	|	ВЫБОР КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Т.КорВидДеятельностиНДС,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.КорАналитикаУчетаНоменклатуры) = ТИП(Справочник.КлючиАналитикиУчетаНоменклатуры)
	|		ТОГДА Т.КорАналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.КорВидЗапасов) = ТИП(Справочник.ВидыЗапасов)
	|		ТОГДА Т.КорВидЗапасов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
	|		ТОГДА Т.НаправлениеДеятельности
	|		ИНАЧЕ Т.КорНаправлениеДеятельности
	|	КОНЕЦ
	|ИМЕЮЩИЕ
	|	СУММА(Т.СтоимостьБезНДСРегл) <> 0
	|	ИЛИ СУММА(Т.НДСРегл) <> 0
	|	ИЛИ СУММА(Т.СтоимостьБезНДСУпр) <> 0
	|	ИЛИ СУММА(Т.НДСУпр) <> 0
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти
	
	#Область СохранениеДвижений_ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	ИмяРегистра = Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП.Имя;
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	ИмяВременнойТаблицы = "ВТДетализацияСебестоимостиТоваров";
	
	КопируемыеПоля = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыгрузитьВременнуюТаблицу(ПараметрыРасчета, "ДвиженияПартийПрочихРасходовНДС2_4", 0));
	
	КопируемыеПоля = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КопируемыеПоля, "");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	УсловиеГДЕ = "ЭтоПартияПроизводства";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(
		ПараметрыРасчета,
		ТаблицаОписанияПолей,
		ИмяРегистра,
		"ДвиженияПартийПрочихРасходовНДС2_4",
		ИмяВременнойТаблицы,
		УсловиеГДЕ);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, Истина);
	
	#КонецОбласти
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ПриходыПостатейныхНДС2_4") > 0
	 ИЛИ РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ДвиженияПартийПрочихРасходовНДС2_4") > 0 Тогда
		
		СформироватьСтоимостьПартийНДСНаКонецПериода(ПараметрыРасчета);
		
	КонецЕсли;
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
		ПараметрыРасчета,
		СуществующиеВТ + ", ВТСписаниеПостатейныхЗатрат");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

// Этап "ПодготовкаДанныхДляВключенияИсключенияНДСДопРасходовВСтоимость24"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляВключенияИсключенияНДСДопРасходовВСтоимость24(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляВключенияИсключенияНДСДопРасходовВСтоимость24");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляВключенияИсключенияНДСДопРасходов(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру СебестоимостьТоваров.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры

//-- Локализация

// Этап "ПодготовкаДанныхДляПартийПрочихРасходов"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляПартийПрочихРасходов(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляПартийПрочихРасходов");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ПартииПрочихРасходов.Имя);
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляПартийПрочихРасходов(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ПартииПрочихРасходов.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры

//++ Локализация

// Этап "ПодготовкаДанныхДляПрочихРасходов"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляПрочихРасходов(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляПрочихРасходов");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя);
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляПрочихРасходов(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ПрочиеРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры


// Этап "ПодготовкаДанныхДляПартийНДСКРаспределению"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляПартийНДСКРаспределению(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляПартийНДСКРаспределению");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ПартииНДСКРаспределению.Имя);
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляПартийНДСКРаспределению(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ПартииНДСКРаспределению.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры

// Этап формирования документов РаспределениеНДС
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеНДСПоВидамНалогообложения(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеНДСПоВидамНалогообложения");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	// Сохраним движения документа РаспределениеНДС по регистру ПрочиеРасходы до расчета.
	// Эти движения не имеют признаков "расчетные", т.к. формируются самим документом, а не механикой расчета себестоимости.
	// При окончании расчета механизм расчета не имеет возможности определить наличие изменений в таких движения.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТДвиженияРаспределенияНДСПоПрочиеРасходыДоРасчета
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.Активность";
	
	Запрос.Выполнить();
	
	// Вызовем "внешнюю" логику перепроведения документов РаспределениеНДС.
	// При этом будут переформированы "первичные" движения этих документов.
	РезультатРаспределенияНДС = Документы.РаспределениеНДС.РаспределитьНДС(
		ПараметрыРасчета.РасчетныйПериод.НачалоПериода,
		ПараметрыРасчета.МассивОрганизаций,
		РасчетСебестоимостиПрикладныеАлгоритмы.ИмяСобытияОшибкиДляЖурналаРегистрации(ПараметрыРасчета),
		ПараметрыРасчета.МенеджерВременныхТаблиц,
		Истина);
	
	РасчетСебестоимостиПротоколРасчета.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
		ПараметрыРасчета,
		ПараметрыРасчета.МассивОрганизаций.Количество());
	
	// Сохраним движения документа РаспределениеНДС по регистру ПрочиеРасходы после расчета.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТДвиженияРаспределенияНДСПоПрочиеРасходыПослеРасчета
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.Активность";
	
	Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(РезультатРаспределенияНДС.ТекстОшибки) Тогда
		
		ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Операция ""Распределение НДС"" не была выполнена по причине:
				|%1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			РезультатРаспределенияНДС.ТекстОшибки);
			
		// В механизме закрытия месяца ошибка зарегистрирована из механизма распределения НДС.
		РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаРаспределенияНДС,
			ТекстДляПротокола);
		
	КонецЕсли;
		
	// Если документ РаспределениеНДС может делать движения по регистру,
	// обслуживаемому механизмом партионного учета и себестоимости,
	// то по этому регистру надо обновить расчетные кэши остатков и оборотов.
	// Иначе получится ситуация, что данные ИБ при проведении этих документов изменились,
	// а следующие этапы расчета "не увидят" этого во временных таблицах кэшей регистров.
	Если РезультатРаспределенияНДС.МассивДокументов.Количество() > 0 Тогда
		
		ВозможныеДвиженияДокументов = Метаданные.Документы.РаспределениеНДС.Движения;
		
		Для Каждого КлючИЗначение Из ПараметрыРасчета.Движения Цикл
			
			ОписаниеРегистра = КлючИЗначение.Значение;
			
			Если ВозможныеДвиженияДокументов.Содержит(ОписаниеРегистра.МетаданныеРегистра) Тогда
				ОписаниеРегистра.НадоОбновитьРасчетныйКэш = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета, Истина);
	
	РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(
		ПараметрыРасчета,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Обработано документов ""Распределение НДС"": %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(
				РезультатРаспределенияНДС.МассивДокументов.Количество())));
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

//++ Локализация

#Область Инициализация

// Инициализирует общие параметры расчета, описывающие обслуживаемые механизмом расчета регистры.
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ИнициализироватьОбслуживаемыеРегистры(ПараметрыРасчета) Экспорт
	
	ПараметрыРасчета.РегистрыСРасчетнымиОборотами.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН.Имя, Истина);
	
КонецПроцедуры

// Дополняет перечень документов, которые могут иметь движения в разных месяцах или по нескольким организациям.
//
// Параметры:
//	РазныеПериоды - Булево - добавлять в результат документы с движениями в разных периодах
//	РазныеОрганизации - Булево - добавлять в результат документы с движениями по нескольким организациям
//	ИмяРегистра - Строка - имя регистра накопления, для которого нужно получить перечень документов;
//		пустое значение - перечень документов для всех регистров.
//	ОписаниеДокументов - Соответствие - Ключ - ОбъектМетаданных.
//
Процедура ДополнитьДокументыСРазнымиПериодамиИлиОрганизациямиВДвижениях(РазныеПериоды, РазныеОрганизации, ИмяРегистра, ОписаниеДокументов) Экспорт
	
	// Для движений в других периодах Значение = Истина означает
	// - наличие первичных+расчетных движений,
	// - расчетные движения формируются при расчете их периода.
	// Если указано значение Ложь, то это означает, что
	// - расчетные движения могут быть без первичных движений,
	// - расчетные движения любых периодов формируются при расчете периода документа.
	// Для движений других организаций Значение должно быть только Истина.
	
	Значение = Истина;
	
	Если ИмяРегистра = ""
	 ИЛИ ИмяРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя Тогда
		Если РазныеПериоды Тогда
			ОписаниеДокументов.Вставить(Метаданные.Документы.СчетФактураНалоговыйАгент,  Значение); // движения могут быть любым периодом
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяРегистра = ""
	 ИЛИ ИмяРегистра = Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН.Имя Тогда
		
		Если РазныеПериоды Тогда
			ОписаниеДокументов.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, 	 Значение); // операция РеализацияБезПереходаПраваСобственности
			ОписаниеДокументов.Вставить(Метаданные.Документы.СчетФактураНалоговыйАгент,	 Значение); // движения могут быть любым периодом
		КонецЕсли;
		
	КонецЕсли;

	Если ИмяРегистра = ""
	 ИЛИ ИмяРегистра = Метаданные.РегистрыНакопления.НДСПредъявленный.Имя Тогда
		
		Если РазныеПериоды Тогда
			ОписаниеДокументов.Вставить(Метаданные.Документы.РасчетСебестоимостиТоваров, Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяРегистра = ""
	 ИЛИ ИмяРегистра = Метаданные.РегистрыНакопления.ПартииНДСКРаспределению.Имя Тогда
		
		Если РазныеПериоды Тогда
			Для Каждого МетаДокумент Из Метаданные.Документы Цикл
				Если МетаДокумент.Движения.Содержит(Метаданные.РегистрыНакопления.ПартииНДСКРаспределению) Тогда
					ОписаниеДокументов.Вставить(МетаДокумент, Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует общие временные таблицы для отбора данных в запросах.
//
Процедура ИнициализироватьВременныеТаблицыДляОтборов(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "ВТОтборАналитикиУчетаПартийНДС2_4");
	
	ИнициализироватьТаблицуДляОтбораАналитикУчетаПартийНДС2_4(ПараметрыРасчета.МенеджерВременныхТаблиц);
	
	РасчетСебестоимостиПротоколРасчета.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета, Истина);
	
КонецПроцедуры

#КонецОбласти

//-- Локализация

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

Процедура ИнициализироватьТаблицуДляОтбораАналитикУчетаПартийНДС2_4(МенеджерВременныхТаблиц) Экспорт
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, "ВТОтборАналитикиУчетаПартийНДС2_4");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = ТекстЗапросаТаблицыДляОтбораАналитикУчетаПартийНДС2_4();
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТекстЗапросаТаблицыДляОтбораАналитикУчетаПартийНДС2_4() Экспорт
	
	Возврат 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА НЕ Т.Контрагент В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВнешнийКонтрагент,
		|	ВЫБОР
		|		КОГДА Т.КодСтроки <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗаполненКодСтроки
		|ПОМЕСТИТЬ ВТОтборАналитикиУчетаПартийНДС2_4
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаПартий КАК Т
		|ГДЕ
		|	НЕ Т.Контрагент В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
		|	ИЛИ Т.КодСтроки <> 0
		|";
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа_РасчетПартийНДС

//++ Локализация

// Инициализация данных

Функция ПоляПотребленийПартииНДС(ПараметрыРасчета)
	
	Возврат "АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС";
	
КонецФункции

Функция ОписаниеЦепочекПартийНДС(ПараметрыРасчета) Экспорт
	
	ОписаниеЦепочек = Новый Соответствие;
	ПоляПотреблений	= ПоляПотребленийПартииНДС(ПараметрыРасчета);
	
	// ОстатокСгруппированный <- Остаток, ДопРасходы, ДопРасходыСПартией, КорректировкаСтоимости, ОтклонениеВСтоимости, ОстатокДляРаспределения 
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный, ПоляПотреблений + ", Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,
		Перечисления.ТипыЗаписейПартий.Остаток, ПоляПотреблений + ", Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,
		Перечисления.ТипыЗаписейПартий.ДопРасходы, ПоляПотреблений + ", Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,
		Перечисления.ТипыЗаписейПартий.ДопРасходыСПартией, ПоляПотреблений + ", Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,
		Перечисления.ТипыЗаписейПартий.КорректировкаСтоимости, ПоляПотреблений + ", Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,
		Перечисления.ТипыЗаписейПартий.ОтклонениеВСтоимости, ПоляПотреблений + ", Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,
		Перечисления.ТипыЗаписейПартий.ОстатокДляРаспределения, ПоляПотреблений + ", Партия");
		
	// ОстатокДляРаспределения <- ДопРасходыБезПартии
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ОстатокДляРаспределения, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОстатокДляРаспределения,
		Перечисления.ТипыЗаписейПартий.ДопРасходыБезПартии, ПоляПотреблений + ", ДокументИсточник");
	
	// ПартияСгруппированная <- Партия, ДопРасходы, ДопРасходыБезПартии, ДопРасходыСПартией, КорректировкаСтоимости, ОтклонениеВСтоимости, Выпуск, Перемещение
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.Партия, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.ДопРасходы, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.ДопРасходыБезПартии, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.ДопРасходыСПартией, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.КорректировкаСтоимости, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.ОтклонениеВСтоимости, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.Выпуск, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.Перемещение, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.ПартииДляРаспределения, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		Перечисления.ТипыЗаписейПартий.ПартииВПути, ПоляПотреблений + ", ДокументИсточник");
	
	// Потребление <- (ОстатокСгруппированный, Партия, ДопРасходы, ДопРасходыБезПартии, ДопРасходыСПартией,
	// КорректировкаПриобретенияПрошлогоПериода, Перемещение, ПеремещениеОбособленно, Сторно, СторноВозврата, СторноПотребления,
	// ВозвратПрошлыхПериодов, ВозвратБезДокументаИсточника).
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.Потребление, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.Перемещение, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.Сторно, 		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.СторноВозврата, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.СторноПотребления, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Потребление,
		Перечисления.ТипыЗаписейПартий.ВозвратБезДокументаИсточника, ПоляПотреблений + ", Регистратор");
		
	// ПотреблениеАвто <- (ОстатокСгруппированный, ПартияСгруппированная, Перемещение, ПеремещениеОбособленно, Сторно, СторноВозврата,
	// СторноПотребления, ДопРасходы).
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ПотреблениеАвто, 		ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,				ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.Перемещение, 		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно, 		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.Сторно, 				ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.СторноВозврата, 		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.СторноПотребления,	ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.ДопРасходы,			ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		Перечисления.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода, ПоляПотреблений + ", Регистратор");	
		
	// СписаниеНаДругиеПартии <- (ОстатокСгруппированный, Партия, ДопРасходы, ДопРасходыБезПартии, ДопРасходыСПартией,
	// КорректировкаПриобретенияПрошлогоПериода, Перемещение, ПеремещениеОбособленно, Сторно, СторноВозврата, СторноПотребления,
	// ВозвратПрошлыхПериодов)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.Перемещение, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.Сторно, 		ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.СторноВозврата, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.СторноПотребления, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода, ПоляПотреблений + ", Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.СторноСписанияНаДругиеПартии, ПоляПотреблений + ", Регистратор");
		
	// СторноСписанияНаДругиеПартии <- (СписаниеНаДругиеПартии)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СторноСписанияНаДругиеПартии, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноСписанияНаДругиеПартии,
		Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии, ПоляПотреблений + ", Регистратор");	
		
	// КорректировкаПриобретения <- (ОстатокСгруппированный, ПартияСгруппированная, ВозвратПрошлыхПериодов)	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.КорректировкаПриобретения, ПоляПотреблений);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.КорректировкаПриобретения,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный, 				 ПоляПотреблений);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.КорректировкаПриобретения,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,			 	 ПоляПотреблений);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.КорректировкаПриобретения,
		Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов,	 ПоляПотреблений);	
		
	// Сторно <- (Потребление, ПотреблениеАвто, Прошлое)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.Сторно, 		"ДокументИсточник, КорАналитикаУчетаНоменклатуры, КорВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Сторно,
		Перечисления.ТипыЗаписейПартий.Потребление, "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Сторно,
		Перечисления.ТипыЗаписейПартий.ПотреблениеАвто, "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Сторно,
		Перечисления.ТипыЗаписейПартий.Прошлое, 	"Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
		
	// СторноПотребления <- (Потребление)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СторноПотребления, "ДокументИсточник, КорАналитикаУчетаНоменклатуры, КорВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноПотребления,
		Перечисления.ТипыЗаписейПартий.Потребление, "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
	
	// СторноВозврата <- (Сторно, СторноВозвратНаДругойСклад)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СторноВозврата,	"ДокументИсточник, АналитикаУчетаНоменклатуры, ВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноВозврата,
		Перечисления.ТипыЗаписейПартий.Сторно, "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноВозврата,
		Перечисления.ТипыЗаписейПартий.СторноВозвратНаДругойСклад, "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
		
	// СторноВозвратНаДругойСклад <- (Потребление, ПотреблениеАвто, Прошлое)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СторноВозвратНаДругойСклад,	"ДокументИсточник, КорАналитикаУчетаНоменклатуры, КорВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноВозвратНаДругойСклад,
		Перечисления.ТипыЗаписейПартий.Потребление,					"Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноВозвратНаДругойСклад,
		Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,				"Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноВозвратНаДругойСклад,
		Перечисления.ТипыЗаписейПартий.Прошлое,						"Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов");
		
	// ВозвратБезДокументаИсточника <- (Потребление)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ВозвратБезДокументаИсточника, ПоляПотреблений);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ВозвратБезДокументаИсточника,
		Перечисления.ТипыЗаписейПартий.Потребление, 				 ПоляПотреблений);
	
	// ВозвратНаДругойСклад <- (СторноВозвратНаДругойСклад, СторноВозврата)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ВозвратНаДругойСклад,
		"Регистратор, АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ВозвратНаДругойСклад,
		Перечисления.ТипыЗаписейПартий.СторноВозвратНаДругойСклад,
		"Регистратор, АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ВозвратНаДругойСклад,
		Перечисления.ТипыЗаписейПартий.СторноВозврата,
		"Регистратор, АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС");
		
	// Распределение <- (Перемещение, ПеремещениеОбособленно, ОстатокСгруппированный, ПартияСгруппированная, ВозвратПрошлыхПериодов, Распределение)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.Распределение,
		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Распределение,
		Перечисления.ТипыЗаписейПартий.Перемещение,
		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Распределение,
		Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно,
		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Распределение,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный,
		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Распределение,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,
		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Распределение,
		Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов,
		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Распределение,
		Перечисления.ТипыЗаписейПартий.Распределение,
		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Регистратор");
 	
	// Перемещение <- (Потребление, ПотреблениеАвто, ПотреблениеПроизводство, ВозвратНаДругойСклад, СписаниеНаДругиеПартии).
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.Перемещение,
		"ДокументИсточник, Партия, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Организация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Перемещение,
		Перечисления.ТипыЗаписейПартий.Потребление,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС, Организация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Перемещение,
		Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС, Организация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Перемещение,
		Перечисления.ТипыЗаписейПартий.ПотреблениеПроизводство,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС, Организация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Перемещение,
		Перечисления.ТипыЗаписейПартий.ВозвратНаДругойСклад,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС, Организация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Перемещение,
		Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС, Организация");
		
	// ПеремещениеОбособленно <- (Потребление)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно,
		"ДокументИсточник, Партия, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Организация");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно,
		Перечисления.ТипыЗаписейПартий.Потребление,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС, КорОрганизация");
		
	// ПеремещениеАвто <- (Потребление, ПотреблениеПроизводство, ПотреблениеАвто, Распределение).
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ПеремещениеАвто,
		"ДокументИсточник, Партия, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПеремещениеАвто,
		Перечисления.ТипыЗаписейПартий.Потребление,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПеремещениеАвто,
		Перечисления.ТипыЗаписейПартий.ПотреблениеПроизводство,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПеремещениеАвто,
		Перечисления.ТипыЗаписейПартий.ПотреблениеАвто,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПеремещениеАвто,
		Перечисления.ТипыЗаписейПартий.Распределение,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПеремещениеАвто,
		Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС");
		
	// СписанияНаВыпуск <- (Перемещение, ПеремещениеОбособленно, ПеремещениеАвто, ПартияСгруппированная, ОстатокСгруппированный).
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск, ПоляПотреблений + ",Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск,
		Перечисления.ТипыЗаписейПартий.Перемещение, ПоляПотреблений + ",Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск,
		Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно, ПоляПотреблений + ",Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск,
		Перечисления.ТипыЗаписейПартий.ПеремещениеАвто, ПоляПотреблений + ",Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная, ПоляПотреблений + ",Партия");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный, ПоляПотреблений + ",Партия");
		
	// Выпуск <- (СписанияНаВыпуск, Потребление)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.Выпуск,
		"Регистратор, Партия, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, АналитикаФинансовогоУчета, ВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Выпуск,
		Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Выпуск,
		Перечисления.ТипыЗаписейПартий.Потребление,
		"Регистратор, КорПартия, КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС");	
	// Также эта связь используется в ТекстДвиженияСебестоимостиТоваров()
		
	// ПотреблениеПроизводство <- (ПартияСгруппированная, Перемещение, ПеремещениеОбособленно, ОстатокСгруппированный)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ПотреблениеПроизводство, "АналитикаУчетаНоменклатуры, Организация, РазделУчета, ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеПроизводство,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная,   "АналитикаУчетаНоменклатуры, Организация, РазделУчета, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеПроизводство,
		Перечисления.ТипыЗаписейПартий.Перемещение, 		"АналитикаУчетаНоменклатуры, Организация, РазделУчета, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеПроизводство,
		Перечисления.ТипыЗаписейПартий.ПеремещениеОбособленно, "АналитикаУчетаНоменклатуры, Организация, РазделУчета, Регистратор");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПотреблениеПроизводство,
		Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный, "АналитикаУчетаНоменклатуры, Организация, РазделУчета, Регистратор");
		
	// СписаниеНаРасходы <- (ПартияСгруппированная)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СписаниеНаРасходы, ПоляПотреблений + ", ДокументИсточник");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СписаниеНаРасходы,
		Перечисления.ТипыЗаписейПартий.ПартияСгруппированная, ПоляПотреблений + ", Регистратор");
		
	// ВозвратПрошлыхПериодов <- (Прошлое)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов, "ДокументИсточник, КорАналитикаУчетаНоменклатуры, КорВидЗапасов, Организация, РазделУчета");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов,
		Перечисления.ТипыЗаписейПартий.Прошлое, 			   "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, РазделУчета");
		
	// СторноВозвратаПрошлыхПериодов <- (ВозвратПрошлыхПериодов)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.СторноВозвратаПрошлыхПериодов, "ДокументИсточник, КорАналитикаУчетаНоменклатуры, КорВидЗапасов, Организация, РазделУчета");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.СторноВозвратаПрошлыхПериодов,
		Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов, 		  "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, РазделУчета");
		
	// ИсправлениеТекущегоПериода <- (Перемещение)
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ИсправлениеТекущегоПериода, "ДокументИсточник, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, РазделУчета");
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеИсточника(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ИсправлениеТекущегоПериода,
		Перечисления.ТипыЗаписейПартий.Перемещение, "Регистратор, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, РазделУчета");	
		
	// Дополнение, ОтклонениеВСтоимости, РаспределениеПоВыбывшимТоварам, ПеремещениеУпр <- (<без источников - для формирования записей по
	// данным запроса>).
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеДополнения(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.Дополнение);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеДополнения(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеДополнения(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ОтклонениеВСтоимости);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеДополнения(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам);
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеДополнения(ОписаниеЦепочек, Перечисления.ТипыЗаписейПартий.ПеремещениеУпр);
	
	#Область БазаДопРасходыРегл
	
	Источники = Новый Соответствие;
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияРегл);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(
		ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл,
		"Организация, СтатьяРасходовАктивов, АналитикаРасходов, Подразделение, НаправлениеДеятельности",
		Источники);
	
	#КонецОбласти
	
	#Область БазаДопРасходыУпр
	
	Источники = Новый Соответствие;
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияУпр);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(
		ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр,
		"Организация, СтатьяРасходовАктивов, АналитикаРасходов, Подразделение, НаправлениеДеятельности",
		Источники);
	
	#КонецОбласти
	
	#Область ПартииДляРаспределения
	
	Источники = Новый Соответствие;
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл);
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(
		ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ПартииДляРаспределения,
		ПоляПотреблений + ", Регистратор",
		Источники,
		ПоляПотреблений + ", ДокументИсточник");
		
	#КонецОбласти
	
	#Область ПартииВПути
	
	Источники = Новый Соответствие;
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл);
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(
		ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.ПартииВПути,
		"КорАналитикаУчетаНоменклатуры, Организация, КорРазделУчета, КорВидЗапасов, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС",
		Источники,
		ПоляПотреблений);
		
	#КонецОбласти
	
	Возврат ОписаниеЦепочек;
	
КонецФункции

Функция ОписаниеДвиженийПартийНДС(ПараметрыРасчета)
	
	КолонкиТаблицыРаспределения = ТаблицаДляРаспределенияПартийНДС(ПараметрыРасчета).Колонки;
	
	ОписаниеДвижений = РасчетСебестоимостиПрикладныеАлгоритмы.ОписаниеДвижений();
	ОписаниеДвижений.Вставить("Контекст", "ПодготовкаДанныхДляУчетаНДСиУСН");
	ОписаниеДвижений.Вставить("ИмяВременнойТаблицы", "ВТДетализацияПартийТоваровДляНДСиУСН");
	ОписаниеДвижений.Вставить("ПоляРасчета", РасчетСебестоимостиПрикладныеАлгоритмы.ПереченьПолей(КолонкиТаблицыРаспределения));
	ОписаниеДвижений.Вставить("КлючиСравнения",	ПоляПотребленийПартииНДС(ПараметрыРасчета));
	ОписаниеДвижений.Вставить("Показатели", "Знаменатель, ЗнаменательДляИсточников, Количество, СтоимостьБезНДС, НДС, НДСУпр");
	ОписаниеДвижений.Вставить("БазисПрихода", "Знаменатель");
	ОписаниеДвижений.Вставить("БазисРасхода", "Знаменатель");
	ОписаниеДвижений.Вставить("КлючРасхода", "ДокументИсточник");
	ОписаниеДвижений.Вставить("ПолеПорядка", "Период");
	ОписаниеДвижений.Вставить("ПоляСортировки", "Партия");
	ОписаниеДвижений.Вставить("СортировкаПоУсловию", Истина);

	ОписаниеДвижений.Вставить("ПоляСуммирования", "Количество, СтоимостьБезНДС, НДС, НДСУпр");
	ОписаниеДвижений.Вставить("ПоляГруппировки", 
		РасчетСебестоимостиПрикладныеАлгоритмы.ПереченьПолей(КолонкиТаблицыРаспределения, ОписаниеДвижений.ПоляСуммирования));
	ОписаниеДвижений.Вставить("ЕстьСторно", Истина);
	ОписаниеДвижений.Вставить("ЕстьИсправления", Истина);
	ОписаниеДвижений.Вставить("УменьшатьБазис", Истина);
	ОписаниеДвижений.Вставить("УдалятьСтрокиБезИсточников", Истина);
	
	ОписаниеДвижений.Вставить("ВременныеТаблицыДляСледующихЭтапов",
		"ПриходыТоваровНДС, ВТДопРасходыДляРаспределения, ВТБазаРаспределенияДопРасходов, 
		|ВТБазаРаспределенияДопРасходовСводно, ВТСтатьиЗатратНаСебестоимость");
	
	Возврат ОписаниеДвижений;
	
КонецФункции

Функция ОписаниеНезаписываемыхПартийНДС(ПараметрыРасчета)
	
	НезаписываемыеТипыЗаписей = Новый Соответствие;
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.Остаток,   Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.Прошлое,   Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный, Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.ПартияСгруппированная, Истина);
	
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл, 	  		  Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр, 		  	  Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияРегл, Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияУпр,  Истина);
	
	НезаписываемыеРазделы = Новый Соответствие;
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ОписаниеНезаписываемыхДанных(Ложь, НезаписываемыеТипыЗаписей, НезаписываемыеРазделы);
	
КонецФункции

Функция ТаблицаДляРаспределенияПартийНДС(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,	ТекстОписаниеДанныхДляПартийНДСиУСН());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляПартийНДС(ПараметрыРасчета)
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатуры", // разделитель
		"Знаменатель, Количество, СтоимостьБезНДС, НДС, НДСУпр", // ресурсы
		"АналитикаУчетаНоменклатуры, Период, Приоритет ВОЗР, РазделУчета, Организация, АналитикаУчетаНоменклатуры, Партия, Регистратор"); // порядок
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляПартийНДС(ПараметрыРасчета),
		ПараметрыНумерации);
	
	СкорректироватьАналитикиУчетаПартийДляПартийНДС(ПараметрыРасчета);
	
КонецПроцедуры

Процедура СкорректироватьАналитикиУчетаПартийДляПартийНДС(ПараметрыРасчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий
	|ИЗ
	|	Данные КАК Т";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.СкорректироватьАналитикиУчетаПартийПриРасчете(ПараметрыРасчета, ТекстЗапроса);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляПартийНДС(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// подготовка временных таблиц
		+ ТекстИнициализацияПартийНДС() // вт ПриходыТоваров, СписаниеОтклоненийВСтоимости, ОстаткиТоваров, ПрошлыеРеализацииПартийНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстИсправленныеДокументыНДС() // вт ИсправленныеДокументыНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстПриходыТоваровНДС() // вт ПриходыТоваровНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстОстаткиСебестоимостиТоваров() // вт ОстаткиСебестоимостиТоваров
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстВТНачальныеОстаткиПартийНДС() // вт ВТНачальныеОстаткиПартийНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстДвиженияСебестоимостиНДС() // вт ДвиженияСебестоимостиНДС, использует ИсправленныеДокументыНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстПрошлыеРеализацииСебестоимость() // вт ПрошлыеРеализацииСебестоимость
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстРаспределениеДопРасходов()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
		// выборка данных
		+ ТекстОписаниеДанныхДляПартийНДСиУСН() //вт Данные
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДетальныеНачальныеОстаткиПартийНДС() // использует ВТНачальныеОстаткиПартийНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстНачальныеОстаткиПартийНДС() // использует ВТНачальныеОстаткиПартийНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстНачальныеОстаткиПартийДляДопРасходов() // использует ВТНачальныеОстаткиПартийНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДетальныеПриходыСебестоимостиТоваров() // использует ПриходыТоваровНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПриходыСебестоимостиТоваров() // использует ПриходыТоваровНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПриходыСебестоимостиТоваровДляДопРасходов() // использует ПриходыТоваровНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПриходыСебестоимостиТоваровВПути()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвиженияСебестоимостиТоваров()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвиженияСебестоимостиТоваровСборка()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстВозвратыПрошлыхПериодов()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстРеализацииПрошлыхМесяцевПартииНДС() // использует ПрошлыеРеализации
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстРеализацииПрошлыхМесяцевПартииНДС21() // использует ПрошлыеРеализации
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстТаможенныеДекларацииИзменениеВидыДеятельностиНДС()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстСторноДвиженияИсправленныхДокументовПрошлогоПериодаНДС() // использует ИсправленныеДокументыНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДопРасходыСредняяДляРаспределенияРегл() // использует ИсправленныеДокументыНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстБазаДопРасходыСредняяРегл() // использует ИсправленныеДокументыНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДопРасходыСредняяДляРаспределенияУпр() // использует ИсправленныеДокументыНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстБазаДопРасходыСредняяУпр() // использует ИсправленныеДокументыНДС
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДляДетализацииПартийТоваровДляНДСиУСН(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхДляПартийНДСиУСН() //вт Данные
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДанныеДляДетализацииПартийТоваровДляНДСиУСН()
		+ "";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляПартийНДСиУСН()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) 					КАК ЗапросИсточник,
		|	ДД.ТипЗаписи 									КАК ТипЗаписи,
		|	ЛОЖЬ											КАК ЭтоСторно,
		|	0 												КАК Приоритет,
		|	0 												КАК Знаменатель,
		|	0 												КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ 											КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) 	КАК Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС 		КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	ДД.Количество,
		|	ДД.СтоимостьБезНДС,
		|	ДД.НДС,
		|	ДД.НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.РазделУчета КАК КорРазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов КАК КорВидЗапасов,
		|	ДД.Организация КАК КорОрганизация,
		|	ДД.Партия КАК КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	ДД.СтатьяРасходовАктивов КАК КорСтатьяРасходов,
		|	ДД.АналитикаРасходов КАК КорАналитикаРасходов,
		|	ДД.Подразделение КАК КорПодразделение,
		|	ДД.ДокументИсточник,
		|	ДД.СтатьяСписанияНДС,
		|	ДД.АналитикаСписанияНДС,
		|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	 
КонецФункции

// ... формирования временные таблиц

Функция ТекстИнициализацияПартийНДС() // вт ПриходыТоваров, СписаниеОтклоненийВСтоимости, ОстаткиТоваров, ПрошлыеРеализацииПартийНДС
	Возврат
		"ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ДД.Партия
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|		  И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ЗаявлениеОВвозеТоваров)
		|		  И ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ПоступлениеТоваровНаСклад)
		|		  И ДД.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)
		|			ТОГДА ДД.АналитикаРасходов
		|		КОГДА НЕ Корректировка.ДокументОснование ЕСТЬ NULL
		|			ТОГДА Корректировка.ДокументОснование
		|		КОГДА НЕ ВводОстатковТоваров.Партия ЕСТЬ NULL
		|			ТОГДА ВводОстатковТоваров.Партия
		|		КОГДА НЕ ВводОстатков.Партия ЕСТЬ NULL
		|			ТОГДА ВводОстатков.Партия
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ) КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	СУММА(ДД.Количество) КАК Количество
		|ПОМЕСТИТЬ ПриходыТоваров
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
		|		ПО Корректировка.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатков КАК ВводОстатков
		|		ПО ВводОстатков.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковТоваров КАК ВводОстатковТоваров
		|		ПО ВводОстатковТоваров.Ссылка = ДД.Регистратор
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Количество > 0
		|	И ДД.СлужебноеВидДвиженияПриход
		|	И ДД.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|	И НЕ ДД.Сторно
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ДД.Партия
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|		  И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ЗаявлениеОВвозеТоваров)
		|		  И ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ПоступлениеТоваровНаСклад)
		|		  И ДД.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)
		|			ТОГДА ДД.АналитикаРасходов
		|		КОГДА НЕ Корректировка.ДокументОснование ЕСТЬ NULL
		|			ТОГДА Корректировка.ДокументОснование
		|		КОГДА НЕ ВводОстатковТоваров.Партия ЕСТЬ NULL
		|			ТОГДА ВводОстатковТоваров.Партия
		|		КОГДА НЕ ВводОстатков.Партия ЕСТЬ NULL
		|			ТОГДА ВводОстатков.Партия
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.Регистратор,
		|	СУММА(ДД.Количество) КАК Количество
		|ПОМЕСТИТЬ ПриходыСборокТоваров
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Количество > 0
		|	И ДД.СлужебноеВидДвиженияПриход
		|	И ДД.Регистратор ССЫЛКА Документ.СборкаТоваров
		|	И НЕ ДД.Сторно
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.Регистратор
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	СУММА(ДД.ДопРасходыРегл)	КАК ДопРасходыРегл,
		|	СУММА(ДД.НДСРегл)			КАК НДСРегл,
		|	СУММА(ДД.НДСУпр)			КАК НДСУпр
		|ПОМЕСТИТЬ СписаниеОтклоненийВСтоимости
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|	И НЕ ДД.СлужебноеВидДвиженияПриход
		|	И НЕ ДД.Сторно
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ ОстаткиТоваров
		|ИЗ
		|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Остатки(&ГраницаКонецПредыдущегоПериода,
		|		Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)) КАК ДД
		|ГДЕ
		|	ДД.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.ДокументИсточник,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ВЫБОР
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА ДД.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС
		|	КОНЕЦ КАК ВидДеятельностиНДС,
		|	СУММА(ДД.Количество) КАК Количество
		|ПОМЕСТИТЬ ПрошлыеРеализацииПартийНДС
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
		|	И ДД.Количество <> 0
		|	И НЕ ДД.Сторно
		|СГРУППИРОВАТЬ ПО
		|	ДД.ДокументИсточник,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ВЫБОР
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА ДД.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС
		|	КОНЕЦ
		|";
КонецФункции

Функция ТекстИсправленныеДокументыНДС() // вт ИсправленныеДокументыНДС
	Возврат "	
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Реестр.СторнируемыйДокумент КАК ДокументИсточник,
		|	РеестрИсточника.ДатаДокументаИБ КАК ДатаДокументаИсточника,
		|	ДД.Период,
		|	ДД.Регистратор
		|ПОМЕСТИТЬ ИсправленныеДокументыНДС
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ДД.Регистратор
		|		И Реестр.Организация = ДД.Организация
		|		И НЕ Реестр.ДополнительнаяЗапись
		|		И Реестр.Ссылка <> НЕОПРЕДЕЛЕНО
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрИсточника
		|		ПО РеестрИсточника.Ссылка = Реестр.СторнируемыйДокумент
		|		И РеестрИсточника.Организация = ДД.Организация
		|		И НЕ РеестрИсточника.ДополнительнаяЗапись
		|		И РеестрИсточника.Ссылка <> НЕОПРЕДЕЛЕНО
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Сторно
		|	И ДД.ДокументИсточник <> ДД.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсправленныеДокументы.Регистратор КАК Регистратор,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	СУММА(ДД.Количество) КАК Знаменатель
		|ПОМЕСТИТЬ ЗнаменателиИсправленныхДокументовНДС
		|ИЗ
		|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументыНДС КАК ИсправленныеДокументы
		|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Активность
		|	И ДД.Период < &НачалоПериода
		|	И ДД.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|	И НЕ ДД.Сторно
		|	И ДД.Количество <> 0
		|СГРУППИРОВАТЬ ПО
		|	ИсправленныеДокументы.Регистратор,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	Организация,
		|	Партия
		|";
КонецФункции

Функция ТекстПриходыТоваровНДС() // вт ПриходыТоваровНДС, использует ИсправленныеДокументыНДС
	Возврат "
		|ВЫБРАТЬ
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		КОГДА НЕ ДД.СлужебноеВидДвиженияПриход
		|			И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|		ИНАЧЕ ДД.ТипЗаписи КОНЕЦ) КАК ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	СУММА(ДД.Количество) КАК Знаменатель,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА НЕ ИсправленныеДокументы.ДокументИсточник ЕСТЬ NULL
		|			ТОГДА ИсправленныеДокументы.ДокументИсточник
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|		  И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ЗаявлениеОВвозеТоваров)
		|		  И ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ПоступлениеТоваровНаСклад)
		|		  И ДД.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)
		|			ТОГДА ДД.АналитикаРасходов
		|		КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|			ТОГДА ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументИсточник) = ТИП(Документ.ВводОстатковТоваров)
		|					ТОГДА ЕСТЬNULL(ВводОстатковТоваров.Партия,
		|						ЕСТЬNULL(ДопРасходыКорректировка.ДокументОснование, ДД.ДокументИсточник))
		|				ИНАЧЕ ЕСТЬNULL(ВводОстатков.Партия,
		|					ЕСТЬNULL(ДопРасходыКорректировка.ДокументОснование, ДД.ДокументИсточник))
		|			КОНЕЦ
		|		КОГДА НЕ Корректировка.ДокументОснование ЕСТЬ NULL
		|			ТОГДА Корректировка.ДокументОснование
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ) КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
		|		И ДД.СлужебноеВидДвиженияПриход
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия) И ДД.Количество = 0
		|		 И ДД.КорАналитикаУчетаПартий <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		ИНАЧЕ ДД.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	(ВЫБОР
		|		КОГДА НЕ ИсправленныеДокументы.ДокументИсточник ЕСТЬ NULL
		|			ТОГДА ИсправленныеДокументы.ДокументИсточник
		|		КОГДА НЕ Корректировка.ВидКорректировки ЕСТЬ NULL
		|		 И Корректировка.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
		|			ТОГДА Корректировка.ДокументОснование
		|		КОГДА НЕ СчетФактура.Исправление ЕСТЬ NULL И СчетФактура.Исправление
		|			ТОГДА СчетФактура.СчетФактураОснование
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ) КАК ДокументПоступления,
		|
		|	СУММА(ДД.Количество) КАК Количество,
		|	СУММА(
		|		ВЫБОР КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|		 И ДД.НДСРегл = 0
		|			ТОГДА 0
		|			ИНАЧЕ ДД.СтоимостьРегл + ДД.ДопРасходыРегл КОНЕЦ
		|		+ ВЫБОР
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|				ТОГДА -ДД.НДСРегл
		|			ИНАЧЕ 0
		|	КОНЕЦ - ЕСТЬNULL(СписаниеОтклонений.ДопРасходыРегл, 0)) КАК СтоимостьБезНДС,
		|	СУММА(ДД.НДСРегл - ЕСТЬNULL(СписаниеОтклонений.НДСРегл, 0)) КАК НДС,
		|	СУММА(ВЫБОР
		|		КОГДА &УправленческийУчетОрганизаций
		|			ТОГДА ДД.НДСУпр - ЕСТЬNULL(СписаниеОтклонений.НДСУпр, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	(ВЫБОР
		|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.СтатьяРасходовСписания
		|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
		|			ТОГДА ДД.СтатьяАктивовПассивов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов КАК АналитикаАктивов,
		|	(ВЫБОР
		|		КОГДА НЕ ДД.Организация В (&ОрганизацииСФИФОСкользящая)
		|		 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|		  И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ЗаявлениеОВвозеТоваров)
		|		  И ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ПоступлениеТоваровНаСклад)
		|		  И ДД.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)
		|			ТОГДА ДД.АналитикаРасходов
		|		КОГДА ДД.Партия <> НЕОПРЕДЕЛЕНО
		|		 И ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ) КАК ДокументИсточник,
		|	ДД.Сторно
		|ПОМЕСТИТЬ ПриходыТоваровНДС
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаРасчетов
		|		ПО АналитикаРасчетов.Ссылка = ДД.АналитикаУчетаПоПартнерам
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ПО Договоры.Ссылка = АналитикаРасчетов.Договор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
		|		ПО Корректировка.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК ДопРасходыКорректировка
		|		ПО ДопРасходыКорректировка.Ссылка = ДД.ДокументИсточник
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйНалоговыйАгент КАК СчетФактура
		|		ПО СчетФактура.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатков КАК ВводОстатков
		|		ПО ВводОстатков.Ссылка = ДД.ДокументИсточник
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковТоваров КАК ВводОстатковТоваров
		|		ПО ВводОстатковТоваров.Ссылка = ДД.ДокументИсточник
		|	ЛЕВОЕ СОЕДИНЕНИЕ СписаниеОтклоненийВСтоимости КАК СписаниеОтклонений
		|		ПО СписаниеОтклонений.Организация = ДД.Организация
		|		И СписаниеОтклонений.РазделУчета = ДД.РазделУчета
		|		И СписаниеОтклонений.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И СписаниеОтклонений.ВидЗапасов = ДД.ВидЗапасов
		|		И СписаниеОтклонений.Партия = ДД.Партия
		|		И СписаниеОтклонений.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И СписаниеОтклонений.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|		И ДД.СлужебноеВидДвиженияПриход
		|		И ДД.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ДД.ДокументИсточник
		|		И НЕ Реестр.ДополнительнаяЗапись
		|		И Реестр.Ссылка <> НЕОПРЕДЕЛЕНО
		|	ЛЕВОЕ СОЕДИНЕНИЕ ИсправленныеДокументыНДС КАК ИсправленныеДокументы
		|		ПО ИсправленныеДокументы.Регистратор = ДД.Регистратор
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И (ДД.СлужебноеВидДвиженияПриход
		|		ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|		ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|		ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|	И НЕ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости)
		// Исключаем суммовую корректировку приобретения, если корректируемый документ относится к периоду с выключенным партионным учетом.
		|	И НЕ (
		|		ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|   	И ДД.СлужебноеВидДвиженияПриход
		|		И ДД.Количество = 0
		|		И Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
		|		И &ИспользовалсяПартионныйУчетДоПереходаНаВерсию22 = ЛОЖЬ)
		|	И (ДД.НДСРегл <> 0
		|		ИЛИ ДД.НДСУпр <> 0
		|		ИЛИ ДД.Организация В (&ОрганизацииНаУСН)
		|		ИЛИ ДД.Регистратор ССЫЛКА Документ.СборкаТоваров
		|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт
		|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПорчаТоваров
		|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ПересортицаТоваров
		|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ОприходованиеИзлишковТоваров
		|		ИЛИ ЕСТЬNULL(Договоры.УчетАгентскогоНДС, ЛОЖЬ)
		|		ИЛИ ДД.ХозяйственнаяОперация В (
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути))
		|		ИЛИ ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ПоступлениеТоваровНаСклад)
		|		)
		// Исключаем движения по выпуску продукции на склад.
		|	И НЕ (ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|			И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства))
		|	И ДД.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение))
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И (ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|		)
		|	И НЕ ДД.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
		|	И (ВЫБОР
		|		КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
		|		И ДД.СлужебноеВидДвиженияПриход
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия) И ДД.Количество = 0
		|		 И ДД.КорАналитикаУчетаПартий <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		ИНАЧЕ ДД.АналитикаУчетаПартий КОНЕЦ) <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ОтчетКомитентуОСписании
		|	И НЕ ((ДД.Регистратор ССЫЛКА Документ.ВводОстатков
		|				И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.ВводОстатков).ВводОстатков22)
		|			ИЛИ ДД.Регистратор ССЫЛКА Документ.ВводОстатковТоваров)
		|	И НЕ (НЕ Корректировка.ВидКорректировки ЕСТЬ NULL
		|			И Корректировка.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
		|			И ДД.Количество = 0
		|			И (ДД.СтоимостьРегл < 0 ИЛИ ДД.ДопРасходыРегл < 0))
		|	И НЕ ДД.Сторно
		|СГРУППИРОВАТЬ ПО
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		КОГДА НЕ ДД.СлужебноеВидДвиженияПриход
		|			И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|		ИНАЧЕ ДД.ТипЗаписи КОНЕЦ),
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА НЕ ИсправленныеДокументы.ДокументИсточник ЕСТЬ NULL
		|			ТОГДА ИсправленныеДокументы.ДокументИсточник
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|		  И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ЗаявлениеОВвозеТоваров)
		|		  И ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ПоступлениеТоваровНаСклад)
		|		  И ДД.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)
		|			ТОГДА ДД.АналитикаРасходов
		|		КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|			ТОГДА ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументИсточник) = ТИП(Документ.ВводОстатковТоваров)
		|					ТОГДА ЕСТЬNULL(ВводОстатковТоваров.Партия,
		|						ЕСТЬNULL(ДопРасходыКорректировка.ДокументОснование, ДД.ДокументИсточник))
		|				ИНАЧЕ ЕСТЬNULL(ВводОстатков.Партия,
		|					ЕСТЬNULL(ДопРасходыКорректировка.ДокументОснование, ДД.ДокументИсточник))
		|			КОНЕЦ
		|		КОГДА НЕ Корректировка.ДокументОснование ЕСТЬ NULL
		|			ТОГДА Корректировка.ДокументОснование
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
		|		И ДД.СлужебноеВидДвиженияПриход
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия) И ДД.Количество = 0
		|		 И ДД.КорАналитикаУчетаПартий <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		ИНАЧЕ ДД.АналитикаУчетаПартий КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА НЕ ИсправленныеДокументы.ДокументИсточник ЕСТЬ NULL
		|			ТОГДА ИсправленныеДокументы.ДокументИсточник
		|		КОГДА НЕ Корректировка.ВидКорректировки ЕСТЬ NULL
		|		 И Корректировка.ВидКорректировки <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
		|			ТОГДА Корректировка.ДокументОснование
		|		КОГДА НЕ СчетФактура.Исправление ЕСТЬ NULL И СчетФактура.Исправление
		|			ТОГДА СчетФактура.СчетФактураОснование
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ), // ДокументПоступления
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	(ВЫБОР
		|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.СтатьяРасходовСписания
		|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
		|			ТОГДА ДД.СтатьяАктивовПассивов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ),
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов,
		|	(ВЫБОР
		|		КОГДА НЕ ДД.Организация В (&ОрганизацииСФИФОСкользящая)
		|		 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|		  И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.ЗаявлениеОВвозеТоваров)
		|		  И ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) = ТИП(Документ.ПоступлениеТоваровНаСклад)
		|		  И ДД.АналитикаРасходов <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)
		|			ТОГДА ДД.АналитикаРасходов
		|		КОГДА ДД.Партия <> НЕОПРЕДЕЛЕНО
		|		 И ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ),
		|	ДД.Сторно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	СУММА(ДД.Количество) КАК Знаменатель,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	(ВЫБОР
		|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		ИНАЧЕ ДД.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ДД.Регистратор КАК ДокументПоступления,
		|
		|	СУММА(ДД.Количество) КАК Количество,
		|	СУММА(СписаниеОтклонений.ДопРасходыРегл
		|		+ ВЫБОР
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|				ТОГДА -СписаниеОтклонений.НДСРегл
		|			ИНАЧЕ 0
		|	КОНЕЦ) КАК СтоимостьБезНДС,
		|	СУММА(СписаниеОтклонений.НДСРегл) КАК НДС,
		|	СУММА(ВЫБОР
		|		КОГДА &УправленческийУчетОрганизаций
		|			ТОГДА СписаниеОтклонений.НДСУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов КАК АналитикаАктивов,
		|	(ВЫБОР
		|		КОГДА ДД.Партия <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ) КАК ДокументИсточник,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписаниеОтклоненийВСтоимости КАК СписаниеОтклонений
		|		ПО СписаниеОтклонений.Организация = ДД.Организация
		|		И СписаниеОтклонений.РазделУчета = ДД.РазделУчета
		|		И СписаниеОтклонений.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И СписаниеОтклонений.ВидЗапасов = ДД.ВидЗапасов
		|		И СписаниеОтклонений.Партия = ДД.Партия
		|		И СписаниеОтклонений.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И СписаниеОтклонений.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|		И ДД.СлужебноеВидДвиженияПриход
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.СлужебноеВидДвиженияПриход
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|	И (ВЫБОР
		|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		ИНАЧЕ ДД.АналитикаУчетаПартий КОНЕЦ) <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|	И НЕ ДД.Сторно
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	(ВЫБОР
		|		КОГДА ДД.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|			ТОГДА ДД.КорАналитикаУчетаПартий
		|		ИНАЧЕ ДД.АналитикаУчетаПартий КОНЕЦ),
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов,
		|	(ВЫБОР
		|		КОГДА ДД.Партия <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ),
		|	ДД.Сторно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОстатокСгруппированный) КАК ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	СУММА(ДД.Количество) КАК Знаменатель,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	СУММА(ДД.Количество) КАК Количество,
		|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(ДД.НДС) КАК НДС,
		|	СУММА(ДД.НДСУпр) КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов КАК АналитикаАктивов,
		|	ДД.Регистратор КАК ДокументИсточник,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|ГДЕ
		|	((ДД.Регистратор ССЫЛКА Документ.ВводОстатков
		|			И НЕ ВЫРАЗИТЬ(Регистратор КАК Документ.ВводОстатков).ВводОстатков22)
		|		ИЛИ ДД.Регистратор ССЫЛКА Документ.ВводОстатковТоваров)
		|	И ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И НЕ ДД.Сторно
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ТипЗаписи,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстОстаткиСебестоимостиТоваров() // вт ОстаткиСебестоимостиТоваров
	Возврат "
		|ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ ОстаткиСебестоимостиТоваров
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаКонецПредыдущегоПериода,
		|		Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)) КАК ДД
		|ГДЕ
		|	ДД.КоличествоОстаток > 0
		|";
КонецФункции

Функция ТекстВТНачальныеОстаткиПартийНДС() // вт ВТНачальныеОстаткиПартийНДС
	Возврат "
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА ЕСТЬNULL(Остатки.Количество, ДД.КоличествоОстаток) < 0
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСторно,
		|	ЕСТЬNULL(Остатки.Количество, ДД.КоличествоОстаток) КАК Знаменатель,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура 	КАК Номенклатура,
		|	ДД.АналитикаУчетаПартий.НалогообложениеНДС 	КАК НалогообложениеПартии,
		|	
		| ЕСТЬNULL(ПериодикаПартии.ДатаРегистратора, &КонецПредыдущегоПериода) КАК Период,
		|	(ВЫБОР
		|		КОГДА ДД.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути))
		|			ТОГДА ДД.Партия
		|		КОГДА ОстаткиСебестоимостиТоваров.Партия ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ ДД.Партия КОНЕЦ) КАК Регистратор,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	ДД.КоличествоОстаток КАК Количество,
		|	ДД.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
		|	ДД.НДСОстаток КАК НДС,
		|	ДД.НДСУпрОстаток КАК НДСУпр
		|ПОМЕСТИТЬ ВТНачальныеОстаткиПартийНДС
		|ИЗ
		|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Остатки(&ГраницаКонецПредыдущегоПериода,
		|		Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)) КАК ДД
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиТоваров КАК Остатки
		|		ПО Остатки.Организация = ДД.Организация
		|		И Остатки.РазделУчета = ДД.РазделУчета
		|		И Остатки.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Остатки.ВидЗапасов = ДД.ВидЗапасов
		|		И Остатки.Партия = ДД.Партия
		|		И Остатки.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Остатки.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСебестоимостиТоваров КАК ОстаткиСебестоимостиТоваров
		|		ПО ОстаткиСебестоимостиТоваров.Организация = ДД.Организация
		|		И ОстаткиСебестоимостиТоваров.РазделУчета = ДД.РазделУчета
		|		И ОстаткиСебестоимостиТоваров.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И ОстаткиСебестоимостиТоваров.ВидЗапасов = ДД.ВидЗапасов
		|		И ОстаткиСебестоимостиТоваров.Партия = ДД.Партия
		|		И ОстаткиСебестоимостиТоваров.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И ОстаткиСебестоимостиТоваров.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ПериодикаПартии
		|		ПО ПериодикаПартии.Организация = ДД.Организация
		|		И ПериодикаПартии.Документ = ДД.Партия
		|";
КонецФункции

Функция ТекстДвиженияСебестоимостиНДС() // вт ДвиженияСебестоимостиНДС, использует ИсправленныеДокументыНДС 	
	Возврат "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск) И НЕ ДД.СлужебноеВидДвиженияПриход
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеАвто)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|
		|		ИНАЧЕ ДД.ТипЗаписи
		|	КОНЕЦ КАК ТипЗаписи,
		|	(ВЫБОР
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЭтоСторно,
		|	СУММА(ДД.Количество) КАК Знаменатель,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	
		|	ДД.Период,
		|	ДД.Регистратор КАК Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА КорректировкаПриобретения.ДокументОснование ЕСТЬ НЕ NULL
		|			ТОГДА КорректировкаПриобретения.ДокументОснование
		|		ИНАЧЕ ДД.Партия КОНЕЦ) КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	СУММА(ДД.Количество) КАК Количество,
		|
		|	ДД.ХозяйственнаяОперация,
		|	(ВЫБОР
		|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL И НЕ ДД.СлужебноеВидДвиженияПриход
		|			ТОГДА Передача.НалогообложениеНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ) КАК КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	(ВЫБОР
		|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.СтатьяРасходовСписания
		|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
		|			ТОГДА ДД.СтатьяАктивовПассивов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов КАК АналитикаАктивов,
		|	ДД.КорНаправлениеДеятельности,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства))
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ) КАК ДокументИсточник,
		|	ДД.Сторно
		|ПОМЕСТИТЬ ДвиженияСебестоимостиНДС
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
		|		ПО Передача.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ ИсправленныеДокументыНДС КАК ИсправленныеДокументы
		|		ПО ИсправленныеДокументы.Регистратор = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК КорректировкаПриобретения
		|		ПО КорректировкаПриобретения.Ссылка = ДД.Регистратор
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Количество <> 0
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И НЕ ДД.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
		|	И (НЕ ДД.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСвСтоимости),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов))
		|	)
		|	И НЕ (ДД.Регистратор ССЫЛКА Документ.ПересортицаТоваров И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение))
		|	И НЕ (ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением))
		// Исключаем исправления документов прошлого периода.
		// Эти движения формируются в функции ТекстСторноДвиженияИсправленныхДокументовПрошлогоПериодаНДС().
		|	И НЕ (ДД.Сторно
		|		И ЕСТЬNULL(ИсправленныеДокументы.ДатаДокументаИсточника, &НачалоПериода) < &НачалоПериода)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск) И НЕ ДД.СлужебноеВидДвиженияПриход
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеАвто)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|
		|		ИНАЧЕ ДД.ТипЗаписи
		|	КОНЕЦ, // ТипЗаписи
		|	(ВЫБОР
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ), // ЭтоСторно
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ, // ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА КорректировкаПриобретения.ДокументОснование ЕСТЬ НЕ NULL
		|			ТОГДА КорректировкаПриобретения.ДокументОснование
		|		ИНАЧЕ ДД.Партия КОНЕЦ), // Партия
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.ХозяйственнаяОперация,
		|	(ВЫБОР
		|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL И НЕ ДД.СлужебноеВидДвиженияПриход
		|			ТОГДА Передача.НалогообложениеНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ), // КорВидДеятельностиНДС
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	(ВЫБОР
		|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.СтатьяРасходовСписания
		|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
		|			ТОГДА ДД.СтатьяАктивовПассивов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ), // СтатьяРасходовАктивов
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов,
		|	ДД.КорНаправлениеДеятельности,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства))
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ), // ДокументИсточник
		|	ДД.Сторно
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|";
КонецФункции

Функция ТекстПрошлыеРеализацииСебестоимость() // вт ПрошлыеРеализацииСебестоимость
	Возврат "
		|ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	Прошлые.ВидЗапасов,
		|	Прошлые.АналитикаФинансовогоУчета,
		|	Прошлые.ВидДеятельностиНДС,
		|	СУММА(ДД.Количество) КАК Количество
		|
		|ПОМЕСТИТЬ ПрошлыеРеализацииСебестоимость
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеРеализацииПартийНДС КАК Прошлые
		|		ПО ДД.Регистратор = Прошлые.ДокументИсточник
		|		И ДД.Организация = Прошлые.Организация
		|		И ДД.РазделУчета = Прошлые.РазделУчета
		|		И ДД.АналитикаУчетаНоменклатуры = Прошлые.АналитикаУчетаНоменклатуры
		|		И (ДД.ВидЗапасов = Прошлые.ВидЗапасов
		|			ИЛИ ДД.ВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
		|		И ДД.АналитикаФинансовогоУчета = Прошлые.АналитикаФинансовогоУчета
		|		И ДД.КорВидДеятельностиНДС = Прошлые.ВидДеятельностиНДС
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	Прошлые.ВидЗапасов,
		|	Прошлые.АналитикаФинансовогоУчета,
		|	Прошлые.ВидДеятельностиНДС
		|";
КонецФункции

//-- Локализация 

Функция ТекстРаспределениеДопРасходов()
	
	Возврат "
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ПОМЕСТИТЬ ВТОрганизацииДляРаспределенияДопРасходовНДС
	|ИЗ
	|	Справочник.Организации КАК Т
	|ГДЕ
	|	Т.Ссылка В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|	ИЛИ Т.Ссылка В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	ВЫБОР КОГДА Т.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентУпр,
	|	ВЫБОР КОГДА Т.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентРегл
	|ПОМЕСТИТЬ ВТСтатьиЗатратНаСебестоимость
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Т
	|ГДЕ
	|	(Т.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		ИЛИ Т.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|	И Т.ВариантРаздельногоУчетаНДС <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Период КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.ДокументПоступленияРасходов КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	СУММА(Т.СтоимостьРегл * Статьи.КоэффициентРегл) КАК СтоимостьРегл,
	|	СУММА(Т.НДСРегл * Статьи.КоэффициентРегл) КАК НДСРегл,
	|	СУММА(Т.Стоимость * Статьи.КоэффициентУпр) КАК Стоимость,
	|	СУММА(Т.СтоимостьБезНДС * Статьи.КоэффициентУпр) КАК СтоимостьБезНДС,
	|	СУММА(Т.НДСУпр * Статьи.КоэффициентУпр) КАК НДСУпр,
	|	СУММА(ВЫБОР
	// Для НДС налогового агента в качестве знаменателя берется НДС в упр. учете,
	// т.к. в регистре "Прочие расходы" будет только сумма в упр учете.
	|		КОГДА Т.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента) И Т.НДСУпр <> 0
	|			ТОГДА Т.НДСУпр
	|		КОГДА Т.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента) И Т.СтоимостьБезНДС <> 0
	|			ТОГДА Т.СтоимостьБезНДС
	|		КОГДА Т.СтоимостьРегл <> 0 ТОГДА Т.СтоимостьРегл
	|		ИНАЧЕ Т.НДСРегл КОНЕЦ
	|		* Статьи.КоэффициентРегл) КАК ЗнаменательРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Т.СтоимостьБезНДС <> 0 ТОГДА Т.СтоимостьБезНДС
	|		ИНАЧЕ Т.НДСУпр КОНЕЦ
	|		* Статьи.КоэффициентУпр) КАК ЗнаменательУпр
	|ПОМЕСТИТЬ ВТДопРасходыДляРаспределенияПредварительная
	|ИЗ
	|	ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииДляРаспределенияДопРасходовНДС КАК Организации
	|		ПО Т.Организация = Организации.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиЗатратНаСебестоимость КАК Статьи
	|		ПО Т.СтатьяРасходов = Статьи.Ссылка
	|ГДЕ
	|	Т.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.Период,
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий,
	|	Т.НаправлениеДеятельности,
	|	Т.ХозяйственнаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	&НачалоПериода КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.ДокументПоступленияРасходов КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	СУММА(Т.СтоимостьРеглОстаток * Статьи.КоэффициентРегл) КАК СтоимостьРегл,
	|	СУММА(Т.НДСРеглОстаток * Статьи.КоэффициентРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьОстаток * Статьи.КоэффициентУпр) КАК Стоимость,
	|	СУММА(Т.СтоимостьБезНДСОстаток * Статьи.КоэффициентУпр) КАК СтоимостьБезНДС,
	|	СУММА(Т.НДСУпрОстаток * Статьи.КоэффициентУпр) КАК НДСУпр,
	|	СУММА(Т.СтоимостьРеглОстаток * Статьи.КоэффициентРегл) КАК ЗнаменательРегл,
	|	СУММА(Т.СтоимостьБезНДСОстаток * Статьи.КоэффициентУпр) КАК ЗнаменательУпр
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов.Остатки(&ГраницаКонецПредыдущегоПериода,
	|		Организация В(ВЫБРАТЬ Т.Ссылка ИЗ ВТОрганизацииДляРаспределенияДопРасходовНДС КАК Т)
	|	) КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиЗатратНаСебестоимость КАК Статьи
	|		ПО Т.СтатьяРасходов = Статьи.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий,
	|	Т.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	Подразделение,
	|	Организация,
	|	НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ДокументПоступления
	|ПОМЕСТИТЬ ВТДокументыПоступленияРасходов
	|ИЗ
	|	ВТДопРасходыДляРаспределенияПредварительная КАК Т
	|ГДЕ
	|	Т.ДокументПоступления <> НЕОПРЕДЕЛЕНО
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор
	|ПОМЕСТИТЬ ВТРегистраторыРасходов
	|ИЗ
	|	ВТДопРасходыДляРаспределенияПредварительная КАК Т
	|ГДЕ
	|	Т.Регистратор <> НЕОПРЕДЕЛЕНО
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.Подразделение,
	|	Т.Организация,
	|	Т.НаправлениеДеятельности,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.СуммаУпр <> 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЕстьСуммаУпр
	|ПОМЕСТИТЬ ВТДвиженияПрочиеРасходы
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиЗатратНаСебестоимость КАК Статьи
	|		ПО Т.СтатьяРасходов = Статьи.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыПоступленияРасходов КАК ДокументыПоступления
	|		ПО Т.Регистратор = ДокументыПоступления.ДокументПоступления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистраторыРасходов КАК Регистраторы
	|		ПО Т.Регистратор = Регистраторы.Регистратор
	|ГДЕ
	|	Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Т.Период <= &КонецПериода
	|	И (НЕ ДокументыПоступления.ДокументПоступления ЕСТЬ NULL
	|		ИЛИ НЕ Регистраторы.Регистратор ЕСТЬ NULL)
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.Подразделение,
	|	Т.Организация,
	|	Т.НаправлениеДеятельности
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	Подразделение,
	|	Организация,
	|	НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор,
	|	Т.Период,
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.ВидДеятельностиНДС,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.ХозяйственнаяОперация,
	|	Т.СтоимостьРегл,
	|	Т.НДСРегл,
	|	Т.Стоимость,
	|	Т.СтоимостьБезНДС,
	|	ВЫБОР КОГДА ЕСТЬNULL(ПрочиеРасходы.ЕстьСуммаУпр, ИСТИНА) ТОГДА Т.СтоимостьБезНДС ИНАЧЕ 0 КОНЕЦ КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр,
	|	Т.ЗнаменательРегл,
	|	Т.ЗнаменательУпр
	|ПОМЕСТИТЬ ВТДопРасходыДляРаспределения
	|ИЗ
	|	ВТДопРасходыДляРаспределенияПредварительная КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияПрочиеРасходы КАК ПрочиеРасходы
	|		ПО Т.СтатьяРасходов = ПрочиеРасходы.СтатьяРасходов
	|		И Т.АналитикаРасходов = ПрочиеРасходы.АналитикаРасходов
	|		И Т.Подразделение = ПрочиеРасходы.Подразделение
	|		И Т.Организация = ПрочиеРасходы.Организация
	|		И Т.НаправлениеДеятельности = ПрочиеРасходы.НаправлениеДеятельности
	|		И (Т.ДокументПоступления = ПрочиеРасходы.Регистратор
	|			ИЛИ Т.Регистратор = ПрочиеРасходы.Регистратор)
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.ТипЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
	|	ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК КорНаправлениеДеятельности,
	|	ДокументРаспределения.Подразделение,
	|	ДокументРаспределения.СтатьяРасходов,
	|	ДокументРаспределения.АналитикаРасходов,
	|	ДокументРаспределения.НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА Реестр.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА КОНЕЦ) КАК УказанДокументВАналитикеРасходов,			
	|	
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ДопРасходыРегл <> 0 ТОГДА ДД.ДопРасходыРегл
	|		КОГДА ДД.ДопРасходыБезНДС <> 0 ТОГДА ДД.ДопРасходыБезНДС
	|		ИНАЧЕ ДД.ДопРасходы КОНЕЦ) КАК ЗнаменательРегл,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ДопРасходыУпр <> 0 ТОГДА ДД.ДопРасходыУпр
	|		КОГДА ДД.ДопРасходыБезНДС <> 0 ТОГДА ДД.ДопРасходыБезНДС
	|		ИНАЧЕ ДД.ДопРасходы КОНЕЦ) КАК ЗнаменательУпр,
	|	СУММА(ЕСТЬNULL(Доли.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ ВТБазаРаспределенияДопРасходовБезПартий
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК ДокументРаспределения
	|		ПО ДД.Регистратор = ДокументРаспределения.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииДляРаспределенияДопРасходовНДС КАК Организации
	|		ПО ДД.Организация = Организации.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДолиДополнительныхРасходов КАК Доли
	|		ПО Доли.Регистратор = ДД.Регистратор
	|		И Доли.КорАналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
	|		И Доли.КорРазделУчета = ДД.РазделУчета
	|		И Доли.КорВидЗапасов = ДД.ВидЗапасов
	|		И Доли.КорОрганизация = ДД.Организация
	|		И Доли.КорПартия = ДД.Партия
	|		И Доли.КорАналитикаУчетаПартий = ДД.АналитикаУчетаПартий
	|		И Доли.КорАналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
	|		И Доли.КорВидДеятельностиНДС = ДД.ВидДеятельностиНДС
	|		И Доли.ТипЗаписи = ДД.ТипЗаписи
	|		И Доли.АналитикаУчетаПоПартнерам = ДД.АналитикаУчетаПоПартнерам
	|		И Доли.ЗаказКлиента = ДД.ЗаказКлиента
	|		И Доли.ХозяйственнаяОперация = ДД.НастройкаХозяйственнойОперации.ХозяйственнаяОперация
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = ДД.АналитикаРасходов
	|		И НЕ Реестр.ДополнительнаяЗапись
	|ГДЕ
	|	ДД.СлужебноеВидДвиженияПриход
	|	И ДД.ТипЗаписи В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.ТипЗаписи,
	|	ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО),
	|	ДокументРаспределения.Подразделение,
	|	ДокументРаспределения.СтатьяРасходов,
	|	ДокументРаспределения.АналитикаРасходов,
	|	ДокументРаспределения.НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА Реестр.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|	ЕСТЬNULL(ПоступлениеТоваров.ЗакупкаПодДеятельность, ПоступлениеУслуг.ЗакупкаПодДеятельность) КАК ВидДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы) КАК ТипЗаписи,
	|	ДД.КорСтатьяРасходов КАК КорСтатьяРасходов,
	|	ДД.КорАналитикаРасходов КАК КорАналитикаРасходов,
	|	ДД.КорПодразделение КАК КорПодразделение,
	|	ДД.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДокументРаспределения.Подразделение,
	|	ДокументРаспределения.СтатьяРасходов,
	|	ДокументРаспределения.АналитикаРасходов,
	|	ДокументРаспределения.НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА Реестр.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА КОНЕЦ) КАК УказанДокументВАналитикеРасходов,
	|	
	|	СУММА(ВЫБОР
	|		КОГДА ДД.СуммаРегл <> 0 ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ ДД.Сумма КОНЕЦ) КАК ЗнаменательРегл,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.СуммаУпр <> 0 ТОГДА ДД.СуммаУпр
	|		ИНАЧЕ ДД.Сумма КОНЕЦ) КАК ЗнаменательУпр,
	|	СУММА(ЕСТЬNULL(Доли.ДоляСтоимостиРегл, 0)) КАК Количество
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК ДокументРаспределения
	|		ПО ДД.Регистратор = ДокументРаспределения.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииДляРаспределенияДопРасходовНДС КАК Организации
	|		ПО ДД.Организация = Организации.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДолиДополнительныхРасходов КАК Доли
	|		ПО Доли.Регистратор = ДД.Регистратор
	|		И Доли.КорСтатьяРасходов = ДД.КорСтатьяРасходов
	|		И Доли.КорАналитикаРасходов = ДД.КорАналитикаРасходов
	|		И Доли.КорПодразделение = ДД.КорПодразделение
	|		И Доли.КорНаправлениеДеятельности = ДД.КорНаправлениеДеятельности
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = ДД.АналитикаРасходов
	|		И НЕ Реестр.ДополнительнаяЗапись
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваров
	|		ПО ПоступлениеТоваров.Ссылка = ДокументРаспределения.АналитикаРасходов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПрочихАктивов КАК ПоступлениеУслуг
	|		ПО ПоступлениеУслуг.Ссылка = ДокументРаспределения.АналитикаРасходов
	|ГДЕ
	|	НЕ ДД.СлужебноеВидДвиженияПриход
	|	И ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
	|	И ДД.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И ДД.КорСтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация,
	|	ДД.КорСтатьяРасходов,
	|	ДД.КорАналитикаРасходов,
	|	ДД.КорПодразделение,
	|	ДД.КорНаправлениеДеятельности,
	|	ЕСТЬNULL(ПоступлениеТоваров.ЗакупкаПодДеятельность, ПоступлениеУслуг.ЗакупкаПодДеятельность), // ВидДеятельностиНДС
	|	ДокументРаспределения.Подразделение,
	|	ДокументРаспределения.СтатьяРасходов,
	|	ДокументРаспределения.АналитикаРасходов,
	|	ДокументРаспределения.НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА Реестр.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.Организация КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.КорСтатьяРасходов,
	|	ДД.КорАналитикаРасходов,
	|	ДД.КорПодразделение,
	|	ДД.КорНаправлениеДеятельности,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.УказанДокументВАналитикеРасходов,
	|	ВЫБОР КОГДА ЛОЖЬ ТОГДА НЕОПРЕДЕЛЕНО // для удобства расстановки тегов
	//++ Локализация
	|		КОГДА ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
	|			ТОГДА ЕСТЬNULL(Партии.Партия, ДД.Партия)
	//-- Локализация
	|		ИНАЧЕ ДД.Партия
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР КОГДА ЛОЖЬ ТОГДА НЕОПРЕДЕЛЕНО // для удобства расстановки тегов
	//++ Локализация
	|		КОГДА ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
	|			ТОГДА ЕСТЬNULL(Партии.АналитикаУчетаПартий, ДД.АналитикаУчетаПартий)
	//-- Локализация
	|		ИНАЧЕ ДД.АналитикаУчетаПартий
	|	КОНЕЦ КАК АналитикаУчетаПартий,
	|	ДД.ТипЗаписи,
	|	
	|	ВЫБОР КОГДА ДД.ЗнаменательРегл < 0 ТОГДА -ДД.ЗнаменательРегл ИНАЧЕ ДД.ЗнаменательРегл КОНЕЦ КАК ЗнаменательРегл,
	|	ВЫБОР КОГДА ДД.ЗнаменательУпр < 0 ТОГДА -ДД.ЗнаменательУпр ИНАЧЕ ДД.ЗнаменательУпр КОНЕЦ КАК ЗнаменательУпр,
	|	ДД.Количество
	|ПОМЕСТИТЬ ВТБазаРаспределенияДопРасходов
	|ИЗ
	|	ВТБазаРаспределенияДопРасходовБезПартий КАК ДД
	//++ Локализация
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПриходыТоваровНДС КАК Партии
	|		ПО ДД.АналитикаРасходов = Партии.Регистратор
	|		И ДД.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		И ДД.ВидЗапасов = Партии.ВидЗапасов
	|		И ДД.Организация = Партии.Организация
	//-- Локализация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СУММА(ДД.ЗнаменательРегл) КАК ЗнаменательРегл,
	|	СУММА(ДД.ЗнаменательУпр) КАК ЗнаменательУпр
	|ПОМЕСТИТЬ ВТБазаРаспределенияДопРасходовСводно
	|ИЗ
	|	ВТБазаРаспределенияДопРасходов КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	Подразделение,
	|	Организация,
	|	НаправлениеДеятельности
	|";
	
КонецФункции

//++ Локализация 

// ... выборки данных

Функция ТекстДетальныеНачальныеОстаткиПартийНДС() // использует ВТНачальныеОстаткиПартийНДС
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДетальныеНачальныеОстаткиПартийНДС"" 	 КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Остаток) КАК ТипЗаписи,
		|	ВЫБОР
		|		КОГДА ДД.Знаменатель < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	ДД.Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ДД.Номенклатура,
		|	ДД.НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	ДД.Количество,
		|	ДД.СтоимостьБезНДС,
		|	ДД.НДС,
		|	ДД.НДСУпр,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТНачальныеОстаткиПартийНДС КАК ДД
		|";
КонецФункции

Функция ТекстНачальныеОстаткиПартийНДС() // использует ВТНачальныеОстаткиПартийНДС
	Возврат
		"ВЫБРАТЬ
		|	""ТекстНачальныеОстаткиПартийНДС"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОстатокСгруппированный) КАК ТипЗаписи,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ДД.Знаменатель) < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	МАКСИМУМ(ДД.Знаменатель),
		|	СУММА(ДД.Знаменатель) КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	0,
		|	0,
		|	0,
		|	0,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТНачальныеОстаткиПартийНДС КАК ДД
		|СГРУППИРОВАТЬ ПО
		|	ДД.Номенклатура,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС
		|";
КонецФункции

Функция ТекстНачальныеОстаткиПартийДляДопРасходов() // использует ВТНачальныеОстаткиПартийНДС
	Возврат
		"ВЫБРАТЬ
		|	""ТекстНачальныеОстаткиПартийДляДопРасходов"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОстатокДляРаспределения) КАК ТипЗаписи,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ДД.Знаменатель) < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	МАКСИМУМ(ДД.Знаменатель),
		|	СУММА(ДД.Знаменатель) КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК КорАналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТНачальныеОстаткиПартийНДС КАК ДД
		|ГДЕ
		|	ДД.Количество <> 0
		|СГРУППИРОВАТЬ ПО
		|	ДД.Номенклатура,
		|	ДД.Период,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС
		|";
КонецФункции

Функция ТекстДетальныеПриходыСебестоимостиТоваров() // использует ПриходыТоваровНДС
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДетальныеПриходыСебестоимостиТоваров"" КАК ЗапросИсточник,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|		 И ДД.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии)
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|		 И Приходы.Количество ЕСТЬ NULL
		|		 И Остатки.Количество ЕСТЬ NULL
		|		 И ОстаткиСебестоимостиТоваров.Количество ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии)
		|		ИНАЧЕ ДД.ТипЗаписи КОНЕЦ) КАК ТипЗаписи,
		|	(ВЫБОР
		|		КОГДА НЕ Приходы.Количество ЕСТЬ NULL И Приходы.Количество < 0 ТОГДА ИСТИНА
		|		КОГДА НЕ Остатки.Количество ЕСТЬ NULL И Остатки.Количество < 0 ТОГДА ИСТИНА
		|		КОГДА НЕ ОстаткиСебестоимостиТоваров.Количество ЕСТЬ NULL И ОстаткиСебестоимостиТоваров.Количество < 0
		|			ТОГДА ИСТИНА
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	(ВЫБОР
		|		КОГДА НЕ Приходы.Количество ЕСТЬ NULL ТОГДА Приходы.Количество
		|		КОГДА НЕ Остатки.Количество ЕСТЬ NULL ТОГДА Остатки.Количество
		|		КОГДА НЕ ОстаткиСебестоимостиТоваров.Количество ЕСТЬ NULL ТОГДА ОстаткиСебестоимостиТоваров.Количество
		|		КОГДА НЕ ОстаткиПартийНДС.Количество ЕСТЬ NULL ТОГДА ОстаткиПартийНДС.Количество
		|		ИНАЧЕ ДД.Количество КОНЕЦ) КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ДД.Номенклатура,
		|	ДД.НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ВЫБОР КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|	 И Приходы.Количество ЕСТЬ NULL
		|	 И Остатки.Количество ЕСТЬ NULL
		|	 И ОстаткиСебестоимостиТоваров.Количество ЕСТЬ NULL
		|		ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ДД.Партия
		|	КОНЕЦ КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	ДД.Количество,
		|	ДД.СтоимостьБезНДС,
		|	ДД.НДС,
		|	ДД.НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ПриходыТоваровНДС КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиТоваров КАК Остатки
		|		ПО ДД.ТипЗаписи В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|		И ДД.Количество = 0
		|		И Остатки.Организация = ДД.Организация
		|		И Остатки.РазделУчета = ДД.РазделУчета
		|		И Остатки.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Остатки.ВидЗапасов = ДД.ВидЗапасов
		|		И Остатки.Партия = ДД.Партия
		|		И Остатки.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Остатки.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСебестоимостиТоваров КАК ОстаткиСебестоимостиТоваров
		|		ПО ОстаткиСебестоимостиТоваров.Организация = ДД.Организация
		|		И ОстаткиСебестоимостиТоваров.РазделУчета = ДД.РазделУчета
		|		И ОстаткиСебестоимостиТоваров.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И ОстаткиСебестоимостиТоваров.ВидЗапасов = ДД.ВидЗапасов
		|		И ОстаткиСебестоимостиТоваров.Партия = ДД.Партия
		|		И ОстаткиСебестоимостиТоваров.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И ОстаткиСебестоимостиТоваров.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПриходыТоваров КАК Приходы
		|		ПО ДД.ТипЗаписи В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|		И ДД.Количество = 0
		|		И Приходы.Организация = ДД.Организация
		|		И Приходы.РазделУчета = ДД.РазделУчета
		|		И Приходы.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Приходы.ВидЗапасов = ДД.ВидЗапасов
		|		И Приходы.Партия = ДД.Партия
		|		И Приходы.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Приходы.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстаткиПартийНДС КАК ОстаткиПартийНДС
		|		ПО ОстаткиПартийНДС.Организация = ДД.Организация
		|		И ОстаткиПартийНДС.РазделУчета = ДД.РазделУчета
		|		И ОстаткиПартийНДС.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И ОстаткиПартийНДС.ВидЗапасов = ДД.ВидЗапасов
		|		И ОстаткиПартийНДС.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И ОстаткиПартийНДС.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|		И ОстаткиПартийНДС.Регистратор = ДД.ДокументИсточник
		|		И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|		И ОстаткиПартийНДС.Количество <> 0
		|ГДЕ
		|	НЕ (ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		И ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)))
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И ДД.ВидДеятельностиНДС <> НЕОПРЕДЕЛЕНО
		|	И (ДД.Количество <> 0
		|		ИЛИ ДД.СтоимостьБезНДС <> 0
		|		ИЛИ ДД.НДС <> 0
		|		ИЛИ ДД.НДСУпр <> 0)
		|";
КонецФункции

Функция ТекстПриходыСебестоимостиТоваров() // использует ПриходыТоваровНДС
	Возврат
		"ВЫБРАТЬ
		|	""ТекстПриходыСебестоимостиТоваров"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПартияСгруппированная) КАК ТипЗаписи,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА НЕ Приходы.Количество ЕСТЬ NULL И Приходы.Количество < 0 ТОГДА ИСТИНА
		|		КОГДА НЕ Остатки.Количество ЕСТЬ NULL И Остатки.Количество < 0 ТОГДА ИСТИНА
		|		КОГДА НЕ ОстаткиСебестоимостиТоваров.Количество ЕСТЬ NULL И ОстаткиСебестоимостиТоваров.Количество < 0
		|			ТОГДА ИСТИНА
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА НЕ Приходы.Количество ЕСТЬ NULL ТОГДА Приходы.Количество
		|		КОГДА НЕ Остатки.Количество ЕСТЬ NULL ТОГДА Остатки.Количество
		|		КОГДА НЕ ОстаткиСебестоимостиТоваров.Количество ЕСТЬ NULL ТОГДА ОстаткиСебестоимостиТоваров.Количество
		|		ИНАЧЕ ДД.Количество КОНЕЦ) КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ЕСТЬNULL(ПериодикаПартии.ДатаРегистратора, &КонецПредыдущегоПериода) КАК Период,
		|	ЕСТЬNULL(ИсправленныеДокументы.Регистратор, ДД.Партия) КАК Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ПриходыТоваровНДС КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиТоваров КАК Остатки
		|		ПО ДД.ТипЗаписи В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|		И ДД.Количество = 0
		|		И Остатки.Организация = ДД.Организация
		|		И Остатки.РазделУчета = ДД.РазделУчета
		|		И Остатки.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Остатки.ВидЗапасов = ДД.ВидЗапасов
		|		И Остатки.Партия = ДД.Партия
		|		И Остатки.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Остатки.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСебестоимостиТоваров КАК ОстаткиСебестоимостиТоваров
		|		ПО ОстаткиСебестоимостиТоваров.Организация = ДД.Организация
		|		И ОстаткиСебестоимостиТоваров.РазделУчета = ДД.РазделУчета
		|		И ОстаткиСебестоимостиТоваров.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И ОстаткиСебестоимостиТоваров.ВидЗапасов = ДД.ВидЗапасов
		|		И ОстаткиСебестоимостиТоваров.Партия = ДД.Партия
		|		И ОстаткиСебестоимостиТоваров.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И ОстаткиСебестоимостиТоваров.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПриходыТоваров КАК Приходы
		|		ПО ДД.ТипЗаписи В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости))
		|		И ДД.Количество = 0
		|		И Приходы.Организация = ДД.Организация
		|		И Приходы.РазделУчета = ДД.РазделУчета
		|		И Приходы.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Приходы.ВидЗапасов = ДД.ВидЗапасов
		|		И Приходы.Партия = ДД.Партия
		|		И Приходы.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Приходы.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ПериодикаПартии
		|		ПО ПериодикаПартии.Организация = ДД.Организация
		|		И ПериодикаПартии.Документ = ДД.Партия
		|	ЛЕВОЕ СОЕДИНЕНИЕ ИсправленныеДокументыНДС КАК ИсправленныеДокументы
		|		ПО ИсправленныеДокументы.Регистратор = ДД.Регистратор
		|ГДЕ
		|	НЕ (ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		И ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости)))
		|	И (ДД.Количество <> 0
		|		ИЛИ ДД.СтоимостьБезНДС <> 0
		|		ИЛИ ДД.НДС <> 0
		|		ИЛИ ДД.НДСУпр <> 0)
		|СГРУППИРОВАТЬ ПО
		|	ДД.Номенклатура,
		|	ЕСТЬNULL(ПериодикаПартии.ДатаРегистратора, &КонецПредыдущегоПериода),
		|	ЕСТЬNULL(ИсправленныеДокументы.Регистратор, ДД.Партия),
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстПриходыСебестоимостиТоваровДляДопРасходов() // использует ПриходыТоваровНДС
	Возврат
		"ВЫБРАТЬ
		|	""ТекстПриходыСебестоимостиТоваровДляДопРасходов"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПартииДляРаспределения) КАК ТипЗаписи,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	МАКСИМУМ(ДД.Количество) КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ДД.Период КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.Партия КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ПриходыТоваровНДС КАК ДД
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ПериодикаПартии
		|		ПО ПериодикаПартии.Организация = ДД.Организация
		|		И ПериодикаПартии.Документ = ДД.Партия
		|ГДЕ
		|	ДД.Количество <> 0
		|СГРУППИРОВАТЬ ПО
		|	ДД.Номенклатура,
		|	ДД.Период,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстПриходыСебестоимостиТоваровВПути()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстПриходыСебестоимостиТоваровВПути"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПартииВПути) КАК ТипЗаписи,
		|	ВЫБОР
		|		КОГДА СУММА(ДД.Количество) < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	СУММА(ДД.Количество) КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	МИНИМУМ(ДД.Период) КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета КАК РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета КАК КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	ДД.КорПартия КАК КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.Партия КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад КАК Поступления
		|	ПО ДД.Регистратор = Поступления.Ссылка
		|ГДЕ
		|	ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути)
		|	И НЕ ДД.СлужебноеВидДвиженияПриход
		|	И ДД.Количество <> 0
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстДвиженияСебестоимостиТоваров()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДвиженияСебестоимостиТоваров"" КАК ЗапросИсточник,
		|	ДД.ТипЗаписи,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|		 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|			ТОГДА ЛОЖЬ
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|		 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|			ТОГДА ЛОЖЬ
		|			ИНАЧЕ ДД.ЭтоСторно
		|		КОНЕЦ) КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	СУММА(ДД.Знаменатель) КАК Знаменатель,
		|	СУММА(ВЫБОР
		|			КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|			 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|				ТОГДА Выпуски.Знаменатель
		|			КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|				ТОГДА Выпуски.Знаменатель
		|			КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|			 И РаботыДляДавальца.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|				ТОГДА РаботыДляДавальца.Знаменатель
		|			КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И РаботыДляДавальца.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|				ТОГДА РаботыДляДавальца.Знаменатель
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|		 И ДД.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути))
		|		 И ДД.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.Партия КОНЕЦ) КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|	СУММА(ДД.Количество) КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|	ДД.ХозяйственнаяОперация,
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ) КАК КорВидДеятельностиНДС,
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.РазделУчета
		|		ИНАЧЕ ДД.КорРазделУчета КОНЕЦ) КАК КорРазделУчета,
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ ДД.КорАналитикаУчетаНоменклатуры КОНЕЦ) КАК КорАналитикаУчетаНоменклатуры,
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.ВидЗапасов
		|		ИНАЧЕ ДД.КорВидЗапасов КОНЕЦ) КАК КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|		 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписаниеНаДругиеПартии)
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|		 И ДД.Регистратор ССЫЛКА Документ.СборкаТоваров
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.КорРазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути))
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.КорПартия КОНЕЦ) КАК КорПартия,
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.АналитикаФинансовогоУчета
		|		ИНАЧЕ ДД.КорАналитикаФинансовогоУчета КОНЕЦ) КАК КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ДвиженияСебестоимостиНДС КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСебестоимостиНДС КАК Выпуски
		|		ПО ДД.Регистратор = Выпуски.Регистратор
		|			И ДД.КорПартия = Выпуски.Партия
		|			И ДД.КорАналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
		|			И ДД.КорРазделУчета = Выпуски.РазделУчета
		|			И ДД.КорВидЗапасов = Выпуски.ВидЗапасов
		|			И ДД.КорАналитикаФинансовогоУчета = Выпуски.АналитикаФинансовогоУчета
		|			И ДД.КорВидДеятельностиНДС = Выпуски.ВидДеятельностиНДС
		|			И (ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)))
		|			И (Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСебестоимостиНДС КАК РаботыДляДавальца
		|		ПО ДД.Регистратор = РаботыДляДавальца.Регистратор
		|			И ДД.КорПартия = РаботыДляДавальца.Партия
		|			И ДД.КорАналитикаУчетаНоменклатуры = РаботыДляДавальца.КорАналитикаУчетаНоменклатуры
		|			И ДД.КорВидЗапасов = РаботыДляДавальца.КорВидЗапасов
		|			И (ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)))
		|			И (РаботыДляДавальца.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ТипЗаписи,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|		 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|			ТОГДА ЛОЖЬ
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|		 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|			ТОГДА ЛОЖЬ
		|			ИНАЧЕ ДД.ЭтоСторно
		|		КОНЕЦ),
		|	ДД.Номенклатура,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|		 И ДД.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути))
		|		 И ДД.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.Партия КОНЕЦ),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.ХозяйственнаяОперация,
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.РазделУчета
		|		ИНАЧЕ ДД.КорРазделУчета КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ ДД.КорАналитикаУчетаНоменклатуры КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.ВидЗапасов
		|		ИНАЧЕ ДД.КорВидЗапасов КОНЕЦ),
		|	ДД.КорОрганизация,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|		 И Выпуски.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписаниеНаДругиеПартии)
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|		 И ДД.Регистратор ССЫЛКА Документ.СборкаТоваров
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.КорРазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути))
		|		 И ДД.КорПартия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.КорПартия КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА РаботыДляДавальца.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|		 И РаботыДляДавальца.КорАналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА РаботыДляДавальца.АналитикаФинансовогоУчета
		|		ИНАЧЕ ДД.КорАналитикаФинансовогоУчета КОНЕЦ),
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ДокументИсточник,
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстДвиженияСебестоимостиТоваровСборка()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДвиженияСебестоимостиТоваровСборка"" КАК ЗапросИсточник,
		|	(ВЫБОР
		|		КОГДА ДД.Сторно ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеТекущегоПериода)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение) КОНЕЦ) КАК ТипЗаписи,
		|	(ВЫБОР
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	СУММА(ВЫБОР КОГДА ДД.Сторно ТОГДА -ДД.Количество
		|		ИНАЧЕ ДД.Количество КОНЕЦ) КАК Знаменатель,
		|	МАКСИМУМ(ВЫБОР КОГДА ДД.Сторно ТОГДА -Приходы.Количество
		|		ИНАЧЕ Приходы.Количество КОНЕЦ) КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.КорАналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.КорРазделУчета КАК РазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов КАК ВидЗапасов,
		|	ДД.Регистратор КАК Партия,
		|	ДД.КорАналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	СУММА(ДД.Количество) КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	(ВЫБОР
		|		КОГДА ДД.Сторно ТОГДА ДД.ДокументИсточник
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ) КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПриходыСборокТоваров КАК Приходы
		|		ПО Приходы.Организация = ДД.Организация
		|		И Приходы.РазделУчета = ДД.КорРазделУчета
		|		И Приходы.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
		|		И Приходы.Партия = ДД.КорПартия
		|		И Приходы.АналитикаФинансовогоУчета = ДД.КорАналитикаФинансовогоУчета
		|		И Приходы.ВидДеятельностиНДС = ДД.КорВидДеятельностиНДС
		|		И Приходы.Регистратор = ДД.Регистратор
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Количество <> 0
		|	И ДД.Регистратор ССЫЛКА Документ.СборкаТоваров
		|	И ДД.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписаниеНаДругиеПартии),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноСписанияНаДругиеПартии))
		|СГРУППИРОВАТЬ ПО
		|	(ВЫБОР
		|		КОГДА ДД.Сторно ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеТекущегоПериода)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение) КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ),
		|	ДД.КорАналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	(ВЫБОР
		|		КОГДА ДД.Сторно ТОГДА ДД.ДокументИсточник
		|		ИНАЧЕ ДД.Регистратор КОНЕЦ),
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстВозвратыПрошлыхПериодов()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстВозвратыПрошлыхПериодов"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов) КАК ТипЗаписи,
		|	ИСТИНА КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	-ДД.Количество КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	-ДД.Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.РазделУчета КАК КорРазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов КАК КорВидЗапасов,
		|	ДД.Организация КАК КорОрганизация,
		|	ДД.Партия КАК КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Количество <> 0
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
		|	И НЕ ДД.Сторно
		|";
КонецФункции

Функция ТекстРеализацииПрошлыхМесяцевПартииНДС() // использует ПрошлыеРеализации 
	Возврат
		"ВЫБРАТЬ
		|	""ТекстРеализацииПрошлыхМесяцевПартииНДС"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Прошлое) КАК ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	ПрошлыеСебестоимость.Количество				КАК Знаменатель,
		|	0 											КАК ЗнаменательДляИсточников,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура 	КАК Номенклатура,
		|	ДД.КорВидДеятельностиНДС 					КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	ДД.Количество,
		|	ДД.СтоимостьБезНДС,
		|	ДД.НДС,
		|	ДД.НДСУпр,
		|
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеРеализацииПартийНДС КАК Прошлые
		|		ПО ДД.Регистратор = Прошлые.ДокументИсточник
		|		И ДД.Организация = Прошлые.Организация
		|		И ДД.РазделУчета = Прошлые.РазделУчета
		|		И ДД.АналитикаУчетаНоменклатуры = Прошлые.АналитикаУчетаНоменклатуры
		|		И ДД.ВидЗапасов = Прошлые.ВидЗапасов
		|		И ДД.АналитикаФинансовогоУчета = Прошлые.АналитикаФинансовогоУчета
		|		И ДД.КорВидДеятельностиНДС = Прошлые.ВидДеятельностиНДС
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеРеализацииСебестоимость КАК ПрошлыеСебестоимость
		|		ПО ДД.Регистратор = ПрошлыеСебестоимость.Регистратор
		|		И ДД.Организация = ПрошлыеСебестоимость.Организация
		|		И ДД.РазделУчета = ПрошлыеСебестоимость.РазделУчета
		|		И ДД.АналитикаУчетаНоменклатуры = ПрошлыеСебестоимость.АналитикаУчетаНоменклатуры
		|		И ДД.ВидЗапасов = ПрошлыеСебестоимость.ВидЗапасов
		|		И ДД.АналитикаФинансовогоУчета = ПрошлыеСебестоимость.АналитикаФинансовогоУчета
		|		И ДД.КорВидДеятельностиНДС = ПрошлыеСебестоимость.ВидДеятельностиНДС
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Активность
		|	И НЕ (ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением))
		|	И НЕ ДД.Сторно
		|";
КонецФункции

Функция ТекстРеализацииПрошлыхМесяцевПартииНДС21() // использует ПрошлыеРеализации 
	Возврат
		"ВЫБРАТЬ
		|	""ТекстРеализацииПрошлыхМесяцевПартииНДС21"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Прошлое) КАК ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	Прошлые.Количество							КАК Знаменатель,
		|	0 											КАК ЗнаменательДляИсточников,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ДД.Номенклатура								КАК Номенклатура,
		|	ДД.НалогообложениеНДС						КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	Прошлые.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	Прошлые.Партия,
		|	Прошлые.АналитикаФинансовогоУчета,
		|	ДД.НалогообложениеНДС КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	ДД.Количество,
		|	ДД.СтоимостьБезНДС,
		|	ДД.НДСРегл,
		|	0 КАК НДСУпр,
		|
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОрганизаций КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеРеализацииПартийНДС КАК Прошлые
		|		ПО ДД.Регистратор = Прошлые.ДокументИсточник
		|		И ДД.Организация = Прошлые.Организация
		|		И ДД.АналитикаУчетаНоменклатуры = Прошлые.АналитикаУчетаНоменклатуры
		|		И ДД.ВидЗапасов = Прошлые.ВидЗапасов
		|		И (ДД.ДокументПоступления = Прошлые.Партия
		|			ИЛИ Прошлые.Партия = НЕОПРЕДЕЛЕНО)
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Активность
		|";
КонецФункции

Функция ТекстТаможенныеДекларацииИзменениеВидыДеятельностиНДС()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстТаможенныеДекларацииИзменениеВидыДеятельностиНДС"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости) КАК ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	0 КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ) КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|
		|	ДД.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ДД.Регистратор КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	ДД.НДСРегл КАК НДС,
		|	(ВЫБОР
		|		КОГДА &УправленческийУчетОрганизаций ТОГДА ДД.НДСУпр
		|		ИНАЧЕ 0 КОНЕЦ) КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ВидДеятельностиНДС <> ДД.КорВидДеятельностиНДС
		|	И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И (ДД.НДСРегл <> 0 ИЛИ ДД.НДСУпр <> 0)
		|	И ДД.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии))
		|	И НЕ ДД.Сторно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстТаможенныеДекларацииИзменениеВидыДеятельностиНДС"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости) КАК ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	0 КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящая)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ) КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|
		|	ДД.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ДД.Регистратор КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	ДД.НДСРегл КАК НДС,
		|	(ВЫБОР
		|		КОГДА &УправленческийУчетОрганизаций ТОГДА ДД.НДСУпр
		|		ИНАЧЕ 0 КОНЕЦ) КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	ДД.РазделУчета КАК КорРазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов КАК КорВидЗапасов,
		|	ДД.Организация КАК КорОрганизация,
		|	ДД.Партия КАК КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовАктивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ВидДеятельностиНДС <> ДД.КорВидДеятельностиНДС
		|	И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И (ДД.НДСРегл <> 0 ИЛИ ДД.НДСУпр <> 0)
		|	И ДД.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии))
		|	И НЕ ДД.Сторно
		|";
КонецФункции

Функция ТекстСторноДвиженияИсправленныхДокументовПрошлогоПериодаНДС() // использует ИсправленныеДокументыНДС 
	Возврат
		"ВЫБРАТЬ
		|	""ТекстСторноДвиженияИсправленныхДокументовПрошлогоПериодаНДС"" КАК ЗапросИсточник,
		|	(ВЫБОР
		|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода) КОНЕЦ) КАК ТипЗаписи,
		|	ИСТИНА КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	ВЫБОР КОГДА ДД.Количество = 0
		|		ТОГДА -Знаменатели.Знаменатель
		|		ИНАЧЕ -ДД.Количество
		|	КОНЕЦ 										КАК Знаменатель,
		|	0 											КАК ЗнаменательДляИсточников,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура 	КАК Номенклатура,
		|	ДД.КорВидДеятельностиНДС 					КАК НалогообложениеПартии,
		|
		|	ИсправленныеДокументы.Период,
		|	ИсправленныеДокументы.Регистратор,	
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	-ДД.Количество,
		|	-ДД.СтоимостьБезНДС,
		|	-ДД.НДС,
		|	-ДД.НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	ДД.СтатьяСписанияНДС,
		|	ДД.АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ИСТИНА КАК Сторно
		|ИЗ
		|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументыНДС КАК ИсправленныеДокументы
		|		ПО ИсправленныеДокументы.ДокументИсточник = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗнаменателиИсправленныхДокументовНДС КАК Знаменатели
		|		ПО Знаменатели.Организация = ДД.Организация
		|		И Знаменатели.РазделУчета = ДД.РазделУчета
		|		И Знаменатели.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Знаменатели.ВидЗапасов = ДД.ВидЗапасов
		|		И Знаменатели.Партия = ДД.Партия
		|		И Знаменатели.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Знаменатели.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.Активность
		|	И ДД.Период < &НачалоПериода
		|	И ДД.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|	И НЕ ДД.Сторно
		|";
КонецФункции

Функция ТекстДопРасходыСредняяДляРаспределенияРегл()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДопРасходыСредняяДляРаспределенияРегл"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыДляРаспределенияРегл) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	СУММА(ДД.ЗнаменательРегл) 					КАК Знаменатель,
		|	0											КАК ЗнаменательДляИсточников,
		|	ИСТИНА 										КАК РасчетЗавершен,
		|	
		|	НЕОПРЕДЕЛЕНО 								КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО 								КАК НалогообложениеПартии,
		|
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	0 КАК Количество,
		|	ДД.СтоимостьРегл КАК СтоимостьБезНДС,
		|	ДД.НДСРегл КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	ДД.НаправлениеДеятельности,
		|	ДД.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТДопРасходыДляРаспределения КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ЗнаменательРегл <> 0
		|	И (ДД.СтоимостьРегл <> 0 ИЛИ ДД.НДСРегл <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ВидДеятельностиНДС,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтоимостьРегл,
		|	ДД.НДСРегл,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.Подразделение
		|";
КонецФункции

Функция ТекстБазаДопРасходыСредняяРегл()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстБазаДопРасходыСредняяРегл"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.БазаДопРасходыРегл) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	ДД.Количество								КАК Знаменатель,
		|	ДД.ЗнаменательРегл							КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ 										КАК РасчетЗавершен,
		|	
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаПартий КАК Справочник.КлючиАналитикиУчетаПартий).НалогообложениеНДС 		КАК НалогообложениеПартии,
		|
		|	ДД.Период КАК Период,
		|	ДД.Регистратор КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	ВЫБОР КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	ДД.РазделУчета КАК КорРазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	(ВЫБОР
		|		КОГДА ДД.УказанДокументВАналитикеРасходов ТОГДА ДД.АналитикаРасходов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	ДД.НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТБазаРаспределенияДопРасходов КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ЗнаменательРегл <> 0
		|";
КонецФункции

Функция ТекстДопРасходыСредняяДляРаспределенияУпр()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДопРасходыСредняяДляРаспределенияУпр"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыДляРаспределенияУпр) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	СУММА(ДД.ЗнаменательУпр) 					КАК Знаменатель,
		|	0											КАК ЗнаменательДляИсточников,
		|	ИСТИНА 										КАК РасчетЗавершен,
		|	
		|	НЕОПРЕДЕЛЕНО 								КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО 								КАК НалогообложениеПартии,
		|
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	ДД.НДСУпр КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	ДД.НаправлениеДеятельности,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТДопРасходыДляРаспределения КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ЗнаменательУпр <> 0
		|	И ДД.НДСУпр <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.ВидДеятельностиНДС,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|	ДД.НДСУпр,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.Подразделение
		|";
КонецФункции

Функция ТекстБазаДопРасходыСредняяУпр()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстБазаДопРасходыСредняяУпр"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.БазаДопРасходыУпр) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	ДД.Количество								КАК Знаменатель,
		|	ДД.ЗнаменательУпр							КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ 										КАК РасчетЗавершен,
		|	
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаПартий КАК Справочник.КлючиАналитикиУчетаПартий).НалогообложениеНДС 		КАК НалогообложениеПартии,
		|
		|	ДД.Период КАК Период,
		|	ДД.Регистратор КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|
		|	0 КАК Количество,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК НДС,
		|	0 КАК НДСУпр,
		|
		|	ВЫБОР КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	ДД.РазделУчета КАК КорРазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов КАК КорВидЗапасов,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	(ВЫБОР
		|		КОГДА ДД.УказанДокументВАналитикеРасходов ТОГДА ДД.АналитикаРасходов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	ДД.НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТБазаРаспределенияДопРасходов КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
		|	И ДД.ЗнаменательУпр <> 0
		|";
КонецФункции

Функция ТекстДанныеДляДетализацииПартийТоваровДляНДСиУСН()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	""ТекстДанныеДляДетализацииПартийТоваровДляНДСиУСН"" КАК ЗапросИсточник,
		|	ДД.ТипЗаписи,
		|	ЛОЖЬ КАК ЭтоСторно,
		|	0 КАК Приоритет,
		|	0 КАК Знаменатель,
		|	0 КАК ЗнаменательДляИсточников,
		|	ДД.РасчетЗавершен,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	ДД.НалогообложениеПартии,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ДокументПоступления,
		|
		|	ДД.Количество,
		|	ДД.СтоимостьБезНДС,
		|	ВЫБОР КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|	 И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		ТОГДА 0
		|		ИНАЧЕ ДД.НДС
		|	КОНЕЦ КАК НДС,
		|	ВЫБОР КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|	 И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		ТОГДА 0
		|		ИНАЧЕ ДД.НДСУпр
		|	КОНЕЦ КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	ДД.ДокументИсточник,
		|	ДД.СтатьяСписанияНДС,
		|	ДД.АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Сторно
		|ИЗ
		|	ВтДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|ГДЕ
		|	ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|";
	Возврат ТекстЗапроса;
	 
КонецФункции

// Заполнение расчетной партии

Процедура ЗаполнитьРасчетнуюПартиюНДС(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход)
	
	Если Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Перемещение
	 И Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартияСгруппированная
	 И ТипЗнч(Расход.Регистратор) <> Тип("ДокументСсылка.СборкаТоваров") Тогда
		Возврат; // для производственных документов вместо Перемещения используется Выпуск
	КонецЕсли;
	
	СуммовыеРесурсы = Новый Структура("СтоимостьБезНДС, НДС, НДСУпр");
	
	// Заполняем расчетную партию по расходной партии-основании
	ЗаполнитьЗначенияСвойств(РасчетнаяПартия, Расход);
	
	//	Заполняем партионную идентификацию в расчетной партии
	ЗаполнитьЗначенияСвойств(РасчетнаяПартия, Приход, "ДокументПоступления, АналитикаУчетаПартий, НалогообложениеПартии");
	
	Если НЕ ЗначениеЗаполнено(РасчетнаяПартия.ДокументПоступления)
	 И (Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияРегл
	   ИЛИ Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияУпр) Тогда
	   
		ДопустимыеТипы = Метаданные.РегистрыНакопления.ПартииПрочихРасходов.Измерения.ДокументПоступленияРасходов.Тип;
		РасчетнаяПартия.ДокументИсточник = ДопустимыеТипы.ПривестиЗначение(Приход.Регистратор); // для формирования движений по партиям прочих расходов по исходному документу поступления
		
	Иначе
		
		РасчетнаяПартия.ДокументИсточник = Неопределено;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РасчетнаяПартия.Партия) Тогда
		РасчетнаяПартия.Партия = Приход.Партия;
	КонецЕсли;
	
	// Заменим старые аналитики учета партий на новые.
	Если ПараметрыРасчета.РаспределениеПартий.ДополнительныеСвойства.Свойство("АналитикиУчетаПартий") Тогда
		
		АналитикиУчетаПартий = ПараметрыРасчета.РаспределениеПартий.ДополнительныеСвойства.АналитикиУчетаПартий; // Соответствие
		НоваяАналитикаУчетаПартий = АналитикиУчетаПартий.Получить(РасчетнаяПартия.АналитикаУчетаПартий);
		
		Если ЗначениеЗаполнено(НоваяАналитикаУчетаПартий) Тогда
			РасчетнаяПартия.АналитикаУчетаПартий = НоваяАналитикаУчетаПартий;
		КонецЕсли;
		
	КонецЕсли;
	
	КорректироватьБазуВРасходе = Ложь;
	
	// Расчетная партия заполняется на наибольшее общее вычитаемое
	Если ((РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Перемещение
	 	  И ТипЗнч(РасчетнаяПартия.Регистратор) = Тип("ДокументСсылка.СборкаТоваров"))
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск) Тогда
		КоличествоСписания = Мин(Расход.Количество, Приход.Знаменатель);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = ?(Приход.Знаменатель <> 0, КоличествоСписания / Приход.Знаменатель, 0);
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Выпуск Тогда
		КоличествоСписания = Мин(Расход.Знаменатель, Приход.ЗнаменательДляИсточников);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = ?(Приход.ЗнаменательДляИсточников <> 0, КоличествоСписания / Приход.ЗнаменательДляИсточников, 0);
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартияСгруппированная
	 И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Перемещение
	 И ТипЗнч(Приход.Регистратор) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		КоличествоСписания = Мин(Расход.Знаменатель, Приход.ЗнаменательДляИсточников);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = 1;
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартияСгруппированная Тогда
		КоличествоСписания = Мин(Расход.Знаменатель, Приход.Знаменатель);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = 1;
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр Тогда
		КоличествоСписания = Мин(Расход.ЗнаменательДляИсточников, Приход.Знаменатель);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = ?(Приход.Знаменатель <> 0, КоличествоСписания / Приход.Знаменатель, 0);
	ИначеЕсли Приход.Количество <> 0 Тогда
		КорректироватьБазуВРасходе = Истина;
		КоличествоСписания = Мин(Расход.Количество, Приход.Количество);
		ПриходБазис = ?(Приход.Количество <> 0, КоличествоСписания / Приход.Количество, 0);
		ЗнаменательСписания = Мин(Расход.Знаменатель, ПриходБазис * Приход.Знаменатель);
	Иначе
		КоличествоСписания = Мин(Расход.Знаменатель, Приход.Знаменатель);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = ?(Приход.Знаменатель <> 0, КоличествоСписания / Приход.Знаменатель, 0);
	КонецЕсли;
	Если ПриходБазис = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем показатели расчетной партии
	Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Выпуск Тогда
		РасчетнаяПартия.Количество = 0;
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Перемещение
	 И ТипЗнч(РасчетнаяПартия.Регистратор) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		РасчетнаяПартия.Количество = 0;
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск Тогда
		РасчетнаяПартия.Количество = Окр(ПриходБазис * Приход.Количество, 3);
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартияСгруппированная Тогда
		РасчетнаяПартия.Количество = Приход.Количество;
	Иначе
		РасчетнаяПартия.Количество = Мин(Расход.Количество, Приход.Количество);
	КонецЕсли;
	РасчетнаяПартия.Знаменатель = 0;
	
	Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартияСгруппированная
	 И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Перемещение
	 И ТипЗнч(Приход.Регистратор) = Тип("ДокументСсылка.СборкаТоваров") Тогда
	 	РасчетнаяПартия.Знаменатель = Приход.ЗнаменательДляИсточников;
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартияСгруппированная Тогда
		РасчетнаяПартия.Знаменатель = Приход.Знаменатель;
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр Тогда
		РасчетнаяПартия.Знаменатель = Расход.Знаменатель;
	Иначе
		РасчетнаяПартия.Знаменатель = 0;
	КонецЕсли;
	
	Для Каждого ИмяРесурса Из СуммовыеРесурсы Цикл
		РасчетнаяПартия[ИмяРесурса.Ключ] = Окр(ПриходБазис * Приход[ИмяРесурса.Ключ], 2);
	КонецЦикла;
	
	// Корректируем базу расчета в приходе
	Если НЕ (Приход.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет
		И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Потребление)
	И НЕ (Приход.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
		И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Потребление)
	И НЕ (Приход.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад
		И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.СторноВозвратНаДругойСклад
		И Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ВозвратНаДругойСклад)
	И НЕ (Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии
		И Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Перемещение)
	И НЕ (Приход.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства
		И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Распределение) Тогда
	 
	 	Если НЕ Приход.ЭтоСторно И РасчетнаяПартия.ЭтоСторно
		 И РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Потребление Тогда
			Знак = -1;
		Иначе
			Знак = 1;
		КонецЕсли;
	 
	    Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Выпуск Тогда
			Приход.Знаменатель = Приход.Знаменатель - Знак * Окр(ПриходБазис * Приход.Знаменатель, 3);
			Приход.Количество = Приход.Количество - Знак * РасчетнаяПартия.Количество;
			Приход.ЗнаменательДляИсточников = Приход.ЗнаменательДляИсточников - Знак * ЗнаменательСписания;
		ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл
		 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр Тогда
			Приход.Знаменатель = Приход.Знаменатель - Знак * ЗнаменательСписания;
			Приход.ЗнаменательДляИсточников = Приход.ЗнаменательДляИсточников - Знак * ЗнаменательСписания;
		Иначе
			Приход.Знаменатель = Приход.Знаменатель - Знак * ЗнаменательСписания;
			Приход.Количество = Приход.Количество - Знак * РасчетнаяПартия.Количество;
		КонецЕсли;
		
		Для Каждого ИмяРесурса Из СуммовыеРесурсы Цикл
			Приход[ИмяРесурса.Ключ] = Приход[ИмяРесурса.Ключ] - Знак * РасчетнаяПартия[ИмяРесурса.Ключ];
		КонецЦикла;
	 	
	КонецЕсли;
	
	// Корректируем базу расчета в расходе
	Если КорректироватьБазуВРасходе Тогда
		
		Расход.Количество = Расход.Количество - РасчетнаяПартия.Количество;
		
		Для Каждого ИмяРесурса Из СуммовыеРесурсы Цикл
			Расход[ИмяРесурса.Ключ] = Расход[ИмяРесурса.Ключ] - РасчетнаяПартия[ИмяРесурса.Ключ];
		КонецЦикла;
		
	КонецЕсли;
	
	Если Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ДопРасходы
	 И Приход.ВидДеятельностиНДС = Перечисления.ТипыНалогообложенияНДС.ОпределяетсяРаспределением Тогда
		РасчетнаяПартия.НДС = 0;
		РасчетнаяПартия.НДСУпр = 0;
	КонецЕсли;
	 
	ЗаполнитьСтатьюИАналитикуСписанияНДС(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход);
	
	Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ОстатокДляРаспределения
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартииВПути
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартииДляРаспределения Тогда
		РасчетнаяПартия.Период = Приход.Период;
		РасчетнаяПартия.Регистратор = Приход.Регистратор;
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр Тогда
		РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ДопРасходы;
		РасчетнаяПартия.ЗнаменательДляИсточников = 0;
		РасчетнаяПартия.Подразделение = Приход.Подразделение;
	 	РасчетнаяПартия.КорВидДеятельностиНДС = Приход.КорВидДеятельностиНДС;
	КонецЕсли;
	
	// По результатам партионной идентификации определяем завершенность расчета
	Если РасчетнаяПартия.Количество = 0
	 И РасчетнаяПартия.СтоимостьБезНДС = 0
	 И РасчетнаяПартия.НДС = 0
	 И РасчетнаяПартия.НДСУпр = 0 Тогда
		РасчетнаяПартия.РасчетЗавершен = Ложь;
		
	ИначеЕсли ТипЗнч(Приход.Регистратор) = Тип("ДокументСсылка.ВводОстатков") 
		Или ТипЗнч(Приход.Регистратор) = Тип("ДокументСсылка.ВводОстатковТоваров") Тогда
		// Для документов ВводОстатков с реквизитом ВводОстатков22 = Ложь в таблице Данные
		// установлен признак РасчетЗавершен = Ложь для того, чтобы движения этого документа не записывались в ИБ,
		// т.к. они уже сформированы самим документом.
		РасчетнаяПартия.РасчетЗавершен = Истина;
	Иначе
		РасчетнаяПартия.РасчетЗавершен = Приход.РасчетЗавершен;
	КонецЕсли;
	
	Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ОстатокДляРаспределения
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартииДляРаспределения Тогда
		
		РасчетнаяПартияРасход = РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьРасчетнуюПартию(ПараметрыРасчета, РасчетнаяПартия, Ложь);
		РасчетнаяПартияРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
		РасчетнаяПартияРасход.Партия = Неопределено;
		
	ИначеЕсли РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ПартииВПути Тогда
		
		РасчетнаяПартияРасход = РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьРасчетнуюПартию(ПараметрыРасчета, Приход, Ложь);
		РасчетнаяПартияРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		Для Каждого ИмяРесурса Из СуммовыеРесурсы Цикл
			РасчетнаяПартияРасход[ИмяРесурса.Ключ] = РасчетнаяПартия[ИмяРесурса.Ключ];
		КонецЦикла;
		
		РасчетнаяПартияРасход.КорАналитикаУчетаНоменклатуры = РасчетнаяПартия.АналитикаУчетаНоменклатуры;
		РасчетнаяПартияРасход.КорВидЗапасов 				= РасчетнаяПартия.ВидЗапасов;
		РасчетнаяПартияРасход.КорПартия 					= РасчетнаяПартия.Партия;
		РасчетнаяПартияРасход.КорРазделУчета 				= РасчетнаяПартия.РазделУчета;
		РасчетнаяПартияРасход.КорВидДеятельностиНДС 		= РасчетнаяПартия.ВидДеятельностиНДС;
		РасчетнаяПартияРасход.КорАналитикаФинансовогоУчета 	= РасчетнаяПартия.АналитикаФинансовогоУчета;
		
	ИначеЕсли (Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл
	 ИЛИ Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр)
	 И ЗначениеЗаполнено(Расход.ХозяйственнаяОперация) Тогда
	 
		РасчетнаяПартияРасход = РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьРасчетнуюПартию(ПараметрыРасчета, РасчетнаяПартия, Ложь);
		РасчетнаяПартияРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтатьюИАналитикуСписанияНДС(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход)
	
	Период = НачалоМесяца(РасчетнаяПартия.Период);
	
	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитикПовтИсп.ДействующиеПараметрыНалоговУчетныхПолитик("НастройкиУчетаНДС", РасчетнаяПартия.Организация, НачалоМесяца(Период)); 
	
	Если ПараметрыУчетнойПолитики <> Неопределено
	 И ПараметрыУчетнойПолитики.ВариантУчетаНДСПриИзмененииВидаДеятельности = Перечисления.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимость Тогда
		Возврат;
	КонецЕсли;
	
	Если УчетНДСУП.ВозможноСписаниеНДС(РасчетнаяПартия.ВидДеятельностиНДС, РасчетнаяПартия.КорВидДеятельностиНДС)
	 ИЛИ (РасчетнаяПартия.ВидДвижения = ВидДвиженияНакопления.Приход
	  И УчетНДСУП.ВозможноСписаниеНДС(Приход.ВидДеятельностиНДС, Приход.КорВидДеятельностиНДС)) Тогда
	
		Если ПараметрыУчетнойПолитики <> Неопределено
		 И ПараметрыУчетнойПолитики.ВариантУчетаНДСПриИзмененииВидаДеятельности = Перечисления.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимостьИлиРасходыВЗависимостиОтПериода Тогда
			
			Если ЗначениеЗаполнено(РасчетнаяПартия.ДокументПоступления) Тогда
				ДатаПартии = НачалоМесяца(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РасчетнаяПартия.ДокументПоступления, "Дата"));
			Иначе
				ДатаПартии = Дата(1,1,1);
			КонецЕсли;
			
			Если ДатаПартии = Период Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыУчетнойПолитики <> Неопределено
		 И УчетНДСУП.ВозможноСписаниеНДС(РасчетнаяПартия.ВидДеятельностиНДС, РасчетнаяПартия.КорВидДеятельностиНДС) Тогда
			
			Если РасчетнаяПартия.КорВидДеятельностиНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС Тогда
				РасчетнаяПартия.СтатьяСписанияНДС 	 = ПараметрыУчетнойПолитики.СтатьяРасходовНеНДС;
				РасчетнаяПартия.АналитикаСписанияНДС = ПараметрыУчетнойПолитики.АналитикаРасходовНеНДС;
			Иначе
				РасчетнаяПартия.СтатьяСписанияНДС 	 = ПараметрыУчетнойПолитики.СтатьяРасходовЕНВД;
				РасчетнаяПартия.АналитикаСписанияНДС = ПараметрыУчетнойПолитики.АналитикаРасходовЕНВД;
			КонецЕсли;
			
		Иначе
			
			РасчетнаяПартия.НДС    = 0;
			РасчетнаяПартия.НДСУпр = 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

#Область ПроцедурыЭтапа_РасчетПартийНДС2_4

// Формирует временную таблицу ВТДвиженияВводаОстатков.
//
Процедура ИнициализироватьТаблицыДляДокументовВводаОстатков(ПараметрыРасчета)
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.ВидЗапасов,
	|	Себестоимость.РазделУчета,
	|	Т.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаДокументаПоступления,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовАктивов,
	|	0 КАК Количество,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК НДС,
	|	0 КАК СтоимостьБезНДСУпр,
	|	0 КАК НДСУпр
	|ПОМЕСТИТЬ ВТДвиженияВводаОстатков0
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАк Себестоимость
	|		ПО ЛОЖЬ
	|;
	|ВЫБРАТЬ
	|	Т.Дата,
	|	Т.Ссылка
	|ИЗ
	|	Документ.ВводОстатковТоваров КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Т.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковСобственныхТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковТоваровПереданныхНаКомиссию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковВозвратнойТарыПринятойОтПоставщиков),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхВПроизводство),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхПереработчикам),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхПереработчикам2_5)
	|		)
	|	И Т.Проведен
	|
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Дата,
	|	Т.Ссылка
	|ИЗ
	|	Документ.ВводОстатков КАК Т
	|ГДЕ
	|	Т.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Т.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковСобственныхТоваров),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковТоваровПереданныхНаКомиссию),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковВозвратнойТарыПринятойОтПоставщиков),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхВПроизводство),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхПереработчикам)
	|		)
	|	И Т.Проведен
	//-- Локализация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИменаВременныхТаблиц = "ВТДвиженияВводаОстатков0";
	НомерДокумента = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НомерДокумента = НомерДокумента + 1;
		ИмяТекущейВТ = "ВТДвиженияВводаОстатков" + Формат(НомерДокумента, "ЧГ=");
		ИменаВременныхТаблиц = ИменаВременныхТаблиц + ", " + ИмяТекущейВТ;
		
		ТекстыЗапроса = Новый СписокЗначений;
		ЗапросДокумента = Новый Запрос;
		ЗапросДокумента.УстановитьПараметр(РасчетСебестоимостиПрикладныеАлгоритмы.ИмяСлужебногоДополнительногоСвойстваОбъекта(), Истина);
		ЗапросДокумента.УстановитьПараметр("ИмяВременнойТаблицыПартийНДС2_4", ИмяТекущейВТ);
		
		//++ Локализация
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ВводОстатков") Тогда
			Документы.ВводОстатков.ЗаполнитьПараметрыИнициализации(ЗапросДокумента, Выборка.Ссылка);
			Документы.ВводОстатков.ТекстЗапросаТаблицаДетализацияПартийТоваровДляНДСиУСН2_4(ЗапросДокумента, ТекстыЗапроса, "");
		Иначе
		//-- Локализация
			Документы.ВводОстатковТоваров.ЗаполнитьПараметрыИнициализации(ЗапросДокумента, Выборка.Ссылка);
			Документы.ВводОстатковТоваров.ТекстЗапросаТаблицаДетализацияПартийТоваровДляНДСиУСН2_4(ЗапросДокумента, ТекстыЗапроса, "");
		//++ Локализация
		КонецЕсли;
		//-- Локализация
		
		ЗапросДокумента.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
		ЗапросДокумента.Текст = СтрСоединить(ТекстыЗапроса.ВыгрузитьЗначения(), Символы.ПС + ";" + Символы.ПС);
		
		ЗапросДокумента.Выполнить();
		
		НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
			ПараметрыРасчета,
			СуществующиеВТ + ", " + ИменаВременныхТаблиц);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
		
	КонецЦикла;
	
	ИменаКолонок = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыгрузитьВременнуюТаблицу(ПараметрыРасчета, "ВТДвиженияВводаОстатков0"));
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ОбъединитьВременныеТаблицы(
		ПараметрыРасчета,
		ИменаВременныхТаблиц,
		"ВТДвиженияВводаОстатков",
		ИменаКолонок,
		"Количество, СтоимостьБезНДС, НДС, СтоимостьБезНДСУпр, НДСУпр",
		"ДокументПоступления",
		Истина);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
		ПараметрыРасчета,
		СуществующиеВТ + ", ВТДвиженияВводаОстатков");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТДвиженияВводаОстатков") = 0 Тогда
		
		// Добавим поле ЭтоПеременныеДопРасходы в ВТДвиженияВводаОстатков
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ДокументПоступления,
		|	Т.АналитикаУчетаДокументаПоступления,
		|	Т.Организация,
		|	Т.РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.ВидДеятельностиНДС,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.СтатьяРасходовАктивов,
		|	Т.СтоимостьБезНДСУпр,
		|	Т.НДСУпр,
		|	Т.СтоимостьБезНДС,
		|	Т.НДС,
		|	Т.Количество,
		|	ЛОЖЬ КАК ЭтоПеременныеДопРасходы
		|ПОМЕСТИТЬ ВТДвиженияВводаОстатковНовые
		|ИЗ
		|	ВТДвиженияВводаОстатков КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТДвиженияВводаОстатков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТДвиженияВводаОстатков
		|ИЗ
		|	ВТДвиженияВводаОстатковНовые КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТДвиженияВводаОстатковНовые
		|";
		
		Запрос.Выполнить();
		
		Возврат;
		
	КонецЕсли;
	
	// Если движения ввода остатков по аналитикам из ВТАналитикиВводаОстатков встречаются больше одного раза в текущем периоде или были в прошлых периодах,
	// то такие движения надо помещать в периодический регистр партий.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	СУММА(1) КАК КоличествоЗаписей
	|ПОМЕСТИТЬ ВТАналитикиВводаОстатков
	|ИЗ
	|	ВТДвиженияВводаОстатков КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ВТПартииПеременные
	|ИЗ
	|(ВЫБРАТЬ
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаДокументаПоступления,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.СтоимостьБезНДСРегл,
	|	Т.НДСРегл,
	|	Т.СтоимостьБезНДСУпр,
	|	Т.НДСУпр
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиВводаОстатков КАК Отбор
	|		ПО Т.ДокументПоступления = Отбор.ДокументПоступления
	|		И Т.АналитикаУчетаПартийДокументаПоступления = Отбор.АналитикаУчетаДокументаПоступления
	|		И Т.Партия = Отбор.Партия
	|		И Т.АналитикаУчетаПартий = Отбор.АналитикаУчетаПартий
	|		И Т.Организация = Отбор.Организация
	|		И Т.ВидЗапасов = Отбор.ВидЗапасов
	|		И Т.Номенклатура = Отбор.Номенклатура
	|		И Т.Характеристика = Отбор.Характеристика
	|ГДЕ
	|	Т.ПериодРегистрации < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаДокументаПоступления,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Т.СтоимостьБезНДСРегл,
	|	Т.НДСРегл,
	|	Т.СтоимостьБезНДСУпр,
	|	Т.НДСУпр
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиВводаОстатков КАК Отбор
	|		ПО Т.ДокументПоступления = Отбор.ДокументПоступления
	|		И Т.АналитикаУчетаПартийДокументаПоступления = Отбор.АналитикаУчетаДокументаПоступления
	|		И Т.Партия = Отбор.Партия
	|		И Т.АналитикаУчетаПартий = Отбор.АналитикаУчетаПартий
	|		И Т.Организация = Отбор.Организация
	|		И Т.ВидЗапасов = Отбор.ВидЗапасов
	|		И Т.АналитикаУчетаНоменклатуры.Номенклатура = Отбор.Номенклатура
	|		И Т.АналитикаУчетаНоменклатуры.Характеристика = Отбор.Характеристика
	|ГДЕ
	|	Т.Период < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТАналитикиВводаОстатков КАК Т
	|ГДЕ
	|	Т.КоличествоЗаписей > 1
	|) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т.ДокументПоступления) КАК КоличествоДокументов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т.АналитикаУчетаДокументаПоступления) КАК КоличествоАналитик
	|ПОМЕСТИТЬ ВТДокументыПоступленияПеременные
	|ИЗ
	|	ВТАналитикиВводаОстатков КАК Т
	|ГДЕ
	|	Т.КоличествоЗаписей = 1
	|СГРУППИРОВАТЬ ПО
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.Организация,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т.ДокументПоступления) > 1
	|	ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т.АналитикаУчетаДокументаПоступления) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.СтатьяРасходовАктивов,
	|	Т.СтоимостьБезНДСУпр - Т.Количество * ЕСТЬNULL(Партии.СтоимостьБезНДСУпр, 0) КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр - Т.Количество * ЕСТЬNULL(Партии.НДСУпр, 0) КАК НДСУпр,
	|	Т.СтоимостьБезНДС - Т.Количество * ЕСТЬNULL(Партии.СтоимостьБезНДСРегл, 0) КАК СтоимостьБезНДС,
	|	Т.НДС - Т.Количество * ЕСТЬNULL(Партии.НДСРегл, 0) КАК НДС,
	|	Т.Количество,
	|	ВЫБОР КОГДА Партии.ДокументПоступления ЕСТЬ NULL
	|	  И ДокументыПоступления.Партия ЕСТЬ NULL
	|		ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоПеременныеДопРасходы
	|ПОМЕСТИТЬ ВТДвиженияВводаОстатковНовые
	|ИЗ
	|	ВТДвиженияВводаОстатков КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПартииПеременные КАК Партии
	|		ПО Т.ДокументПоступления = Партии.ДокументПоступления
	|		И Т.АналитикаУчетаДокументаПоступления = Партии.АналитикаУчетаДокументаПоступления
	|		И Т.Партия = Партии.Партия
	|		И Т.АналитикаУчетаПартий = Партии.АналитикаУчетаПартий
	|		И Т.Организация = Партии.Организация
	|		И Т.ВидЗапасов = Партии.ВидЗапасов
	|		И Т.АналитикаУчетаНоменклатуры.Номенклатура = Партии.Номенклатура
	|		И Т.АналитикаУчетаНоменклатуры.Характеристика = Партии.Характеристика
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыПоступленияПеременные КАК ДокументыПоступления
	|		ПО Т.Партия = ДокументыПоступления.Партия
	|		И Т.АналитикаУчетаПартий = ДокументыПоступления.АналитикаУчетаПартий
	|		И Т.Организация = ДокументыПоступления.Организация
	|		И Т.ВидЗапасов = ДокументыПоступления.ВидЗапасов
	|		И Т.АналитикаУчетаНоменклатуры.Номенклатура = ДокументыПоступления.Номенклатура
	|		И Т.АналитикаУчетаНоменклатуры.Характеристика = ДокументыПоступления.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвиженияВводаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаДокументаПоступления,
	|	Т.Организация,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.СтатьяРасходовАктивов,
	|	Т.СтоимостьБезНДСУпр,
	|	Т.НДСУпр,
	|	Т.СтоимостьБезНДС,
	|	Т.НДС,
	|	Т.Количество,
	|	Т.ЭтоПеременныеДопРасходы
	|ПОМЕСТИТЬ ВТДвиженияВводаОстатков
	|ИЗ
	|	ВТДвиженияВводаОстатковНовые КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасходовАктивов
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
		ПараметрыРасчета,
		СуществующиеВТ + ", ВТДвиженияВводаОстатков");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

Процедура РаспределитьНДСПоСебестоимости(ПараметрыРасчета, ИмяТаблицыДанных)
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ПодготовкаДанных
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ВтСвязиУзловКорректировкиСебестоимостиСоСписаниемНДС") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.НомерУзла,
		|	ВЫБОР КОГДА Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИсточникСписанияНДС,
		|	ВЫБОР КОГДА Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПриемникСписанияНДС,
		|	ВЫБОР КОГДА ЛОЖЬ ТОГДА ЛОЖЬ // для удобства расстановки тегов
		//++ Локализация
		|		КОГДА УчетнаяПолитика.ВариантУчетаНДСПриИзмененииВидаДеятельности = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимостьИлиРасходыВЗависимостиОтПериода)
		|			ТОГДА ИСТИНА
		//-- Локализация
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СписаниеНДСЗависитОтПериодаДокументаПоступления
		|ПОМЕСТИТЬ ВтУзлыКорректировкиСебестоимостиДляСписанияНДС
		|ИЗ
		|	ВтУзлыКорректировкиСебестоимости КАК Т
		//++ Локализация
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНастройкиУчетаНДС КАК УчетнаяПолитика
		|		ПО Т.Организация = УчетнаяПолитика.Организация
		//-- Локализация
		|ГДЕ
		|	ЛОЖЬ
		//++ Локализация
		|	ИЛИ УчетнаяПолитика.ВариантУчетаНДСПриИзмененииВидаДеятельности <> ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимость)
		//-- Локализация
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.НомерУзлаИсточник КАК НомерУзлаИсточник,
		|	Т.НомерУзлаПриемник КАК НомерУзлаПриемник,
		|	Т.Вес,
		|	ВЫБОР КОГДА ЕСТЬNULL(УзлыИсточники.ИсточникСписанияНДС, ЛОЖЬ)
		|	  И ЕСТЬNULL(УзлыПриемники.ПриемникСписанияНДС, ЛОЖЬ)
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СменаВидаДеятельностиНДС,
		|	ЕСТЬNULL(УзлыИсточники.СписаниеНДСЗависитОтПериодаДокументаПоступления, ЛОЖЬ) КАК СписаниеНДСЗависитОтПериодаДокументаПоступления
		|ПОМЕСТИТЬ ВтСвязиУзловКорректировкиСебестоимостиСоСписаниемНДС
		|ИЗ
		|	ВтСвязиУзловКорректировкиСебестоимости КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимостиДляСписанияНДС КАК УзлыИсточники
		|		ПО УзлыИсточники.НомерУзла = Т.НомерУзлаИсточник
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимостиДляСписанияНДС КАК УзлыПриемники
		|		ПО УзлыПриемники.НомерУзла = Т.НомерУзлаПриемник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзлаИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.НомерУзлаИсточник КАК НомерУзлаИсточник,
		|	Т.НомерУзлаПриемник КАК НомерУзлаПриемник
		|ПОМЕСТИТЬ ВтСвязиУзловКорректировкиСебестоимостиСоСменойПартии
		|ИЗ
		|	ВтСвязиУзловКорректировкиСебестоимости КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимости КАК УзлыИсточники
		|		ПО УзлыИсточники.НомерУзла = Т.НомерУзлаИсточник
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимости КАК УзлыПриемники
		|		ПО УзлыПриемники.НомерУзла = Т.НомерУзлаПриемник
		|ГДЕ
		|	УзлыИсточники.Партия <> УзлыПриемники.Партия
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзлаИсточник
		|";
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА 
	|ИЗ
	|	ВтУзлыКорректировкиСебестоимостиДляСписанияНДС КАК Т
	|ГДЕ
	|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления";
	
	ВозможноСписаниеНДСПоПериодам = НЕ Запрос.Выполнить().Пустой();
	Запрос.УстановитьПараметр("ВозможноСписаниеНДСПоПериодам", ВозможноСписаниеНДСПоПериодам);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.ЭтоДопРасходы,
	|	Т.ЭтоПеременныеДопРасходы,
	|	ВЫБОР КОГДА НЕ &ВозможноСписаниеНДСПоПериодам // в этом случае период документа не важен - для оптимальной группировки узлов НДС примем для всех узлов значение ИСТИНА
	|	  ИЛИ НАЧАЛОПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)), МЕСЯЦ) = &НачалоПериода
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДокументПоступленияВТекущемПериоде
	|ПОМЕСТИТЬ ДанныеДляНумерации
	|ИЗ
	|	ИмяТаблицыДанных КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДанныеПервичныхДокументов.Организация = Т.Организация
	|		И ДанныеПервичныхДокументов.Документ = Т.ДокументПоступления
	|ГДЕ
	|	(Т.СтоимостьСНДС <> 0
	|		ИЛИ Т.СтоимостьБезНДС <> 0
	|		ИЛИ Т.СтоимостьБезНДСРегл <> 0
	|		ИЛИ Т.НДСРегл <> 0
	|		ИЛИ Т.СтоимостьБезНДСУпр <> 0
	|		ИЛИ Т.НДСУпр <> 0)
	|	И Т.Партия <> НЕОПРЕДЕЛЕНО
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.ЭтоДопРасходы,
	|	Т.ЭтоПеременныеДопРасходы,
	|	ВЫБОР КОГДА НЕ &ВозможноСписаниеНДСПоПериодам
	|	  ИЛИ НАЧАЛОПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)), МЕСЯЦ) = &НачалоПериода
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыДанных", ИмяТаблицыДанных);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	КоличествоПартийНДС = РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ДанныеДляНумерации");
	
	Если КоличествоПартийНДС = 0 Тогда
		
		// Уничтожим ненужные временные таблицы.
		НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
			ПараметрыРасчета,
			СуществующиеВТ);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
		Возврат;
		
	КонецЕсли;
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатурыДокументаПоступления", // разделитель
		"", // ресурсы
		"ДокументПоступления, АналитикаУчетаПартийДокументаПоступления, АналитикаУчетаНоменклатурыДокументаПоступления, СтатьяРасходов", // порядок
		"НомерУзла"); 
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ДанныеДляНумерации",
		"ВТУзлыПартийНДС");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Узлы.НомерУзла 	  КАК НомерУзлаСебестоимости,
	|	УзлыНДС.НомерУзла КАК НомерУзлаНДС,
	|
	|	ЕСТЬNULL(УзлыСписанияНДС.СписаниеНДСЗависитОтПериодаДокументаПоступления, ЛОЖЬ) КАК СписаниеНДСЗависитОтПериодаДокументаПоступления,
	|	УзлыНДС.ДокументПоступленияВТекущемПериоде,
	|
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.ЭтоДопРасходы,
	|	Т.ЭтоПеременныеДопРасходы,
	|
	|	Т.ЗнакСтоимостьСНДС,
	|	Т.ЗнакСтоимостьБезНДС,
	|	Т.ЗнакСтоимостьБезНДСРегл,
	|	Т.ЗнакНДСРегл,
	|	Т.ЗнакСтоимостьБезНДСУпр,
	|	Т.ЗнакНДСУпр,
	|	Т.СтоимостьСНДС КАК СтоимостьСНДС,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл КАК СтоимостьБезНДСРегл,
	|	Т.НДСРегл КАК НДСРегл,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр
	|ПОМЕСТИТЬ ВТИсходныеУзлыСебестоимостиИНДСПредварительная
	|ИЗ
	|	ИмяТаблицыДанных КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимости КАК Узлы
	|		ПО Узлы.Организация = Т.Организация
	|		И Узлы.РазделУчета = Т.РазделУчета
	|		И Узлы.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры
	|		И Узлы.ВидЗапасов = Т.ВидЗапасов
	|		И Узлы.Партия = Т.Партия
	|		И Узлы.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
	|		И Узлы.ВидДеятельностиНДС = Т.ВидДеятельностиНДС
	|		И Узлы.АналитикаФинансовогоУчета = Т.АналитикаФинансовогоУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимостиДляСписанияНДС КАК УзлыСписанияНДС
	|		ПО Узлы.НомерУзла = УзлыСписанияНДС.НомерУзла
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУзлыПартийНДС КАК УзлыНДС
	|		ПО УзлыНДС.ДокументПоступления = Т.ДокументПоступления
	|		И УзлыНДС.АналитикаУчетаПартийДокументаПоступления = Т.АналитикаУчетаПартийДокументаПоступления
	|		И УзлыНДС.АналитикаУчетаНоменклатурыДокументаПоступления = Т.АналитикаУчетаНоменклатурыДокументаПоступления
	|		И УзлыНДС.СтатьяРасходов = Т.СтатьяРасходов
	|		И УзлыНДС.АналитикаРасходов = Т.АналитикаРасходов
	|		И УзлыНДС.ЗатратыПредыдущихПеределов = Т.ЗатратыПредыдущихПеределов
	|		И УзлыНДС.ЭтоОстаткиПостатейныеПеременные = Т.ЭтоОстаткиПостатейныеПеременные
	|		И УзлыНДС.ЭтоОстаткиПостатейныеПостоянные = Т.ЭтоОстаткиПостатейныеПостоянные
	|		И УзлыНДС.ЭтоДопРасходы = Т.ЭтоДопРасходы
	|		И УзлыНДС.ЭтоПеременныеДопРасходы = Т.ЭтоПеременныеДопРасходы
	|ГДЕ
	|	Т.СтоимостьСНДС <> 0
	|	ИЛИ Т.СтоимостьБезНДС <> 0
	|	ИЛИ Т.СтоимостьБезНДСРегл <> 0
	|	ИЛИ Т.НДСРегл <> 0
	|	ИЛИ Т.СтоимостьБезНДСУпр <> 0
	|	ИЛИ Т.НДСУпр <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаСебестоимости,
	|	ДокументПоступленияВТекущемПериоде
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерУзлаСебестоимости,
	|	Т.ДокументПоступленияВТекущемПериоде,
	|
	|	СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ВТИсходныеУзлыСебестоимостиИНДССгруппированные
	|ИЗ
	|	ВТИсходныеУзлыСебестоимостиИНДСПредварительная КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.НомерУзлаСебестоимости,
	|	Т.ДокументПоступленияВТекущемПериоде
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаСебестоимости,
	|	ДокументПоступленияВТекущемПериоде
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыДанных", ИмяТаблицыДанных);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"АналитикаУчетаНоменклатурыДокументаПоступления", // разделитель
		"СтоимостьСНДС, СтоимостьБезНДС, СтоимостьБезНДСРегл, НДСРегл, СтоимостьБезНДСУпр, НДСУпр", // ресурсы
		"НомерУзлаСебестоимости, ДокументПоступленияВТекущемПериоде", // порядок
		"НомерУзлаГруппаНДС", // поле нового номера строки
		"НомерУзлаСебестоимости, ДокументПоступленияВТекущемПериоде"); // индексы
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ВТИсходныеУзлыСебестоимостиИНДССгруппированные");
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.НомерУзлаСебестоимости,
	|	Т.НомерУзлаНДС,
	|	УзлыСгруппированные.НомерУзлаГруппаНДС КАК НомерУзлаГруппаНДС,
	|
	|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления,
	|	Т.ДокументПоступленияВТекущемПериоде,
	|
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.ЭтоДопРасходы,
	|	Т.ЭтоПеременныеДопРасходы,
	|
	|	Т.СтоимостьСНДС КАК СтоимостьСНДС,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл КАК СтоимостьБезНДСРегл,
	|	Т.НДСРегл КАК НДСРегл,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр,
	| 	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыСгруппированные.СтоимостьСНДС <> 0
	|		ТОГДА Т.ЗнакСтоимостьСНДС * Т.СтоимостьСНДС / УзлыСгруппированные.СтоимостьСНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(31,10)) КАК ДоляСтоимостьСНДС,
	| 	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыСгруппированные.СтоимостьБезНДС <> 0
	|		ТОГДА Т.ЗнакСтоимостьБезНДС * Т.СтоимостьБезНДС / УзлыСгруппированные.СтоимостьБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(31,10)) КАК ДоляСтоимостьБезНДС,
	| 	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыСгруппированные.СтоимостьБезНДСРегл <> 0
	|		ТОГДА Т.ЗнакСтоимостьБезНДСРегл * Т.СтоимостьБезНДСРегл / УзлыСгруппированные.СтоимостьБезНДСРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(31,10)) КАК ДоляСтоимостьБезНДСРегл,
	| 	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыСгруппированные.НДСРегл <> 0
	|		ТОГДА Т.ЗнакНДСРегл * Т.НДСРегл / УзлыСгруппированные.НДСРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(31,10)) КАК ДоляНДСРегл,
	| 	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыСгруппированные.СтоимостьБезНДСУпр <> 0
	|		ТОГДА Т.ЗнакСтоимостьБезНДСУпр * Т.СтоимостьБезНДСУпр / УзлыСгруппированные.СтоимостьБезНДСУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(31,10)) КАК ДоляСтоимостьБезНДСУпр,
	| 	ВЫРАЗИТЬ(ВЫБОР КОГДА УзлыСгруппированные.НДСУпр <> 0
	|		ТОГДА  Т.ЗнакНДСУпр * Т.НДСУпр / УзлыСгруппированные.НДСУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(31,10)) КАК ДоляНДСУпр
	|ПОМЕСТИТЬ ВТИсходныеУзлыСебестоимостиИНДС
	|ИЗ
	|	ВТИсходныеУзлыСебестоимостиИНДСПредварительная КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсходныеУзлыСебестоимостиИНДССгруппированные КАК УзлыСгруппированные
	|		ПО УзлыСгруппированные.НомерУзлаСебестоимости = Т.НомерУзлаСебестоимости
	|	 	И УзлыСгруппированные.ДокументПоступленияВТекущемПериоде = Т.ДокументПоступленияВТекущемПериоде
	|ГДЕ
	|	Т.СтоимостьСНДС <> 0
	|	ИЛИ Т.СтоимостьБезНДС <> 0
	|	ИЛИ Т.СтоимостьБезНДСРегл <> 0
	|	ИЛИ Т.НДСРегл <> 0
	|	ИЛИ Т.СтоимостьБезНДСУпр <> 0
	|	ИЛИ Т.НДСУпр <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаГруппаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТИсходныеУзлыСебестоимостиИНДСПредварительная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТИсходныеУзлыСебестоимостиИНДССгруппированные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерУзлаСебестоимости КАК НомерУзлаСебестоимости,
	|	Т.НомерУзлаГруппаНДС КАК НомерУзлаНДС,
	|
	|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления,
	|	Т.ДокументПоступленияВТекущемПериоде,
	|
	|	СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ СтоимостьПартийНДС
	|ИЗ
	|	ВТИсходныеУзлыСебестоимостиИНДС КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.НомерУзлаСебестоимости,
	|	Т.НомерУзлаГруппаНДС,
	|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления,
	|	Т.ДокументПоступленияВТекущемПериоде
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаНДС
	|";
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти
	
	#Область ДвиженияБезСтоимости
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	-1 						  КАК УзелИсточник,
	|	Т.НомерУзлаСебестоимости  КАК УзелПриемник,
	|	Т.НомерУзлаНДС 			  КАК НомерУзлаНДС,
	|	ЛОЖЬ												КАК СменаВидаДеятельностиНДС,
	|	Т.ДокументПоступленияВТекущемПериоде 			  	КАК ДокументПоступленияВТекущемПериоде,
	|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления 	КАК СписаниеНДСЗависитОтПериодаДокументаПоступления
	|ПОМЕСТИТЬ ВТУзлыИсточникиШага_0
	|ИЗ
	|	СтоимостьПартийНДС КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.УзелИсточник,
	|	Т.УзелПриемник,
	|	Т.НомерУзлаНДС,
	|	Т.СменаВидаДеятельностиНДС,
	|	Т.ДокументПоступленияВТекущемПериоде,
	|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления
	|ПОМЕСТИТЬ ВТУзлыСПолямиРаспределения_0
	|ИЗ
	|	ВТУзлыИсточникиШага_0 КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УзелПриемник
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВТУзлыСПолямиРаспределения_0");
	
	ИмяТаблицыУзлов = "ВТУзлыИсточникиШага_0";
	ИмяТаблицыСвязей = "ВТУзлыСПолямиРаспределения_0";
	
	КоличествоУзловИсточников = РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТУзлыИсточникиШага_0");
	КоличествоСвязейОбработано = РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ВТУзлыСПолямиРаспределения_0");
	КоличествоСвязейОбработаноНаПредыдущемШаге = КоличествоСвязейОбработано;
	
	НомерИтерации = 0;
	ПродолжатьОбходГрафа = (КоличествоУзловИсточников > 0);
	
	Пока ПродолжатьОбходГрафа Цикл
	
		НомерИтерации = НомерИтерации + 1;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УзлыПриемники.НомерУзлаИсточник КАК УзелИсточник,
		|	УзлыПриемники.НомерУзлаПриемник КАК УзелПриемник,
		|	УзлыИсточники.НомерУзлаНДС,
		|	УзлыПриемники.СменаВидаДеятельностиНДС,
		|	УзлыИсточники.ДокументПоступленияВТекущемПериоде,
		|	УзлыИсточники.СписаниеНДСЗависитОтПериодаДокументаПоступления
		|ПОМЕСТИТЬ ВТУзлыИсточникиШага_1
		|ИЗ
		|	ВтСвязиУзловКорректировкиСебестоимостиСоСписаниемНДС КАК УзлыПриемники
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУзлыИсточникиШага_0 КАК УзлыИсточники
		|		ПО УзлыПриемники.НомерУзлаИсточник = УзлыИсточники.УзелПриемник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	УзелПриемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.УзелИсточник,
		|	Т.УзелПриемник,
		|	Т.НомерУзлаНДС,
		|	Т.СменаВидаДеятельностиНДС,
		|	Т.ДокументПоступленияВТекущемПериоде,
		|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления
		|ПОМЕСТИТЬ ВТУзлыСПолямиРаспределения_1
		|ИЗ
		|	ВТУзлыСПолямиРаспределения_0 КАК Т
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Т.УзелИсточник,
		|	Т.УзелПриемник,
		|	Т.НомерУзлаНДС,
		|	Т.СменаВидаДеятельностиНДС,
		|	Т.ДокументПоступленияВТекущемПериоде,
		|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления
		|ИЗ
		|	ВТУзлыИсточникиШага_1 КАК Т
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзлаНДС,
		|	УзелПриемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТУзлыИсточникиШага_0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТУзлыСПолямиРаспределения_0
		|";
		
		ИмяТаблицыУзлов = "ВТУзлыИсточникиШага_" + Формат(НомерИтерации, "ЧН=0; ЧГ=");
		ИмяТаблицыСвязей = "ВТУзлыСПолямиРаспределения_" + Формат(НомерИтерации, "ЧН=0; ЧГ=");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТУзлыИсточникиШага_1", ИмяТаблицыУзлов);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТУзлыИсточникиШага_0", "ВТУзлыИсточникиШага_" + Формат(НомерИтерации - 1, "ЧН=0; ЧГ="));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТУзлыСПолямиРаспределения_1", ИмяТаблицыСвязей);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТУзлыСПолямиРаспределения_0", "ВТУзлыСПолямиРаспределения_" + Формат(НомерИтерации - 1, "ЧН=0; ЧГ="));
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, ИмяТаблицыСвязей);
		
		КоличествоСвязейОбработано = РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, ИмяТаблицыСвязей);
		
		ПродолжатьОбходГрафа = (КоличествоСвязейОбработано > КоличествоСвязейОбработаноНаПредыдущемШаге);
		КоличествоСвязейОбработаноНаПредыдущемШаге = КоличествоСвязейОбработано;
		
	КонецЦикла; 
	
	ОписаниеЭтапа = НСтр("ru = 'Выполнено итераций распределения партий - %1,
	|	размер таблицы связей - %2'");
	
	ОписаниеЭтапа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ОписаниеЭтапа,
		РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(НомерИтерации + 1),
		РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(КоличествоСвязейОбработано));
	
	РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(ПараметрыРасчета, ОписаниеЭтапа);
	
	#КонецОбласти
	
	#Область ДанныеДляРешенияСЛУ
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.УзелИсточник,
	|	Т.УзелПриемник,
	|	Т.НомерУзлаНДС,
	|	Т.СменаВидаДеятельностиНДС,
	|	Т.ДокументПоступленияВТекущемПериоде,
	|	Т.СписаниеНДСЗависитОтПериодаДокументаПоступления
	|ПОМЕСТИТЬ ВТТаблицаСвязей
	|ИЗ
	|	ИмяТаблицыСвязей КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИмяТаблицыСвязей
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИмяТаблицыУзлов
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.УзелИсточник КАК НомерУзла,
	|	Т.НомерУзлаНДС КАК НомерУзлаНДС
	|ПОМЕСТИТЬ ДанныеДляНумерации
	|ИЗ
	|	ВТТаблицаСвязей КАК Т
	|ГДЕ
	|	Т.УзелИсточник <> -1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.УзелПриемник,
	|	Т.НомерУзлаНДС
	|ИЗ
	|	ВТТаблицаСвязей КАК Т";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыСвязей", ИмяТаблицыСвязей);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыУзлов",  ИмяТаблицыУзлов);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"", // разделитель
		"", // ресурсы
		"НомерУзла, НомерУзлаНДС", // порядок
		"НовыйНомерУзла",
		"НомерУзлаНДС");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"ДанныеДляНумерации",
		"ВТНовыеУзлы");
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.УзелИсточник КАК УзелИсточник,
	|	Т.УзелПриемник КАК УзелПриемник,
	|	Т.НомерУзлаНДС КАК НомерУзлаНДС,
	|	ЕСТЬNULL(НовыеУзлыИсточники.НовыйНомерУзла, -1) КАК НовыйУзелИсточник,
	|	НовыеУзлыПриемники.НовыйНомерУзла КАК НовыйУзелПриемник,
	|
	|	ВЫБОР КОГДА Т.СменаВидаДеятельностиНДС
	|	  И (НЕ Т.СписаниеНДСЗависитОтПериодаДокументаПоступления ИЛИ НЕ Т.ДокументПоступленияВТекущемПериоде)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыполнитьСписаниеНДС,
	|
	|	Стоимости.СтоимостьСНДС,
	|	Стоимости.СтоимостьБезНДС,
	|	Стоимости.СтоимостьБезНДСРегл,
	|	Стоимости.НДСРегл,
	|	Стоимости.СтоимостьБезНДСУпр,
	|	Стоимости.НДСУпр
	|ПОМЕСТИТЬ ВТРезультатРасчетаПредварительный
	|ИЗ
	|	ВТТаблицаСвязей КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьПартийНДС КАК Стоимости
	|			ПО Т.УзелПриемник = Стоимости.НомерУзлаСебестоимости
	|			И Т.НомерУзлаНДС = Стоимости.НомерУзлаНДС
	|			И (Т.УзелИсточник = -1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНовыеУзлы КАК НовыеУзлыИсточники
	|			ПО Т.УзелИсточник = НовыеУзлыИсточники.НомерУзла
	|			И Т.НомерУзлаНДС = НовыеУзлыИсточники.НомерУзлаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНовыеУзлы КАК НовыеУзлыПриемники
	|			ПО Т.УзелПриемник = НовыеУзлыПриемники.НомерУзла
	|			И Т.НомерУзлаНДС = НовыеУзлыПриемники.НомерУзлаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УзелИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТаблицаСвязей";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	#КонецОбласти
	
	#Область РешениеСЛУ
	
	ПояснениеДляЗамера = НСтр("ru = 'Решение для партий НДС'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т.НовыйУзелПриемник) КАК Количество
	|ИЗ
	|	ВТРезультатРасчетаПредварительный КАК Т
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоУзлов = Выборка.Количество;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.НовыйУзелИсточник КАК Источник,
	|		Т.НовыйУзелПриемник КАК Приемник
	|	ИЗ
	|		ВТРезультатРасчетаПредварительный КАК Т
	|	ГДЕ
	|		Т.НовыйУзелИсточник <> -1
	|	) КАК Т
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоСвязей = Выборка.Количество;
	
	ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Узлов СЛУ: %1, связей СЛУ: %2'"),
		КоличествоУзлов,
		КоличествоСвязей);
		
	РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(ПараметрыРасчета, ТекстДляПротокола, ТекстДляПротокола);
	
	ЗапросУзлы = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = ТекстЗапросаУзлыНДС();
	
	ЗапросСвязи = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = ТекстЗапросаСвязиНДС();
	
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = РасчетСебестоимостиРешениеСЛУ.ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "Приемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "Источник";
	
	// описание системы
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьСНДС";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "Вес";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьБезНДС";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "Вес";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьБезНДСРегл";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "Вес";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "НДСРегл";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "Вес";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьБезНДСУпр";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "Вес";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "НДСУпр";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "Вес";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ИсходнаяЗатрата";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесПередел";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СписаниеНДС";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесНДС";
	
	// решение
	Если ПараметрыРасчета.ОтключитьРедуцированиеГрафаНДС Тогда
		ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений(Ложь);
	Иначе
		// В платформе ниже версии 8.3.17 у этого метода не было параметров.
		ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();
	КонецЕсли;
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"СтоимостьСНДС, СтоимостьБезНДС, СтоимостьБезНДСРегл, НДСРегл, СтоимостьБезНДСУпр, НДСУпр, ИсходнаяЗатрата, СписаниеНДС");
	ПараметрыЗагрузкиСЛУ.ЧислоРазрядов = 31;
	ПараметрыЗагрузкиСЛУ.УчитыватьНулевыеРешения = Ложь;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	#КонецОбласти
	
	#Область ПодготовкаДвиженийРегистровНДС
	
	Запрос.УстановитьПараметр("ПогрешностьОкругленияРешенияСЛУ", 0.00000001);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.НовыйНомерУзла,
	|   Т.НомерУзла,
	|	Т.НомерУзлаНДС
	|ПОМЕСТИТЬ ВТНовыеУзлыИндексированная
	|ИЗ
	|	ВТНовыеУзлы КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	НовыйНомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   Т.НомерУзла,
	|	Т.НомерУзлаНДС,
	|	ВЫБОР КОГДА Решения.ИсходнаяЗатрата <> 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ИсходнаяЗатрата,
	//++ Локализация
	|	ВЫБОР КОГДА Решения.СписаниеНДС = 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК СписаниеНДС,
	//-- Локализация
	| 	СУММА(Решения.СтоимостьСНДС) КАК СтоимостьСНДС,
	| 	СУММА(Решения.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	| 	СУММА(Решения.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	| 	СУММА(Решения.НДСРегл) КАК НДСРегл,
	| 	СУММА(Решения.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	| 	СУММА(Решения.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ТаблицаРешенийРасширенная
	|ИЗ
	|	ВТНовыеУзлыИндексированная КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРешений КАК Решения
	|		ПО Т.НовыйНомерУзла = Решения.НомерУзла
	|СГРУППИРОВАТЬ ПО
	|   Т.НомерУзла,
	|	Т.НомерУзлаНДС,
	//++ Локализация
	|	ВЫБОР КОГДА Решения.СписаниеНДС = 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ,
	//-- Локализация
	|	ВЫБОР КОГДА Решения.ИсходнаяЗатрата <> 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзлаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   Т.НомерУзла,
	|	УзлыНДС.ЭтоОстаткиПостатейныеПеременные,
	|	УзлыНДС.ЭтоОстаткиПостатейныеПостоянные,
	|	УзлыНДС.ЭтоДопРасходы,
	|	УзлыНДС.ЭтоПеременныеДопРасходы,
	|	УзлыНДС.СтатьяРасходов,
	|	УзлыНДС.АналитикаРасходов,
	|	УзлыНДС.ДокументПоступления,
	|	УзлыНДС.АналитикаУчетаПартийДокументаПоступления,
	|	УзлыНДС.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	УзлыНДС.ЗатратыПредыдущихПеределов,
	//++ Локализация
	|	Т.СписаниеНДС,
	//-- Локализация
	|	Т.ИсходнаяЗатрата,
	| 	СУММА(ВЫРАЗИТЬ(Т.СтоимостьСНДС * УзлыНДС.ДоляСтоимостьСНДС КАК ЧИСЛО(31,10))) КАК СтоимостьСНДС,
	| 	СУММА(ВЫРАЗИТЬ(Т.СтоимостьБезНДС * УзлыНДС.ДоляСтоимостьБезНДС КАК ЧИСЛО(31,10))) КАК СтоимостьБезНДС,
	| 	СУММА(ВЫРАЗИТЬ(Т.СтоимостьБезНДСРегл * УзлыНДС.ДоляСтоимостьБезНДСРегл КАК ЧИСЛО(31,10))) КАК СтоимостьБезНДСРегл,
	| 	СУММА(ВЫРАЗИТЬ(Т.НДСРегл * УзлыНДС.ДоляНДСРегл КАК ЧИСЛО(31,10))) КАК НДСРегл,
	| 	СУММА(ВЫРАЗИТЬ(Т.СтоимостьБезНДСУпр * УзлыНДС.ДоляСтоимостьБезНДСУпр КАК ЧИСЛО(31,10))) КАК СтоимостьБезНДСУпр,
	| 	СУММА(ВЫРАЗИТЬ(Т.НДСУпр * УзлыНДС.ДоляНДСУпр КАК ЧИСЛО(31,10))) КАК НДСУпр
	|ПОМЕСТИТЬ ТаблицаРешенийДетально
	|ИЗ
	|	ТаблицаРешенийРасширенная КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсходныеУзлыСебестоимостиИНДС КАК УзлыНДС
	|		ПО Т.НомерУзлаНДС = УзлыНДС.НомерУзлаГруппаНДС
	|СГРУППИРОВАТЬ ПО
	|   Т.НомерУзла,
	|	УзлыНДС.ЭтоОстаткиПостатейныеПеременные,
	|	УзлыНДС.ЭтоОстаткиПостатейныеПостоянные,
	|	УзлыНДС.ЭтоДопРасходы,
	|	УзлыНДС.ЭтоПеременныеДопРасходы,
	|	УзлыНДС.СтатьяРасходов,
	|	УзлыНДС.АналитикаРасходов,
	|	УзлыНДС.ДокументПоступления,
	|	УзлыНДС.АналитикаУчетаПартийДокументаПоступления,
	|	УзлыНДС.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	УзлыНДС.ЗатратыПредыдущихПеределов,
	//++ Локализация
	|	Т.СписаниеНДС,
	//-- Локализация
	|	Т.ИсходнаяЗатрата
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.ЭтоДопРасходы,
	|	Т.ЭтоПеременныеДопРасходы,
	|	ДокументыРасчетаСебестоимости.Ссылка КАК Регистратор,
	|
	|	&НачалоПериода КАК Период,
	|	УзлыСебестоимости.Организация КАК Организация,
	|	УзлыСебестоимости.РазделУчета,
	|	УзлыСебестоимости.АналитикаУчетаНоменклатуры,
	|	УзлыСебестоимости.ВидЗапасов,
	|	УзлыСебестоимости.Партия,
	|	УзлыСебестоимости.АналитикаУчетаПартий,
	|	УзлыСебестоимости.ВидДеятельностиНДС,
	|	УзлыСебестоимости.АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УзлыСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|		ТОГДА УзлыСебестоимости.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаУчетаНоменклатурыНЗП,
	|	МАКСИМУМ(ЕСТЬNULL(ОстаткиСебестоимости.Количество, 0)) КАК КоличествоПартии,
	|
	|	ВЫБОР КОГДА НЕ (ТИПЗНАЧЕНИЯ(Т.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|		И Т.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	  И НЕ ЕСТЬNULL(Т.ЭтоДопРасходы, ЛОЖЬ)
	|	  И НЕ ЕСТЬNULL(Т.ЭтоОстаткиПостатейныеПеременные, ЛОЖЬ)
	|	  И НЕ ЕСТЬNULL(Т.ЭтоОстаткиПостатейныеПостоянные, ЛОЖЬ)
	|		ТОГДА Т.АналитикаУчетаНоменклатурыДокументаПоступления
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|
	|	(Т.ИсходнаяЗатрата И НЕ Т.ЗатратыПредыдущихПеределов) КАК ИсходнаяЗатрата,
	//++ Локализация
	|	Т.СписаниеНДС,
	|	ВЫБОР КОГДА УзлыСебестоимости.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ТОГДА ЕСТЬNULL(УчетнаяПолитика.СтатьяРасходовНеНДС, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.СтатьяРасходовЕНВД, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	КОНЕЦ КАК СтатьяСписанияНДС,
	//-- Локализация
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьСНДС - ВЫРАЗИТЬ(Т.СтоимостьСНДС КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьСНДС КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьСНДС
	|		КОНЕЦ КАК ЧИСЛО(31,10))) КАК СтоимостьСНДС,
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьБезНДС - ВЫРАЗИТЬ(Т.СтоимостьБезНДС КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьБезНДС КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьБезНДС
	|		КОНЕЦ КАК ЧИСЛО(31,10))) КАК СтоимостьБезНДС,
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьБезНДСРегл - ВЫРАЗИТЬ(Т.СтоимостьБезНДСРегл КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьБезНДСРегл КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьБезНДСРегл
	|		КОНЕЦ КАК ЧИСЛО(31,10))) КАК СтоимостьБезНДСРегл,
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.НДСРегл - ВЫРАЗИТЬ(Т.НДСРегл КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.НДСРегл КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.НДСРегл
	|		КОНЕЦ КАК ЧИСЛО(31,10))) КАК НДСРегл,
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьБезНДСУпр - ВЫРАЗИТЬ(Т.СтоимостьБезНДСУпр КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьБезНДСУпр КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьБезНДСУпр
	|		КОНЕЦ КАК ЧИСЛО(31,10))) КАК СтоимостьБезНДСУпр,
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.НДСУпр - ВЫРАЗИТЬ(Т.НДСУпр КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.НДСУпр КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.НДСУпр
	|		КОНЕЦ КАК ЧИСЛО(31,10))) КАК НДСУпр
	|ПОМЕСТИТЬ ВТЦеныУзловДетально
	|ИЗ
	|	ТаблицаРешенийДетально КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимости КАК УзлыСебестоимости
	|		ПО УзлыСебестоимости.НомерУзла = Т.НомерУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
	|			ПО УзлыСебестоимости.Организация = ДокументыРасчетаСебестоимости.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК ОстаткиСебестоимости
	|			ПО ОстаткиСебестоимости.Организация = УзлыСебестоимости.Организация
	|			И ОстаткиСебестоимости.РазделУчета = УзлыСебестоимости.РазделУчета
	|			И ОстаткиСебестоимости.АналитикаУчетаНоменклатуры = УзлыСебестоимости.АналитикаУчетаНоменклатуры
	|			И ОстаткиСебестоимости.ВидЗапасов = УзлыСебестоимости.ВидЗапасов
	|			И ОстаткиСебестоимости.Партия = УзлыСебестоимости.Партия
	|			И ОстаткиСебестоимости.АналитикаУчетаПартий = УзлыСебестоимости.АналитикаУчетаПартий
	|			И ОстаткиСебестоимости.ВидДеятельностиНДС = УзлыСебестоимости.ВидДеятельностиНДС
	|			И ОстаткиСебестоимости.АналитикаФинансовогоУчета = УзлыСебестоимости.АналитикаФинансовогоУчета
	//++ Локализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиУчетаНДС КАК УчетнаяПолитика
	|			ПО УзлыСебестоимости.Организация = УчетнаяПолитика.Организация
	//-- Локализация
	|ГДЕ
	|	УзлыСебестоимости.Партия <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ЭтоОстаткиПостатейныеПеременные,
	|	Т.ЭтоОстаткиПостатейныеПостоянные,
	|	Т.ЭтоДопРасходы,
	|	Т.ЭтоПеременныеДопРасходы,
	|	ДокументыРасчетаСебестоимости.Ссылка,
	|	УзлыСебестоимости.Организация,
	|	УзлыСебестоимости.РазделУчета,
	|	УзлыСебестоимости.АналитикаУчетаНоменклатуры,
	|	УзлыСебестоимости.ВидЗапасов,
	|	УзлыСебестоимости.Партия,
	|	УзлыСебестоимости.АналитикаУчетаПартий,
	|	УзлыСебестоимости.ВидДеятельностиНДС,
	|	УзлыСебестоимости.АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УзлыСебестоимости.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|		ТОГДА УзлыСебестоимости.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА НЕ (ТИПЗНАЧЕНИЯ(Т.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|		И Т.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	  И НЕ ЕСТЬNULL(Т.ЭтоДопРасходы, ЛОЖЬ)
	|	  И НЕ ЕСТЬNULL(Т.ЭтоОстаткиПостатейныеПеременные, ЛОЖЬ)
	|	  И НЕ ЕСТЬNULL(Т.ЭтоОстаткиПостатейныеПостоянные, ЛОЖЬ)
	|		ТОГДА Т.АналитикаУчетаНоменклатурыДокументаПоступления
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	//++ Локализация
	|	Т.СписаниеНДС,
	|	ВЫБОР КОГДА УзлыСебестоимости.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ТОГДА ЕСТЬNULL(УчетнаяПолитика.СтатьяРасходовНеНДС, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитика.СтатьяРасходовЕНВД, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	КОНЕЦ,
	//-- Локализация
	|	(Т.ИсходнаяЗатрата И НЕ Т.ЗатратыПредыдущихПеределов)
	|ИМЕЮЩИЕ
	|	СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьСНДС - ВЫРАЗИТЬ(Т.СтоимостьСНДС КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьСНДС КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьСНДС
	|		КОНЕЦ КАК ЧИСЛО(31,10))) <> 0
	|	ИЛИ СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьБезНДС - ВЫРАЗИТЬ(Т.СтоимостьБезНДС КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьБезНДС КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьБезНДС
	|		КОНЕЦ КАК ЧИСЛО(31,10))) <> 0
	|	ИЛИ СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьБезНДСРегл - ВЫРАЗИТЬ(Т.СтоимостьБезНДСРегл КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьБезНДСРегл КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьБезНДСРегл
	|		КОНЕЦ КАК ЧИСЛО(31,10))) <> 0
	|	ИЛИ СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.НДСРегл - ВЫРАЗИТЬ(Т.НДСРегл КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.НДСРегл КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.НДСРегл
	|		КОНЕЦ КАК ЧИСЛО(31,10))) <> 0
	|	ИЛИ СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.СтоимостьБезНДСУпр - ВЫРАЗИТЬ(Т.СтоимостьБезНДСУпр КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.СтоимостьБезНДСУпр КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.СтоимостьБезНДСУпр
	|		КОНЕЦ КАК ЧИСЛО(31,10))) <> 0
	|	ИЛИ СУММА(ВЫРАЗИТЬ(
	|		ВЫБОР КОГДА Т.НДСУпр - ВЫРАЗИТЬ(Т.НДСУпр КАК ЧИСЛО(31,4)) МЕЖДУ -&ПогрешностьОкругленияРешенияСЛУ И &ПогрешностьОкругленияРешенияСЛУ
	|			ТОГДА ВЫРАЗИТЬ(Т.НДСУпр КАК ЧИСЛО(31,4))
	|			ИНАЧЕ Т.НДСУпр
	|		КОНЕЦ КАК ЧИСЛО(31,10))) <> 0
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	АналитикаРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Организация,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов
	|ПОМЕСТИТЬ ВТАналитикиРасходовПартийНДС
	|ИЗ
	|	ВТЦеныУзловДетально КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО Статья.Ссылка = Т.СтатьяРасходов
	|ГДЕ
	|	Т.АналитикаРасходов <> НЕОПРЕДЕЛЕНО
	|	И (ТИПЗНАЧЕНИЯ(Т.АналитикаРасходов) В (&ТипыДокументовПартии)
	|		ИЛИ ТИПЗНАЧЕНИЯ(Т.АналитикаРасходов) В (&ТипыАналитикПеременныхРасходов))
	|	И (Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		ИЛИ Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|	И НЕ Т.ЭтоОстаткиПостатейныеПеременные
	|	И НЕ Т.ЭтоОстаткиПостатейныеПостоянные
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	АналитикаРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Формирование таблицы отбора данных для движений по регистру "ДетализацияСебестоимостиТоваровПостатейныеЗатраты".
	// В регистр "ДетализацияСебестоимостиТоваровПостатейныеЗатраты" попадают дополнительные расходы:
	// - относящиеся к партии прошлого периода
	// - распределяемые на документ перемещения товаров
	// - распределяемые на склад или на номенклатуру (такие доп расходы распределяются на остатки и приходы товаров)
	// 	 распределяемые на прочие расходы
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов
	|ПОМЕСТИТЬ ВТОтборАналитикиРасходовПартийНДСПеременные
	|ИЗ
	|	ВТАналитикиРасходовПартийНДС КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДанныеПервичныхДокументов.Организация = Т.Организация
	|		И ДанныеПервичныхДокументов.Документ = Т.АналитикаРасходов
	|ГДЕ
	|	(ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ НЕ NULL
	|		И НАЧАЛОПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, &НачалоПериода), МЕСЯЦ) < &НачалоПериода)
	|	ИЛИ ТИПЗНАЧЕНИЯ(Т.АналитикаРасходов) В (&ТипыАналитикПеременныхРасходов)
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	АналитикаРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий
	|ПОМЕСТИТЬ ВТОтборПартий
	|ИЗ
	|	ВТЦеныУзловДетально КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	АналитикаУчетаПартий,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПериода КАК ПериодРегистрации,
	|
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыНЗП,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|
	|	СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ВТЦеныУзловПостоянные
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		ЛОЖЬ КАК ЕстьДвижения,
	|		Т.Организация,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидЗапасов,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура КАК Номенклатура,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика КАК Характеристика,
	|	
	|		НЕ Т.ИсходнаяЗатрата КАК ЗатратыПредыдущихПеределов,
	|		Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|		Т.АналитикаУчетаНоменклатурыНЗП,
	|		Т.ДокументПоступления,
	|		Т.АналитикаУчетаПартийДокументаПоступления,
	|
	|		МАКСИМУМ(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|		МАКСИМУМ(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		МАКСИМУМ(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|		МАКСИМУМ(Т.НДСРегл) КАК НДСРегл,
	|		МАКСИМУМ(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|		МАКСИМУМ(Т.НДСУпр) КАК НДСУпр
	|	ИЗ
	|		ВТЦеныУзловДетально КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО Т.СтатьяРасходов = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		СтатьиРасходов.Ссылка ЕСТЬ NULL
	|		И НЕ Т.ЭтоДопРасходы
	|		И НЕ Т.ЭтоОстаткиПостатейныеПеременные
	|		И НЕ Т.ЭтоОстаткиПостатейныеПостоянные		
	|	СГРУППИРОВАТЬ ПО
	|		Т.Организация,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидЗапасов,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика,
	|		НЕ Т.ИсходнаяЗатрата,
	|		Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|		Т.АналитикаУчетаНоменклатурыНЗП,
	|		Т.ДокументПоступления,
	|		Т.АналитикаУчетаПартийДокументаПоступления
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ИСТИНА КАК ЕстьДвижения,
	|		Т.Организация,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидЗапасов,
	|		Т.Номенклатура,
	|		Т.Характеристика,
	|
	|		Т.ЗатратыПредыдущихПеределов,
	|		Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|		Т.АналитикаУчетаНоменклатурыНЗП,
	|		Т.ДокументПоступления,
	|		Т.АналитикаУчетаПартийДокументаПоступления,
	|
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартий КАК Отбор
	|			ПО Т.Организация = Отбор.Организация
	|			И Т.Партия = Отбор.Партия
	|			И Т.АналитикаУчетаПартий = Отбор.АналитикаУчетаПартий
	|	ГДЕ
	|		Т.ПериодРегистрации < &НачалоПериода
	|) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыНЗП,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Т.ЕстьДвижения) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПериода КАК ПериодРегистрации,
	|
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.АналитикаУчетаНоменклатурыНЗП,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|
	|	СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ВТЦеныУзловПостатейныеПостоянные
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		ЛОЖЬ КАК ЕстьДвижения,
	|		Т.Организация,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидЗапасов,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура КАК Номенклатура,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика КАК Характеристика,
	|	
	|		НЕ Т.ИсходнаяЗатрата КАК ЗатратыПредыдущихПеределов,
	|		Т.СтатьяРасходов,
	|		Т.АналитикаРасходов,
	|		Т.АналитикаУчетаНоменклатурыНЗП,
	|		Т.ДокументПоступления,
	|		Т.АналитикаУчетаПартийДокументаПоступления,
	|
	|		МАКСИМУМ(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|		МАКСИМУМ(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		МАКСИМУМ(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|		МАКСИМУМ(Т.НДСРегл) КАК НДСРегл,
	|		МАКСИМУМ(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|		МАКСИМУМ(Т.НДСУпр) КАК НДСУпр
	|	ИЗ
	|		ВТЦеныУзловДетально КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|			ПО Т.СтатьяРасходов = СтатьиРасходов.Ссылка
	|	ГДЕ
	|		(НЕ СтатьиРасходов.Ссылка ЕСТЬ NULL
	|			ИЛИ (Т.ЭтоДопРасходы И НЕ Т.ЭтоПеременныеДопРасходы)
	|			ИЛИ Т.ЭтоОстаткиПостатейныеПостоянные)
	|		И НЕ Т.ЭтоОстаткиПостатейныеПеременные
	|		И (НЕ Т.ИсходнаяЗатрата
	|			ИЛИ НЕ (ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА
	|							  ИЗ ВТОтборАналитикиРасходовПартийНДСПеременные КАК Отбор
	|							  ГДЕ 
	|								Т.Организация = Отбор.Организация
	|								И Т.АналитикаРасходов = Отбор.АналитикаРасходов
	|								И Т.СтатьяРасходов = Отбор.СтатьяРасходов)))
	|	СГРУППИРОВАТЬ ПО
	|		Т.Организация,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидЗапасов,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура,
	|		ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика,
	|		НЕ Т.ИсходнаяЗатрата,
	|		Т.СтатьяРасходов,
	|		Т.АналитикаРасходов,
	|		Т.АналитикаУчетаНоменклатурыНЗП,
	|		Т.ДокументПоступления,
	|		Т.АналитикаУчетаПартийДокументаПоступления
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ИСТИНА КАК ЕстьДвижения,
	|		Т.Организация,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидЗапасов,
	|		Т.Номенклатура,
	|		Т.Характеристика,
	|
	|		Т.ЗатратыПредыдущихПеределов,
	|		Т.СтатьяРасходов,
	|		Т.АналитикаРасходов,
	|		Т.АналитикаУчетаНоменклатурыНЗП,
	|		Т.ДокументПоступления,
	|		Т.АналитикаУчетаПартийДокументаПоступления,
	|
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартий КАК Отбор
	|			ПО Т.Организация = Отбор.Организация
	|			И Т.Партия = Отбор.Партия
	|			И Т.АналитикаУчетаПартий = Отбор.АналитикаУчетаПартий
	|	ГДЕ
	|		Т.ПериодРегистрации < &НачалоПериода
	|) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидЗапасов,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.ЗатратыПредыдущихПеределов,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.АналитикаУчетаНоменклатурыНЗП,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Т.ЕстьДвижения) = ЛОЖЬ
	|";
	
	ТипыАналитикПеременныхРасходов = Новый Массив;
	ТипыАналитикПеременныхРасходов.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
	ТипыАналитикПеременныхРасходов.Добавить(Тип("СправочникСсылка.Склады"));
	ТипыАналитикПеременныхРасходов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ТипыАналитикПеременныхРасходов.Добавить(Тип("СправочникСсылка.ПрочиеРасходы"));
	
	Запрос.УстановитьПараметр("ТипыАналитикПеременныхРасходов", ТипыАналитикПеременныхРасходов);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ТаблицаРешений");
	
	#КонецОбласти
	
	СоответствиеВременныхТаблицДвижений = Новый Соответствие;
	
	#Область СохранениеДвижений_ДетализацияСебестоимостиПартииТоваров
	
	ИмяРегистра = Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартииТоваров.Имя;
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ИмяВременнойТаблицы = "ВТДетализацияСебестоимостиПартииТоваров";
	
	КопируемыеПоля = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыгрузитьВременнуюТаблицу(ПараметрыРасчета, "ВТЦеныУзловПостоянные", 0));
	
	КопируемыеПоля = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КопируемыеПоля, "");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(
		ПараметрыРасчета,
		ТаблицаОписанияПолей,
		ИмяРегистра,
		"ВТЦеныУзловПостоянные",
		ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	#КонецОбласти
	
	#Область СохранениеДвижений_ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты
	
	ИмяРегистра = Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.Имя;
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ИмяВременнойТаблицы = "ВТДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты";
	
	КопируемыеПоля = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыгрузитьВременнуюТаблицу(ПараметрыРасчета, "ВТЦеныУзловПостатейныеПостоянные", 0));
	
	КопируемыеПоля = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КопируемыеПоля, "");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(
		ПараметрыРасчета,
		ТаблицаОписанияПолей,
		ИмяРегистра,
		"ВТЦеныУзловПостатейныеПостоянные",
		ИмяВременнойТаблицы);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	#КонецОбласти
	
	#Область СохранениеДвижений_ДетализацияСебестоимостиТоваровПостатейныеЗатраты
	
	ИмяРегистра = Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты.Имя;
	
	ОписаниеПриемника = ПараметрыРасчета.Движения[ИмяРегистра];
	
	ИмяВременнойТаблицы = "ВТДетализацияСебестоимостиТоваровПостатейныеЗатраты";
	
	КопируемыеПоля = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыгрузитьВременнуюТаблицу(ПараметрыРасчета, "ВТЦеныУзловДетально", 0));
	
	КопируемыеПоля = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КопируемыеПоля, "");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	УсловиеГДЕ = "ЭтоОстаткиПостатейныеПеременные
		|	ИЛИ ЭтоПеременныеДопРасходы
		|	ИЛИ (Организация, СтатьяРасходов, АналитикаРасходов) В (
		|	ВЫБРАТЬ
		|		Организация, СтатьяРасходов, АналитикаРасходов
		|	ИЗ ВТОтборАналитикиРасходовПартийНДСПеременные КАК Отбор)
		|	И ИсходнаяЗатрата
		|	И НЕ ЭтоОстаткиПостатейныеПостоянные
		|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(
		ПараметрыРасчета,
		ТаблицаОписанияПолей,
		ИмяРегистра,
		"ВТЦеныУзловДетально",
		ИмяВременнойТаблицы,
		УсловиеГДЕ);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	//++ Локализация
	// Корректировка сумм НДС при списании НДС на статью
	ИмяВременнойТаблицы = "ВТДетализацияСебестоимостиТоваровПостатейныеЗатратыСписаниеНДС";
	
	КопируемыеПоля = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьИменаКолонокСтрокой(
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыгрузитьВременнуюТаблицу(ПараметрыРасчета, "ВТЦеныУзловДетально", 0));
	
	КопируемыеПоля = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КопируемыеПоля, "");
	
	ТаблицаОписанияПолей = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьОписаниеПолейЗапроса(ОписаниеПриемника.Таблица);
	РасчетСебестоимостиПрикладныеАлгоритмы.КопироватьПоляЗапроса(ТаблицаОписанияПолей, КопируемыеПоля);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьСНДС", 		"0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьБезНДС", 		"0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьБезНДСРегл", 	"0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтоимостьБезНДСУпр", 	"0");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НДСРегл", 				"-НДСРегл");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "НДСУпр", 				"-НДСУпр");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "СтатьяРасходов",		"СтатьяСписанияНДС");
	РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПолеВОписанииПолейЗапроса(ТаблицаОписанияПолей, "АналитикаРасходов",		"НЕОПРЕДЕЛЕНО");
	
	УсловиеГДЕ = "СписаниеНДС И (НДСРегл <> 0 ИЛИ НДСУпр <> 0)";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросПоОписаниюПолей(
		ПараметрыРасчета,
		ТаблицаОписанияПолей,
		ИмяРегистра,
		"ВТЦеныУзловДетально",
		ИмяВременнойТаблицы,
		УсловиеГДЕ);
	
	СоответствиеВременныхТаблицДвижений.Вставить(ИмяВременнойТаблицы, ИмяРегистра);
	
	//-- Локализация
	#КонецОбласти
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц(ПараметрыРасчета, СоответствиеВременныхТаблицДвижений, Истина);
	
	// Уничтожим ненужные временные таблицы.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
		ПараметрыРасчета,
		СуществующиеВТ);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

Процедура СформироватьСтоимостьПартийНДСНаКонецПериода(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВТОборотыСтоимостьПартийНДС");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Т.АналитикаУчетаНоменклатуры.Серия КАК Серия
	|ПОМЕСТИТЬ ВТПередачиБезНДС
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передачи
	|		ПО Т.Ссылка = Передачи.Ссылка
	|ГДЕ
	|	Передачи.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Передачи.Организация В (&МассивОрганизаций)
	|	И Передачи.Проведен
	|	И Т.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.СлужебноеВидДвиженияПриход,
	|	Т.Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	(ВЫБОР
	|		КОГДА Т.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И Т.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Т.СтатьяРасходовСписания
	|		КОГДА Т.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА Т.СтатьяАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК СтатьяРасходовАктивов,
	|	(ВЫБОР
	|		КОГДА Т.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И Т.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Т.АналитикаРасходов
	|		КОГДА Т.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА Т.АналитикаАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК АналитикаРасходовАктивов,
	|
	|	ВЫБОР
	|		КОГДА НЕ ПередачаВидыЗапасов.Ссылка ЕСТЬ NULL И НЕ Т.СлужебноеВидДвиженияПриход
	|		 И Передача.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL И НЕ Т.СлужебноеВидДвиженияПриход
	|			ТОГДА Передача.НалогообложениеНДС
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL И Т.СлужебноеВидДвиженияПриход
	|			ТОГДА Возврат.НалогообложениеНДС
	|		ИНАЧЕ Т.КорВидДеятельностиНДС
	|	КОНЕЦ КАК КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Подразделение,
	|	Т.ТипЗаписи,
	|	Т.Сторно,
	|
	|	ВЫБОР КОГДА Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	  И Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозможноСписаниеНДС,
	|
	|	ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА Т.КорНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА Т.КорНаправлениеДеятельности
	|		ИНАЧЕ
	|			ЕСТЬNULL(Т.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) 
	|		КОНЕЦ) КАК КорНаправлениеДеятельности,
	|	Т.ГруппаПродукции КАК КорГруппаПродукции,
	|	Т.Количество
	|ПОМЕСТИТЬ ВТСебестоимостьДляСтоимостиПартийНДС
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = Т.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПередачиБезНДС КАК ПередачаВидыЗапасов
	|		ПО ПередачаВидыЗапасов.Ссылка = Т.Регистратор
	|			И ПередачаВидыЗапасов.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ПередачаВидыЗапасов.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
	|			И ПередачаВидыЗапасов.Серия = Т.АналитикаУчетаНоменклатуры.Серия
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК Возврат
	|		ПО Возврат.Ссылка = Т.Регистратор
	|ГДЕ
	|	Т.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И НЕ Т.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение))
	|	И Т.Количество <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Организация,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.СлужебноеВидДвиженияПриход,
	|	Т.Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходовАктивов,
	|
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Подразделение,
	|	Т.ТипЗаписи,
	|	Т.Сторно,
	|	ЛОЖЬ КАК ПостатейныеЗатраты,
	|	ЛОЖЬ КАК ПостатейныеЗатратыНЗП,
	|
	|	Т.ВозможноСписаниеНДС,
	|
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.КорГруппаПродукции,
	|
	|	Цены.ДокументПоступления КАК ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК НДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК НДСУпр,
	|	Т.Количество
	|ПОМЕСТИТЬ ВТОборотыСтоимостьПартийНДСПредварительная
	|ИЗ
	|	ВТСебестоимостьДляСтоимостиПартийНДС КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКэшДетализацияСебестоимостиПартииТоваров КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				ИЛИ Т.АналитикаУчетаНоменклатуры = Цены.АналитикаУчетаНоменклатурыНЗП)
	|ГДЕ
	|	НЕ Цены.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.СлужебноеВидДвиженияПриход,
	|	Т.Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходовАктивов,
	|
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Подразделение,
	|	Т.ТипЗаписи,
	|	Т.Сторно,
	|	ЛОЖЬ КАК ПостатейныеЗатраты,
	|	ЛОЖЬ КАК ПостатейныеЗатратыНЗП,
	|
	|	Т.ВозможноСписаниеНДС,
	|
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.КорГруппаПродукции,
	|
	|	Цены.ДокументПоступления КАК ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК НДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК НДСУпр,
	|	Т.Количество
	|ИЗ
	|	ВТСебестоимостьДляСтоимостиПартийНДС КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.ПериодРегистрации < &НачалоПериода)
	|			И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				ИЛИ Т.АналитикаУчетаНоменклатуры = Цены.АналитикаУчетаНоменклатурыНЗП)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.СлужебноеВидДвиженияПриход,
	|	Т.Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходовАктивов,
	|
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Подразделение,
	|	Т.ТипЗаписи,
	|	Т.Сторно,
	|	ЛОЖЬ КАК ПостатейныеЗатраты,
	|	ЛОЖЬ КАК ПостатейныеЗатратыНЗП,
	|
	|	Т.ВозможноСписаниеНДС,
	|
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.КорГруппаПродукции,
	|
	|	Цены.ДокументПоступления КАК ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК НДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК НДСУпр,
	|	Т.Количество
	|ИЗ
	|	ВТСебестоимостьДляСтоимостиПартийНДС КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКэшДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				ИЛИ Т.АналитикаУчетаНоменклатуры = Цены.АналитикаУчетаНоменклатурыНЗП)
	|ГДЕ
	|	НЕ Цены.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.СлужебноеВидДвиженияПриход,
	|	Т.Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходовАктивов,
	|
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Подразделение,
	|	Т.ТипЗаписи,
	|	Т.Сторно,
	|	ЛОЖЬ КАК ПостатейныеЗатраты,
	|	ЛОЖЬ КАК ПостатейныеЗатратыНЗП,
	|
	|	Т.ВозможноСписаниеНДС,
	|
	|	Т.НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности,
	|	Т.КорГруппаПродукции,
	|
	|	Цены.ДокументПоступления КАК ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК НДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК НДСУпр,
	|	Т.Количество
	|ИЗ
	|	ВТСебестоимостьДляСтоимостиПартийНДС КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.ПериодРегистрации < &НачалоПериода)
	|			И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				ИЛИ Т.АналитикаУчетаНоменклатуры = Цены.АналитикаУчетаНоменклатурыНЗП)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.СлужебноеВидДвиженияПриход,
	|	Т.Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|	Т.СтатьяРасходовСписания,
	|	Т.АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов,
	|	(ВЫБОР
	|		КОГДА Т.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И Т.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Т.СтатьяРасходовСписания
	|		КОГДА Т.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА Т.СтатьяАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК СтатьяРасходовАктивов,
	|	(ВЫБОР
	|		КОГДА Т.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И Т.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Т.АналитикаРасходов
	|		КОГДА Т.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|			ТОГДА Т.АналитикаАктивовПассивов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК АналитикаРасходовАктивов,
	|
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Подразделение,
	|	Т.ТипЗаписи,
	|	Т.Сторно,
	|	ИСТИНА КАК ПостатейныеЗатраты,
	|	ЛОЖЬ КАК ПостатейныеЗатратыНЗП,
	|
	|	ВЫБОР КОГДА Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	  И Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозможноСписаниеНДС,
	|
	|	ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	(ВЫБОР
	|		КОГДА Т.КорНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА Т.КорНаправлениеДеятельности
	|		ИНАЧЕ
	|			ЕСТЬNULL(Т.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) 
	|		КОНЕЦ) КАК КорНаправлениеДеятельности,
	|	Т.ГруппаПродукции КАК КорГруппаПродукции,
	|
	|	Цены.ДокументПоступления КАК ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Цены.НДСРегл * Т.Количество КАК ЧИСЛО (31,2)) КАК НДС,
	|	ВЫРАЗИТЬ(Цены.СтоимостьБезНДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Цены.НДСУпр * Т.Количество КАК ЧИСЛО (31,2)) КАК НДСУпр,
	|	Т.Количество
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКэшДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Цены
	|		ПО (Цены.Организация = Т.Организация)
	|			И (Цены.РазделУчета = Т.РазделУчета)
	|			И (Цены.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.Партия = Т.Партия)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидДеятельностиНДС = Т.ВидДеятельностиНДС)
	|			И (Цены.АналитикаФинансовогоУчета = Т.АналитикаФинансовогоУчета)
	|ГДЕ
	|	Т.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И НЕ Цены.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|	И НЕ Т.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение))
	|	И Т.Количество <> 0
	//++ Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КонецПериода КАК Период,
	|	Т.ПриходЗатрат,
	|	Т.ДокументДвижения КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовСписания,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	Т.СтатьяРасходов КАК СтатьяРасходовАктивов,
	|	Т.АналитикаРасходов КАК АналитикаРасходовАктивов,
	|
	|	Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов КАК КорВидЗапасов,
	|	Т.Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
	|	ЛОЖЬ КАК Сторно,
	|	ИСТИНА КАК ПостатейныеЗатраты,
	|	ИСТИНА КАК ПостатейныеЗатратыНЗП,
	|
	|	ЛОЖЬ КАК ВозможноСписаниеНДС,
	|
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	Т.КорГруппаПродукции КАК КорГруппаПродукции,
	|
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	ВЫРАЗИТЬ(Т.СтоимостьБезНДС КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Т.НДС КАК ЧИСЛО (31,2)) КАК НДС,
	|	ВЫРАЗИТЬ(Т.СтоимостьБезНДСУпр КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Т.НДСУпр КАК ЧИСЛО (31,2)) КАК НДСУпр,
	|	1 КАК Количество
	|ИЗ
	|	ДвиженияПартийПрочихРасходовНДС2_4 КАК Т
	|ГДЕ
	|	Т.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	//-- Локализация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.ДокументПоступления
	|ПОМЕСТИТЬ ВТДокументыПоступленияНДС
	|ИЗ
	|	ВТОборотыСтоимостьПартийНДСПредварительная КАК Т
	|ГДЕ
	|	Т.ВозможноСписаниеНДС
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	Т.Организация,
	|	Т.ДокументПоступления,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовНеНДС,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовНеНДС,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовЕНВД
	|
	|ПОМЕСТИТЬ ВТДокументыСписанияНДС
	|ИЗ
	|	ВТДокументыПоступленияНДС КАК Т
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.ДокументПоступления,
	|	УчетнаяПолитика.СтатьяРасходовНеНДС,
	|	УчетнаяПолитика.АналитикаРасходовНеНДС,
	|	УчетнаяПолитика.СтатьяРасходовЕНВД,
	|	УчетнаяПолитика.АналитикаРасходовЕНВД
	|ИЗ
	|	ВТДокументыПоступленияНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНастройкиУчетаНДС КАК УчетнаяПолитика
	|		ПО Т.Организация = УчетнаяПолитика.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДанныеПервичныхДокументов.Организация = Т.Организация
	|		И ДанныеПервичныхДокументов.Документ = Т.ДокументПоступления
	|ГДЕ
	|	УчетнаяПолитика.ВариантУчетаНДСПриИзмененииВидаДеятельности <> ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимость)
	|	И (УчетнаяПолитика.ВариантУчетаНДСПриИзмененииВидаДеятельности <> ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимостьИлиРасходыВЗависимостиОтПериода)
	|	   ИЛИ НАЧАЛОПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)), МЕСЯЦ) <> &НачалоПериода)
	|	И УчетнаяПолитика.СтатьяРасходовСписаниеНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	//-- Локализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Период КАК Период,
	|	Т.СлужебноеВидДвиженияПриход КАК СлужебноеВидДвиженияПриход,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ТОГДА ЕСТЬNULL(СписаниеНДС.СтатьяРасходовНеНДС, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(СписаниеНДС.СтатьяРасходовЕНВД, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	КОНЕЦ КАК СтатьяСписанияНДС,
	|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ТОГДА ЕСТЬNULL(СписаниеНДС.АналитикаРасходовНеНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(СписаниеНДС.АналитикаРасходовЕНВД, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК АналитикаСписанияНДС,
	|	Т.СтатьяРасходовАктивов КАК СтатьяРасходовАктивов,
	|	Т.АналитикаРасходовАктивов КАК АналитикаРасходовАктивов,
	|	Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Т.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов КАК КорВидЗапасов,
	|	Т.Подразделение КАК Подразделение,
	|	Т.ТипЗаписи КАК ТипЗаписи,
	|	Т.Сторно КАК Сторно,
	|	Т.ПостатейныеЗатраты КАК ПостатейныеЗатраты,
	|	Т.ПостатейныеЗатратыНЗП КАК ПостатейныеЗатратыНЗП,
	|	ВЫБОР КОГДА Т.ВозможноСписаниеНДС И НЕ СписаниеНДС.Организация ЕСТЬ NULL
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозможноСписаниеНДС,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	Т.КорГруппаПродукции КАК КорГруппаПродукции,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.НДС КАК НДС,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр,
	|	Т.Количество КАК Количество
	|ПОМЕСТИТЬ ВТОборотыСтоимостьПартийНДС
	|ИЗ
	|	ВТОборотыСтоимостьПартийНДСПредварительная КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыСписанияНДС КАК СписаниеНДС
	|		ПО СписаниеНДС.Организация = Т.Организация
	|		И СписаниеНДС.ДокументПоступления = Т.ДокументПоступления
	|		И Т.ВозможноСписаниеНДС
	|";
	
	//++ Локализация
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ДвиженияПартийПрочихРасходовНДС2_4") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДвиженияПартийПрочихРасходовНДС2_4", "ВТКэшДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП");
	КонецЕсли;
	//-- Локализация
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТПередачиБезНДС, ВТСебестоимостьДляСтоимостиПартийНДС, ВТОборотыСтоимостьПартийНДСПредварительная, ВТДокументыПоступленияНДС, ВТДокументыСписанияНДС");
	
КонецПроцедуры

Функция ТекстЗапросаУзлыНДС(СРасшифровкойПолей = Ложь)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.НовыйУзелПриемник КАК НомерУзла,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.УзелИсточник = -1
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ИсходнаяЗатрата,
	|	МАКСИМУМ(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	МАКСИМУМ(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	МАКСИМУМ(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	МАКСИМУМ(Т.НДСРегл) КАК НДСРегл,
	|	МАКСИМУМ(Т.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	МАКСИМУМ(Т.НДСУпр) КАК НДСУпр,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК СписаниеНДС
	|ПОМЕСТИТЬ ВТУзлыНДСДляРешенияСЛУ
	|ИЗ
	|	ВТРезультатРасчетаПредварительный КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.НовыйУзелПриемник";
	
	Если НЕ СРасшифровкойПолей Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТУзлыНДСДляРешенияСЛУ", "");
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|" + "
	|ВЫБРАТЬ
	|	Т.НомерУзла КАК НомерУзла,
	|	НовыеУзлы.НомерУзла КАК НомерУзлаСебестоимости,
	|	НовыеУзлы.НомерУзлаНДС КАК НомерУзлаНДС,
	|
	|	УзлыСебестоимости.Организация КАК Организация,
	|	УзлыСебестоимости.РазделУчета,
	|	УзлыСебестоимости.АналитикаУчетаНоменклатуры,
	|	УзлыСебестоимости.ВидЗапасов,
	|	УзлыСебестоимости.Партия,
	|	УзлыСебестоимости.АналитикаУчетаПартий,
	|	УзлыСебестоимости.ВидДеятельностиНДС,
	|	УзлыСебестоимости.АналитикаФинансовогоУчета,
	|
	|	УзлыНДС.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	УзлыНДС.СтатьяРасходов КАК СтатьяРасходов,
	|	УзлыНДС.АналитикаРасходов КАК АналитикаРасходов,
	|	УзлыНДС.ДокументПоступления,
	|	УзлыНДС.АналитикаУчетаПартийДокументаПоступления,
	|
	|	ЕСТЬNULL(УзлыНДС.ЭтоОстаткиПостатейныеПеременные, ЛОЖЬ) КАК ЭтоОстаткиПостатейныеПеременные,
	|	ЕСТЬNULL(УзлыНДС.ЭтоОстаткиПостатейныеПостоянные, ЛОЖЬ) КАК ЭтоОстаткиПостатейныеПостоянные,
	|	ЕСТЬNULL(УзлыНДС.ЭтоДопРасходы, ЛОЖЬ) КАК ЭтоДопРасходы,
	|	ЕСТЬNULL(УзлыНДС.ЭтоПеременныеДопРасходы, ЛОЖЬ) КАК ЭтоПеременныеДопРасходы,
	|
	|	ЕСТЬNULL(ОстаткиСебестоимости.Количество, 0) КАК КоличествоПартии,
	|	Т.ИсходнаяЗатрата,
	|	УзлыНДС.СтоимостьСНДС,
	|	УзлыНДС.СтоимостьБезНДС,
	|	УзлыНДС.СтоимостьБезНДСРегл,
	|	УзлыНДС.НДСРегл,
	|	УзлыНДС.СтоимостьБезНДСУпр,
	|	УзлыНДС.НДСУпр,
	|	ВЫБОР КОГДА Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК СписаниеНДС
	|ИЗ
	|	ВТНовыеУзлы КАК НовыеУзлы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУзлыНДСДляРешенияСЛУ КАК Т
	|		ПО Т.НомерУзла = НовыеУзлы.НовыйНомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИсходныеУзлыСебестоимостиИНДС КАК УзлыНДС
	|		ПО НовыеУзлы.НомерУзлаНДС = УзлыНДС.НомерУзлаГруппаНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимости КАК УзлыСебестоимости
	|		ПО УзлыСебестоимости.НомерУзла = НовыеУзлы.НомерУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК ОстаткиСебестоимости
	|			ПО ОстаткиСебестоимости.Организация = УзлыСебестоимости.Организация
	|			И ОстаткиСебестоимости.РазделУчета = УзлыСебестоимости.РазделУчета
	|			И ОстаткиСебестоимости.АналитикаУчетаНоменклатуры = УзлыСебестоимости.АналитикаУчетаНоменклатуры
	|			И ОстаткиСебестоимости.ВидЗапасов = УзлыСебестоимости.ВидЗапасов
	|			И ОстаткиСебестоимости.Партия = УзлыСебестоимости.Партия
	|			И ОстаткиСебестоимости.АналитикаУчетаПартий = УзлыСебестоимости.АналитикаУчетаПартий
	|			И ОстаткиСебестоимости.ВидДеятельностиНДС = УзлыСебестоимости.ВидДеятельностиНДС
	|			И ОстаткиСебестоимости.АналитикаФинансовогоУчета = УзлыСебестоимости.АналитикаФинансовогоУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСвязиНДС()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.НовыйУзелИсточник КАК Источник,
	|	Т.НовыйУзелПриемник КАК Приемник,
	|	МАКСИМУМ(ЕСТЬNULL(-СвязиУзловСебестоимости.Вес, 0)) КАК Вес,
	|	МАКСИМУМ(ВЫБОР КОГДА Т.ВыполнитьСписаниеНДС
	|		ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-СвязиУзловСебестоимости.Вес, 0)
	|	КОНЕЦ) КАК ВесНДС,
	|	МАКСИМУМ(ВЫБОР КОГДА СвязиУзловПеределов.НомерУзлаИсточник ЕСТЬ НЕ NULL
	|		ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-СвязиУзловСебестоимости.Вес, 0)
	|	КОНЕЦ) КАК ВесПередел
	|ИЗ
	|	ВТРезультатРасчетаПредварительный КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСвязиУзловКорректировкиСебестоимостиСоСписаниемНДС КАК СвязиУзловСебестоимости
	|			ПО Т.УзелИсточник = СвязиУзловСебестоимости.НомерУзлаИсточник
	|			И Т.УзелПриемник = СвязиУзловСебестоимости.НомерУзлаПриемник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСвязиУзловКорректировкиСебестоимостиСоСменойПартии КАК СвязиУзловПеределов
	|			ПО Т.УзелИсточник = СвязиУзловПеределов.НомерУзлаИсточник
	|			И Т.УзелПриемник = СвязиУзловПеределов.НомерУзлаПриемник
	|ГДЕ
	|	Т.НовыйУзелИсточник <> -1
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.НовыйУзелИсточник,
	|	Т.НовыйУзелПриемник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.НовыйУзелПриемник,
	|	Т.НовыйУзелПриемник,
	|	МАКСИМУМ(УзлыСебестоимости.Вес),
	|	МАКСИМУМ(ВЫБОР КОГДА Т.ВыполнитьСписаниеНДС
	|		ТОГДА 0
	|		ИНАЧЕ УзлыСебестоимости.Вес
	|	КОНЕЦ) КАК ВесНДС,
	|	МАКСИМУМ(УзлыСебестоимости.Вес) КАК ВесПередел
	|ИЗ
	|	ВТРезультатРасчетаПредварительный КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировкиСебестоимости КАК УзлыСебестоимости
	|			ПО Т.УзелПриемник = УзлыСебестоимости.НомерУзла
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.НовыйУзелПриемник";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДанныеДляРешенияСЛУНДС(ПараметрыРасчета) Экспорт
	
	Результат = Новый Структура("Узлы, Связи, ТекстОшибки");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
		
	Попытка
		
		Запрос.Текст = ТекстЗапросаУзлыНДС(Истина);
		Результат.Узлы = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = ТекстЗапросаСвязиНДС();
		Результат.Связи = Запрос.Выполнить().Выгрузить();
		
	Исключение
		
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, НовыеВТ);
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа_РасчетПартийНДС2_4ПоДопРасходам

// Инициализация данных

Функция ПоляПотребленийРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета)
	
	Возврат "Организация, Подразделение, НаправлениеДеятельности, СтатьяРасходовАктивов, АналитикаРасходов";
	
КонецФункции

Функция ОписаниеЦепочекРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета)
	
	ОписаниеЦепочек = Новый Соответствие;
	
	ПоляСвязи = ПоляПотребленийРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета);
	
	#Область БазаДопРасходыРегл
	
	Источники = Новый Соответствие;
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияРегл);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(
		ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл,
		ПоляСвязи,
		Источники);
	
	#КонецОбласти
	
	#Область БазаДопРасходыУпр
	
	Источники = Новый Соответствие;
	Источники.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияУпр);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьОписаниеПриемника(
		ОписаниеЦепочек,
		Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр,
		ПоляСвязи,
		Источники);
	
	#КонецОбласти
	
	Возврат ОписаниеЦепочек;
	
КонецФункции

Функция ОписаниеДвиженийРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета)
	
	КолонкиТаблицыРаспределения = ТаблицаРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета).Колонки;
	
	ОписаниеДвижений = РасчетСебестоимостиПрикладныеАлгоритмы.ОписаниеДвижений();
	ОписаниеДвижений.Вставить("Контекст", "РаспределениеПартийНДСФИФОСкользящаяПоДопРасходам");
	ОписаниеДвижений.Вставить("ИмяВременнойТаблицы", "ВТДопРасходыДляПостатейныхЗатрат");
	ОписаниеДвижений.Вставить("ПоляИндексирования", "АналитикаУчетаНоменклатуры");
	ОписаниеДвижений.Вставить("ПоляРасчета", РасчетСебестоимостиПрикладныеАлгоритмы.ПереченьПолей(КолонкиТаблицыРаспределения));
	ОписаниеДвижений.Вставить("КлючиСравнения",	ПоляПотребленийРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета));
	ОписаниеДвижений.Вставить("Показатели", "Знаменатель, СтоимостьБезНДС, НДС, СтоимостьУпр, СтоимостьБезНДСУпр, НДСУпр");
	ОписаниеДвижений.Вставить("БазисПрихода", "Знаменатель");
	ОписаниеДвижений.Вставить("БазисРасхода", "Знаменатель");
	ОписаниеДвижений.Вставить("КлючРасхода", "ДокументИсточник");
	ОписаниеДвижений.Вставить("ПолеПорядка", "ПериодПоступления");
	ОписаниеДвижений.Вставить("ПоляСортировки", "Партия");
	ОписаниеДвижений.Вставить("СортировкаПоУсловию", Истина);
	
	ОписаниеДвижений.Вставить("ПоляСуммирования", "СтоимостьБезНДС, НДС, СтоимостьУпр, СтоимостьБезНДСУпр, НДСУпр");
	ОписаниеДвижений.Вставить("ПоляГруппировки",  
		РасчетСебестоимостиПрикладныеАлгоритмы.ПереченьПолей(КолонкиТаблицыРаспределения, ОписаниеДвижений.ПоляСуммирования));
	ОписаниеДвижений.Вставить("УменьшатьБазис", Истина);
	ОписаниеДвижений.Вставить("УдалятьСтрокиБезИсточников", Истина);
	
	ОписаниеДвижений.Вставить("ВременныеТаблицыДляСледующихЭтапов", "ВТДопРасходыДляРаспределенияФИФО");
	
	Возврат ОписаниеДвижений;
	
КонецФункции

Функция ОписаниеНезаписываемыхРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета, НезаписываемыеТипыЗаписей = Неопределено)
	
	Если НезаписываемыеТипыЗаписей = Неопределено Тогда
		НезаписываемыеТипыЗаписей = Новый Соответствие;
	КонецЕсли;
	
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл, 	  		  Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр, 		  	  Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияРегл, Истина);
	НезаписываемыеТипыЗаписей.Вставить(Перечисления.ТипыЗаписейПартий.ДопРасходыДляРаспределенияУпр,  Истина);
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ОписаниеНезаписываемыхДанных(Ложь, НезаписываемыеТипыЗаписей);
	
КонецФункции

Функция ТаблицаРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета, ТекстОписаниеДанныхДляРаспределениеПартийНДСФИФОСкользящая());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета)
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"ДокументПоступления", // разделитель
		"Знаменатель, СтоимостьСНДС, СтоимостьБезНДС, СтоимостьБезНДСРегл, НДСРегл, СтоимостьБезНДСУпр, НДСУпр", // ресурсы
		"Период, Приоритет ВОЗР, Организация, Партия, АналитикаУчетаПартий, Регистратор"); // порядок
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета),
		ПараметрыНумерации);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = "";
	
	ЕстьТаблицаДопРасходов = Ложь;
	//++ Локализация
	ЕстьТаблицаДопРасходов = Истина;
	//-- Локализация
	
	// выборка данных
	Если НЕ ЕстьТаблицаДопРасходов Тогда
	 	ТекстЗапроса = ТекстРаспределениеДопРасходов() + ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса
		+ ТекстДопРасходыДляРаспределенияФИФО()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
		+ ТекстОписаниеДанныхДляРаспределениеПартийНДСФИФОСкользящая() //вт Данные
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДопРасходыДляРаспределенияРегл()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстБазаДопРасходыРегл()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДопРасходыДляРаспределенияУпр()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстБазаДопРасходыУпр()
		+ "";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// ... выборки данных

Функция ТекстДопРасходыДляРаспределенияФИФО() // ВТДопРасходыДляРаспределенияФИФО, использует ВТДопРасходыДляРаспределения
	Возврат 
		"ВЫБРАТЬ
		|	1 КАК Источник,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.СтатьяРасходов КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Т.ДокументПоступления КАК ДокументПоступления,
		|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Т.СтоимостьРегл,
		|	Т.НДСРегл,
		|	Т.Стоимость,
		|	Т.СтоимостьБезНДС,
		|	Т.СтоимостьБезНДСУпр,
		|	Т.НДСУпр,
		|	Т.ЗнаменательРегл,
		|	Т.ЗнаменательУпр
		|ПОМЕСТИТЬ ВТДопРасходыДляРаспределенияФИФО
		|ИЗ
		|	ВТДопРасходыДляРаспределения КАК Т
		|ГДЕ
		|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2 КАК Источник,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Партии.ДокументПоступления КАК ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК СтоимостьРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК НДСРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьСНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК Стоимость,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК НДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК ЗнаменательРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьСНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК ЗнаменательУпр
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиЗатратНаСебестоимость КАК Статьи
		|		ПО Статьи.Ссылка = Т.СтатьяРасходовСписания
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшДетализацияСебестоимостиПартииТоваров КАК Партии
		|		ПО Партии.Организация = Т.Организация
		|		И Партии.Партия = Т.Партия
		|		И Партии.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|		И Партии.ВидЗапасов = Т.ВидЗапасов
		|		И Партии.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
		|		И Партии.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
		|		И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ИЛИ Т.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатурыНЗП)
		|ГДЕ
		|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И Т.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость)
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания,
		|	Т.АналитикаРасходов,
		|	Партии.ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3 КАК Источник,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Партии.ДокументПоступления КАК ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК СтоимостьРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК НДСРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьСНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК Стоимость,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК НДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК ЗнаменательРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьСНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК ЗнаменательУпр
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиЗатратНаСебестоимость КАК Статьи
		|		ПО Статьи.Ссылка = Т.СтатьяРасходовСписания
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Партии
		|		ПО Партии.Организация = Т.Организация
		|		И Партии.Партия = Т.Партия
		|		И Партии.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|		И Партии.ВидЗапасов = Т.ВидЗапасов
		|		И Партии.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
		|		И Партии.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
		|		И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ИЛИ Т.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатурыНЗП)
		|ГДЕ
		|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И Партии.ПериодРегистрации < &НачалоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания,
		|	Т.АналитикаРасходов,
		|	Партии.ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4 КАК Источник,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Партии.ДокументПоступления КАК ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК СтоимостьРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК НДСРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьСНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК Стоимость,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК НДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК ЗнаменательРегл,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьСНДС * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК ЗнаменательУпр
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиЗатратНаСебестоимость КАК Статьи
		|		ПО Статьи.Ссылка = Т.СтатьяРасходовСписания
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Партии
		|		ПО Партии.Организация = Т.Организация
		|		И Партии.Партия = Т.Партия
		|		И Партии.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|		И Партии.ВидЗапасов = Т.ВидЗапасов
		|		И Партии.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
		|		И Партии.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
		|		И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ИЛИ Т.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатурыНЗП)
		|ГДЕ
		|	Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И Партии.ПериодРегистрации < &НачалоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания,
		|	Т.АналитикаРасходов,
		|	Партии.ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация
		|ИНДЕКСИРОВАТЬ ПО
		|	СтатьяРасходов,
		|	АналитикаРасходов,
		|	Подразделение,
		|	Организация,
		|	НаправлениеДеятельности
		|"
КонецФункции

Функция ТекстДопРасходыДляРаспределенияРегл() // использует ВТДопРасходыДляРаспределенияФИФО
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДопРасходыДляРаспределенияРегл"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыДляРаспределенияРегл) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	База.ЗнаменательРегл		 				КАК Знаменатель,
		|	0											КАК ЗнаменательДляИсточников,
		|	ИСТИНА 										КАК РасчетЗавершен,
		|	
		|	ДД.Период,
		|	ДД.Период КАК ПериодПоступления,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|
		|	0 КАК СтоимостьСНДС,
		|	0 КАК СтоимостьБезНДС,
		|	ДД.СтоимостьРегл КАК СтоимостьБезНДСРегл,
		|	ДД.НДСРегл КАК НДСРегл,
		|	0 КАК СтоимостьБезНДСУпр,
		|	0 КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК КорНаправлениеДеятельности,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТДопРасходыДляРаспределенияФИФО КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБазаРаспределенияДопРасходовСводно КАК База
		|		ПО ДД.Организация = База.Организация
		|		И ДД.Подразделение = База.Подразделение
		|		И ДД.НаправлениеДеятельности = База.НаправлениеДеятельности
		|		И ДД.СтатьяРасходов = База.СтатьяРасходов
		|		И ДД.АналитикаРасходов = База.АналитикаРасходов
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И База.ЗнаменательРегл <> 0
		|	И (ДД.СтоимостьРегл <> 0 ИЛИ ДД.НДСРегл <> 0)
		|";
КонецФункции

Функция ТекстБазаДопРасходыРегл()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстБазаДопРасходыРегл"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.БазаДопРасходыРегл) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	ДД.ЗнаменательРегл							КАК Знаменатель,
		|	0 											КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ 										КАК РасчетЗавершен,
		|	
		|	ДД.Период КАК Период,
		|	ДД.Период КАК ПериодПоступления,
		|	ДД.Регистратор КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|
		|	0 КАК СтоимостьСНДС,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьБезНДСРегл,
		|	0 КАК НДСРегл,
		|	0 КАК СтоимостьБезНДСУпр,
		|	0 КАК НДСУпр,
		|
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	ДД.РазделУчета,
		|	ДД.АналитикаФинансовогоУчета,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТБазаРаспределенияДопРасходов КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И ДД.ЗнаменательРегл <> 0
		|";
КонецФункции

Функция ТекстДопРасходыДляРаспределенияУпр() // использует ВТДопРасходыДляРаспределенияФИФО
	Возврат
		"ВЫБРАТЬ
		|	""ТекстДопРасходыДляРаспределенияУпр"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыДляРаспределенияУпр) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	База.ЗнаменательУпр		 					КАК Знаменатель,
		|	0											КАК ЗнаменательДляИсточников,
		|	ИСТИНА 										КАК РасчетЗавершен,
		|	
		|	ДД.Период,
		|	ДД.Период КАК ПериодПоступления,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Организация,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|
		|	ДД.Стоимость КАК СтоимостьСНДС,
		|	ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьБезНДСРегл,
		|	0 КАК НДСРегл,
		|	ДД.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
		|	ДД.НДСУпр КАК НДСУпр,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК КорНаправлениеДеятельности,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТДопРасходыДляРаспределенияФИФО КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБазаРаспределенияДопРасходовСводно КАК База
		|		ПО ДД.Организация = База.Организация
		|		И ДД.Подразделение = База.Подразделение
		|		И ДД.НаправлениеДеятельности = База.НаправлениеДеятельности
		|		И ДД.СтатьяРасходов = База.СтатьяРасходов
		|		И ДД.АналитикаРасходов = База.АналитикаРасходов
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И База.ЗнаменательУпр <> 0
		|	И (ДД.Стоимость <> 0 ИЛИ ДД.СтоимостьБезНДС <> 0 ИЛИ ДД.НДСУпр <> 0)
		|";
КонецФункции

Функция ТекстБазаДопРасходыУпр()
	Возврат
		"ВЫБРАТЬ
		|	""ТекстБазаДопРасходыУпр"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.БазаДопРасходыУпр) КАК ТипЗаписи,
		|	ЛОЖЬ 										КАК ЭтоСторно,
		|	0 											КАК Приоритет,
		|	ДД.ЗнаменательУпр							КАК Знаменатель,
		|	0 											КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ 										КАК РасчетЗавершен,
		|	
		|	ДД.Период КАК Период,
		|	ДД.Период КАК ПериодПоступления,
		|	ДД.Регистратор КАК Регистратор,
		|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
		|	ДД.Организация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПоступления,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|
		|	0 КАК СтоимостьСНДС,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьБезНДСРегл,
		|	0 КАК НДСРегл,
		|	0 КАК СтоимостьБезНДСУпр,
		|	0 КАК НДСУпр,
		|
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивов,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяСписанияНДС,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
		|	ДД.РазделУчета,
		|	ДД.АналитикаФинансовогоУчета,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТБазаРаспределенияДопРасходов КАК ДД
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И ДД.ЗнаменательУпр <> 0
		|";
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа_РасчетПартийНДС2_4ПоПартиямПрочихРасходов

//++ Локализация
// Инициализация данных

Функция ТаблицаРаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,	ТекстОписаниеДанныхДляРаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляРаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета)
	
	ДопПараметры = ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа;
	ДопПараметры.Вставить("РасчетПоПартиямПрочихРасходов", Истина);
	
	ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
		"ДокументПоступления", // разделитель
		"Знаменатель, ЗнаменательУпр, ЗнаменательДляИсточников, ЗнаменательДляИсточниковУпр, СтоимостьСНДС, СтоимостьБезНДС, СтоимостьБезНДСРегл, НДСРегл, НДСУпр", // ресурсы
		"ТипЗаписи, Знаменатель УБЫВ, ЗнаменательУпр УБЫВ, Период, Организация, Партия, АналитикаУчетаПартий, Регистратор"); // порядок
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляРаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета),
		ПараметрыНумерации);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляРаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// подготовка временных таблиц
		""
		+ ТекстИнициализацияРаспределениеПартийНДСФИФОСкользящая() + ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
		+ ТекстДвиженияСебестоимостиНДСФИФОСкользящая() + ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
		// выборка данных
		+ ТекстОписаниеДанныхДляРаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов() //вт Данные
		+ "";
		
	Возврат ТекстЗапроса;
	
КонецФункции

//-- Локализация
//
// ... описания данных

Функция ТекстОписаниеДанныхДляРаспределениеПартийНДСФИФОСкользящая() Экспорт
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) 								 КАК ЗапросИсточник,
		|	Себестоимость.ТипЗаписи 									 КАК ТипЗаписи,
		|	ЛОЖЬ														 КАК ЭтоСторно,
		|	0 															 КАК Приоритет,
		|	0 															 КАК Знаменатель,
		|	0 															 КАК ЗнаменательДляИсточников,
		|	ЛОЖЬ 														 КАК РасчетЗавершен,
		|	
		|	Себестоимость.Период,
		|	Себестоимость.Период КАК ПериодПоступления,
		|	Себестоимость.Регистратор,
		|	Себестоимость.ВидДвижения,
		|	ДД.Организация,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) 				      КАК ВидЗапасов,
		|	Себестоимость.КорАналитикаУчетаНоменклатуры,
		|	Себестоимость.КорВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	Себестоимость.ВидДеятельностиНДС,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
		|
		|
		|	0 КАК СтоимостьСНДС,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьБезНДСРегл,
		|	0 КАК НДСРегл,
		|	0 КАК СтоимостьБезНДСУпр,
		|	0 КАК НДСУпр,
		|
		|	Себестоимость.ХозяйственнаяОперация,
		|	Себестоимость.КорВидДеятельностиНДС,
		|	ДД.Организация КАК КорОрганизация,
		|	ДД.Партия КАК КорПартия,
		|	ДД.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	Себестоимость.КорНаправлениеДеятельности,
		|	Себестоимость.Подразделение,
		|	ПартииПрочихРасходов.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ПартииПрочихРасходов.АналитикаРасходов,
		|	ПартииПрочихРасходов.АналитикаАктивовПассивов КАК АналитикаАктивов,
		|	Себестоимость.СтатьяРасходовСписания КАК КорСтатьяРасходов,
		|	Себестоимость.АналитикаРасходов КАК КорАналитикаРасходов,
		|	Себестоимость.Подразделение КорПодразделение,
		|	Себестоимость.ДокументИсточник,
		|	Себестоимость.СтатьяРасходовСписания КАК СтатьяСписанияНДС,
		|	Себестоимость.АналитикаРасходов КАК АналитикаСписанияНДС,
		|	Себестоимость.РазделУчета,
		|	Себестоимость.АналитикаФинансовогоУчета,
		|	Себестоимость.Сторно
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
		|		ПО ЛОЖЬ
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
		|		ПО ЛОЖЬ
		|";

	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхДляРаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов() Экспорт
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	Себестоимость.ТипЗаписи 									 КАК ТипЗаписи,
		|	0 															 КАК Знаменатель,
		|	0 															 КАК ЗнаменательУпр,
		|	0 															 КАК ЗнаменательДляИсточников,
		|	0 															 КАК ЗнаменательДляИсточниковУпр,
		|	
		|	Себестоимость.Период,
		|	Себестоимость.Регистратор,
		|	Себестоимость.ВидДвижения,
		|	ДД.Организация,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) 				      КАК ВидЗапасов,
		|	Себестоимость.КорАналитикаУчетаНоменклатуры,
		|	Себестоимость.КорВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	Себестоимость.ВидДеятельностиНДС,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
		|
		|
		|	0 КАК СтоимостьСНДС,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьБезНДСРегл,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр,
		|
		|	Себестоимость.ХозяйственнаяОперация,
		|	Себестоимость.КорВидДеятельностиНДС,
		|	ДД.Партия КАК КорПартия,
		|	ДД.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	Себестоимость.КорНаправлениеДеятельности,
		|	Себестоимость.Подразделение,
		|	ПартииПрочихРасходов.СтатьяРасходов КАК СтатьяРасходовАктивов,
		|	ПартииПрочихРасходов.АналитикаРасходов,
		|	Себестоимость.Подразделение КорПодразделение,
		|	Себестоимость.СтатьяРасходовСписания КАК СтатьяСписанияНДС,
		|	Себестоимость.АналитикаРасходов КАК АналитикаСписанияНДС,
		|	Себестоимость.РазделУчета,
		|	Себестоимость.АналитикаФинансовогоУчета
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
		|		ПО ЛОЖЬ
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
		|		ПО ЛОЖЬ
		|";

	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

//++ Локализация
// ... формирования временные таблиц

Функция ТекстИнициализацияРаспределениеПартийНДСФИФОСкользящая()
	Возврат
		"
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Цены.Цена КАК Цена
		|ПОМЕСТИТЬ ВТПлановыеЦены
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
		|		ПО ДД.АналитикаУчетаНоменклатуры = Ключи.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&КонецПериода, ВидЦены = &ВидПлановыхЦен) КАК Цены
		|		ПО Цены.Номенклатура   = Ключи.Номенклатура
		|		 И Цены.Характеристика = Ключи.Характеристика
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|	И ЕСТЬNULL(Цены.Цена, 0) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.РазделУчета,
		|	ДД.СтоимостьРегл
		|ПОМЕСТИТЬ ВТРасчетныеЦены
		|ИЗ
		|	ВТСтоимостьПартийТоваров КАК ДД
		|ГДЕ
		|	ДД.СтоимостьРегл <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ДД.РазделУчета,
		|	ВЫРАЗИТЬ(ДД.СтоимостьРегл / ДД.Количество КАК ЧИСЛО(31,2)) КАК СтоимостьРегл
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
		|		ПО Цены.Организация = ДД.Организация
		|		И Цены.Партия = ДД.Партия
		|		И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|		И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|		И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Цены.ВидЗапасов = ДД.ВидЗапасов
		|		И Цены.РазделУчета = ДД.РазделУчета
		|	
		|ГДЕ
		|	ДД.Регистратор = ДД.Партия
		|	И ДД.Количество <> 0
		|	И (Цены.Организация ЕСТЬ NULL
		|		ИЛИ Цены.СтоимостьРегл = 0)
		|	И ВЫРАЗИТЬ(ДД.СтоимостьРегл / ДД.Количество КАК ЧИСЛО(31,2)) <> 0
		|	И НЕ ДД.Сторно
		|	И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика КАК Характеристика,
		|	СУММА(ДД.Знаменатель) КАК Знаменатель
		|ПОМЕСТИТЬ ВТЗнаменателиПоНоменклатуре
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.РазделУчета,
		|		ДД.Организация,
		|		ДД.Партия,
		|		ДД.АналитикаУчетаПартий,
		|		ДД.АналитикаФинансовогоУчета,
		|		ДД.ВидДеятельностиНДС,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ВидЗапасов,
		|		ВЫРАЗИТЬ(
		|			ВЫРАЗИТЬ(ДД.Количество КАК ЧИСЛО(15, 3)) 
		|			* ВЫРАЗИТЬ(ЕСТЬNULL(Цены.СтоимостьРегл,	ЕСТЬNULL(ПлановыеЦены.Цена, 0)) КАК ЧИСЛО(31, 10))
		|		  КАК ЧИСЛО(31, 2)) КАК Знаменатель
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетныеЦены КАК Цены
		|			ПО Цены.Организация = ДД.Организация
		|			И Цены.Партия = ДД.Партия
		|			И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|			И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ДД.ВидЗапасов
		|			И Цены.РазделУчета = ДД.РазделУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЦены КАК ПлановыеЦены
		|			ПО ПлановыеЦены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|	ГДЕ
		|		ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|		И ДД.СлужебноеВидДвиженияПриход
		|		И ДД.ТипЗаписи В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|		И НЕ ДД.Сторно
		|		И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.РазделУчета,
		|		ДД.Организация,
		|		ДД.Партия,
		|		ДД.АналитикаУчетаПартий,
		|		ДД.АналитикаФинансовогоУчета,
		|		ДД.ВидДеятельностиНДС,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ВидЗапасов,
		|		ВЫРАЗИТЬ(
		|			ВЫРАЗИТЬ(ДД.КоличествоОстаток КАК ЧИСЛО(15, 3)) 
		|			* ВЫРАЗИТЬ(ЕСТЬNULL(Цены.СтоимостьРегл,	ЕСТЬNULL(ПлановыеЦены.Цена, 0)) КАК ЧИСЛО(31, 10))
		|		  КАК ЧИСЛО(31, 2)) КАК Знаменатель
		|	ИЗ
		|		РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаКонецПредыдущегоПериода,
		|			Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|			И РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)) КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетныеЦены КАК Цены
		|			ПО Цены.Организация = ДД.Организация
		|			И Цены.Партия = ДД.Партия
		|			И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|			И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ДД.ВидЗапасов
		|			И Цены.РазделУчета = ДД.РазделУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЦены КАК ПлановыеЦены
		|			ПО ПлановыеЦены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|	) КАК ДД
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура,
		|	ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика
		|ИМЕЮЩИЕ
		|	СУММА(ДД.Знаменатель) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДД.Регистратор КАК Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета КАК РазделУчета,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.ЭтоДопРасходы КАК ЭтоДопРасходы,
		|	СУММА(ДД.ЗнаменательПриход) КАК Знаменатель,
		|	СУММА(ДД.ЗнаменательРасход) КАК ЗнаменательДляИсточников
		|ПОМЕСТИТЬ ЗнаменателиПриходов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Регистратор КАК Регистратор,
		|		ЛОЖЬ КАК ЭтоДопРасходы,
		|		ИСТИНА КАК ЕстьПриход,
		|		ЛОЖЬ КАК ЕстьРасход,
		|		ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|		ДД.РазделУчета КАК РазделУчета,
		|		ДД.ВидЗапасов КАК ВидЗапасов,
		|		ДД.Организация КАК Организация,
		|		ДД.Партия КАК Партия,
		|		ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|		ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|		ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|		ВЫРАЗИТЬ(СУММА(
		|			ВЫРАЗИТЬ(ДД.Количество КАК ЧИСЛО(15, 3)) 
		|			* ВЫРАЗИТЬ(ЕСТЬNULL(Цены.СтоимостьРегл,	ЕСТЬNULL(ПлановыеЦены.Цена, 0)) КАК ЧИСЛО(31, 10)))
		|		  КАК ЧИСЛО(31, 2)) КАК ЗнаменательПриход,
		|		0 КАК ЗнаменательРасход
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетныеЦены КАК Цены
		|			ПО Цены.Организация = ДД.Организация
		|			И Цены.Партия = ДД.Партия
		|			И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|			И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ДД.ВидЗапасов
		|			И Цены.РазделУчета = ДД.РазделУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЦены КАК ПлановыеЦены
		|			ПО ПлановыеЦены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|	ГДЕ
		|		ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|		И ДД.СлужебноеВидДвиженияПриход
		|		И НЕ ДД.ТипЗаписи В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства)
		|		И НЕ ДД.Сторно
		|		И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|	СГРУППИРОВАТЬ ПО
		|		ДД.Регистратор,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.РазделУчета,
		|		ДД.ВидЗапасов,
		|		ДД.Организация,
		|		ДД.Партия,
		|		ДД.АналитикаУчетаПартий,
		|		ДД.АналитикаФинансовогоУчета,
		|		ДД.ВидДеятельностиНДС
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.Регистратор КАК Регистратор,
		|		ИСТИНА КАК ЭтоДопРасходы,
		|		ИСТИНА КАК ЕстьПриход,
		|		ЛОЖЬ КАК ЕстьРасход,
		|		ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|		ДД.РазделУчета КАК РазделУчета,
		|		ДД.ВидЗапасов КАК ВидЗапасов,
		|		ДД.Организация КАК Организация,
		|		ДД.Партия КАК Партия,
		|		ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|		ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|		ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|		МАКСИМУМ(ЕСТЬNULL(Знаменатели.Знаменатель, 0)) КАК ЗнаменательПриход,
		|		0 КАК ЗнаменательРасход
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗнаменателиПоНоменклатуре КАК Знаменатели
		|			ПО Знаменатели.Организация = ДД.Организация
		|			И Знаменатели.Партия = ДД.Партия
		|			И Знаменатели.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Знаменатели.Номенклатура = ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|			И Знаменатели.Характеристика = ДД.АналитикаУчетаНоменклатуры.Характеристика
		|	ГДЕ
		|		ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|		И ДД.СлужебноеВидДвиженияПриход
		|		И ДД.ТипЗаписи В (
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией))
		|		И НЕ ДД.Сторно
		|		И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|	СГРУППИРОВАТЬ ПО
		|		ДД.Регистратор,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.РазделУчета,
		|		ДД.ВидЗапасов,
		|		ДД.Организация,
		|		ДД.Партия,
		|		ДД.АналитикаУчетаПартий,
		|		ДД.АналитикаФинансовогоУчета,
		|		ДД.ВидДеятельностиНДС
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ИСТИНА,
		|		ДД.КорАналитикаУчетаНоменклатуры,
		|		ДД.КорРазделУчета,
		|		ДД.КорВидЗапасов,
		|		ВЫБОР КОГДА ДД.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА ДД.Организация ИНАЧЕ ДД.КорОрганизация КОНЕЦ,
		|		ДД.КорПартия,
		|		ДД.КорАналитикаУчетаПартий,
		|		ДД.КорАналитикаФинансовогоУчета,
		|		ДД.КорВидДеятельностиНДС,
		|		0,
		|		ВЫРАЗИТЬ(
		|			ВЫРАЗИТЬ(ДД.Количество КАК ЧИСЛО(15, 3)) 
		|			* ВЫРАЗИТЬ(ЕСТЬNULL(Цены.СтоимостьРегл,	ЕСТЬNULL(ПлановыеЦены.Цена, 0)) КАК ЧИСЛО(31, 10))
		|		  КАК ЧИСЛО(31, 2))
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетныеЦены КАК Цены
		|			ПО Цены.Организация = ДД.Организация
		|			И Цены.Партия = ДД.Партия
		|			И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|			И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ДД.ВидЗапасов
		|			И Цены.РазделУчета = ДД.РазделУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЦены КАК ПлановыеЦены
		|			ПО ПлановыеЦены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|	ГДЕ
		|		ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|		И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		И НЕ ДД.СлужебноеВидДвиженияПриход
		|		И НЕ ДД.Сторно) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.ЭтоДопРасходы,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ДД.ЕстьПриход) = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Регистратор КАК Регистратор,
		|	СУММА(Т.Знаменатель) КАК Знаменатель
		|ПОМЕСТИТЬ ЗнаменателиРегистраторов
		|ИЗ
		|	ЗнаменателиПриходов КАК Т
		|ГДЕ
		|	Т.ЗнаменательДляИсточников <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Партия КАК Партия,
		|	СУММА(Т.Знаменатель) КАК Знаменатель
		|ПОМЕСТИТЬ ЗнаменателиПартий
		|ИЗ
		|	ЗнаменателиПриходов КАК Т
		|ГДЕ
		|	Т.ЗнаменательДляИсточников <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.РазделУчета,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Партии.ДокументПоступления КАК ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ТОГДА Т.ВидДеятельностиНДС
		|		ИНАЧЕ Т.КорВидДеятельностиНДС
		|	КОНЕЦ КАК КорВидДеятельностиНДС,
		|	Т.ХозяйственнаяОперация,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК НДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК НДСУпр
		|ПОМЕСТИТЬ ВТСебестоимостьСписаниеТоваров
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
		|		ПО Т.СтатьяРасходовСписания = Статьи.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшДетализацияСебестоимостиПартииТоваров КАК Партии
		|		ПО Партии.Организация = Т.Организация
		|		И Партии.Партия = Т.Партия
		|		И Партии.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|		И Партии.ВидЗапасов = Т.ВидЗапасов
		|		И Партии.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
		|		И Партии.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
		|		И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ИЛИ Т.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатурыНЗП)
		|ГДЕ
		|	Т.Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат)
		|	И НЕ Т.СлужебноеВидДвиженияПриход
		|	И Т.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
		|	И Т.Количество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.ВидДеятельностиНДС,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.РазделУчета,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания,
		|	Т.АналитикаРасходов,
		|	Партии.ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорНаправлениеДеятельности,
		|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ТОГДА Т.ВидДеятельностиНДС
		|		ИНАЧЕ Т.КорВидДеятельностиНДС
		|	КОНЕЦ,
		|	Т.ХозяйственнаяОперация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.РазделУчета,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Партии.ДокументПоступления КАК ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ТОГДА Т.ВидДеятельностиНДС
		|		ИНАЧЕ Т.КорВидДеятельностиНДС
		|	КОНЕЦ КАК КорВидДеятельностиНДС,
		|	Т.ХозяйственнаяОперация,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК НДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК НДСУпр
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
		|		ПО Т.СтатьяРасходовСписания = Статьи.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Партии
		|		ПО Партии.Организация = Т.Организация
		|		И Партии.Партия = Т.Партия
		|		И Партии.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|		И Партии.ВидЗапасов = Т.ВидЗапасов
		|		И Партии.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
		|		И Партии.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
		|		И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ИЛИ Т.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатурыНЗП)
		|ГДЕ
		|	Т.Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат)
		|	И НЕ Т.СлужебноеВидДвиженияПриход
		|	И Т.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
		|	И Т.Количество <> 0
		|	И Партии.ПериодРегистрации < &НачалоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.ВидДеятельностиНДС,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.РазделУчета,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания,
		|	Т.АналитикаРасходов,
		|	Партии.ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорНаправлениеДеятельности,
		|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ТОГДА Т.ВидДеятельностиНДС
		|		ИНАЧЕ Т.КорВидДеятельностиНДС
		|	КОНЕЦ,
		|	Т.ХозяйственнаяОперация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.РазделУчета,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Партии.ДокументПоступления КАК ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ТОГДА Т.ВидДеятельностиНДС
		|		ИНАЧЕ Т.КорВидДеятельностиНДС
		|	КОНЕЦ КАК КорВидДеятельностиНДС,
		|	Т.ХозяйственнаяОперация,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСРегл * Статьи.КоэффициентРегл КАК ЧИСЛО (31,2))) КАК НДС,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.СтоимостьБезНДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК СтоимостьБезНДСУпр,
		|	СУММА(ВЫРАЗИТЬ(Т.Количество * Партии.НДСУпр * Статьи.КоэффициентУпр КАК ЧИСЛО (31,2))) КАК НДСУпр
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
		|		ПО Т.СтатьяРасходовСписания = Статьи.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Партии
		|		ПО Партии.Организация = Т.Организация
		|		И Партии.Партия = Т.Партия
		|		И Партии.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|		И Партии.ВидЗапасов = Т.ВидЗапасов
		|		И Партии.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
		|		И Партии.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
		|		И (Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ИЛИ Т.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатурыНЗП)
		|ГДЕ
		|	Т.Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат)
		|	И НЕ Т.СлужебноеВидДвиженияПриход
		|	И Т.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
		|	И Т.Количество <> 0
		|	И Партии.ПериодРегистрации < &НачалоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.ВидДеятельностиНДС,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.РазделУчета,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовСписания,
		|	Т.АналитикаРасходов,
		|	Партии.ДокументПоступления,
		|	Партии.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорНаправлениеДеятельности,
		|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ТОГДА Т.ВидДеятельностиНДС
		|		ИНАЧЕ Т.КорВидДеятельностиНДС
		|	КОНЕЦ,
		|	Т.ХозяйственнаяОперация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоДопРасходы,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.СтатьяРасходов КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Т.ДокументПоступленияРасходов КАК ДокументПоступления,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(Т.Стоимость * Статьи.КоэффициентУпр) КАК Стоимость,
		|	СУММА(Т.СтоимостьБезНДС * Статьи.КоэффициентУпр) КАК СтоимостьБезНДС,
		|	СУММА(Т.СтоимостьРегл * Статьи.КоэффициентРегл) КАК СтоимостьРегл,
		|	СУММА(Т.НДСРегл * Статьи.КоэффициентРегл) КАК НДСРегл,
		|	СУММА(Т.НДСУпр * Статьи.КоэффициентУпр) КАК НДСУпр
		|ПОМЕСТИТЬ ВТПартииПрочихДляРаспределения2_4
		|ИЗ
		|	ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
		|		ПО Т.СтатьяРасходов = Статьи.Ссылка
		|ГДЕ
		|	Т.Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат)
		|	И Т.СлужебноеВидДвиженияПриход
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.СтатьяРасходов,
		|	Т.АналитикаРасходов,
		|	Т.ВидДеятельностиНДС,
		|	Т.ДокументПоступленияРасходов,
		|	Т.АналитикаУчетаПартий,
		|	Т.НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоДопРасходы,
		|	НЕОПРЕДЕЛЕНО КАК Регистратор,
		|	&НачалоПериода КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.СтатьяРасходов КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Т.ДокументПоступленияРасходов КАК ДокументПоступления,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	СУММА(Т.СтоимостьОстаток * Статьи.КоэффициентУпр) КАК Стоимость,
		|	СУММА(Т.СтоимостьБезНДСОстаток * Статьи.КоэффициентУпр) КАК СтоимостьБез,
		|	СУММА(Т.СтоимостьРеглОстаток * Статьи.КоэффициентРегл) КАК СтоимостьРегл,
		|	СУММА(Т.НДСРеглОстаток * Статьи.КоэффициентРегл) КАК НДСРегл,
		|	СУММА(Т.НДСУпрОстаток * Статьи.КоэффициентУпр) КАК НДСУпр
		|ИЗ
		|	РегистрНакопления.ПартииПрочихРасходов.Остатки(&ГраницаКонецПредыдущегоПериода,
		|		Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат)) КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
		|		ПО Т.СтатьяРасходов = Статьи.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.СтатьяРасходов,
		|	Т.АналитикаРасходов,
		|	Т.ВидДеятельностиНДС,
		|	Т.ДокументПоступленияРасходов,
		|	Т.АналитикаУчетаПартий,
		|	Т.НаправлениеДеятельности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоДопРасходы,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.СтатьяРасходов КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов,
		|	Т.ДокументПоступления КАК ДокументПоступления,
		|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	0 КАК Стоимость,
		|	0 КАК СтоимостьБезНДС,
		|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьРегл,
		|	СУММА(Т.НДС) КАК НДСРегл,
		|	СУММА(Т.НДСУпр) КАК НДСУпр
		|ИЗ
		|	ВТСебестоимостьСписаниеТоваров КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Партии
		|		ПО Партии.Организация = Т.Организация
		|		И Партии.Партия = Т.Партия
		|		И Партии.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|		И Партии.ВидЗапасов = Т.ВидЗапасов
		|		И Партии.Номенклатура = ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура
		|		И Партии.Характеристика = ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика
		|		И Партии.ДокументПоступления = Т.ДокументПоступления
		|		И Партии.АналитикаУчетаПартийДокументаПоступления = Т.АналитикаУчетаПартийДокументаПоступления
		|		И Партии.СтатьяРасходов = Т.СтатьяРасходов
		|ГДЕ
		|	Партии.Организация ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.Подразделение,
		|	Т.СтатьяРасходов,
		|	Т.АналитикаРасходов,
		|	Т.ДокументПоступления,
		|	Т.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС,
		|	Т.НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДопРасходы,
		|	Т.Регистратор КАК Регистратор,
		|	Т.Период КАК Период,
		|	Т.Организация КАК Организация,
		|	Т.КорПодразделение КАК Подразделение,
		|	Т.КорСтатьяРасходов КАК СтатьяРасходов,
		|	Т.КорАналитикаРасходов КАК АналитикаРасходов,
		|	Т.ДокументПоступления КАК ДокументПоступления,
		|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * Т.СтоимостьСНДС КАК ЧИСЛО(31,2))) КАК Стоимость,
		|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * Т.СтоимостьБезНДС КАК ЧИСЛО(31,2))) КАК СтоимостьБезНДС,
		|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * Т.СтоимостьБезНДСРегл КАК ЧИСЛО(31,2))) КАК СтоимостьРегл,
		|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * 
		|		ВЫБОР КОГДА Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|			ТОГДА 0
		|		ИНАЧЕ Т.НДСРегл КОНЕЦ КАК ЧИСЛО(31,2))) КАК НДСРегл,
		|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.Коэффициент, 1) * 
		|		ВЫБОР КОГДА Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|			ТОГДА 0
		|		ИНАЧЕ Т.НДСУпр КОНЕЦ КАК ЧИСЛО(31,2))) КАК НДСУпр
		|ИЗ
		|	ВТДопРасходыДляПостатейныхЗатрат КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
		|		ПО Т.КорСтатьяРасходов = Статьи.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаноменклатуры КАК Отбор
		|		ПО Т.АналитикаУчетаНоменклатуры = Отбор.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыДопРасходов КАК Коэффициенты
		|		ПО Т.Организация = Коэффициенты.Организация
		|		И Т.РазделУчета = Коэффициенты.РазделУчета
		|		И Т.АналитикаУчетаНоменклатуры = Коэффициенты.АналитикаУчетаНоменклатуры
		|		И Т.ВидЗапасов = Коэффициенты.ВидЗапасов
		|		И Т.Партия = Коэффициенты.Партия
		|		И Т.АналитикаУчетаПартий = Коэффициенты.АналитикаУчетаПартий
		|		И Т.ВидДеятельностиНДС = Коэффициенты.ВидДеятельностиНДС
		|		И Т.АналитикаФинансовогоУчета = Коэффициенты.АналитикаФинансовогоУчета
		|		И Т.Регистратор = Коэффициенты.Регистратор
		|ГДЕ
		|	Отбор.Ссылка ЕСТЬ NULL
		|	И Т.Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат)
		|	И Т.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.Период,
		|	Т.Организация,
		|	Т.КорПодразделение,
		|	Т.КорСтатьяРасходов,
		|	Т.КорАналитикаРасходов,
		|	Т.ДокументПоступления,
		|	Т.АналитикаУчетаПартийДокументаПоступления,
		|	Т.КорВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтатьяРасходов,
		|	Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ПОМЕСТИТЬ ВыполнятьРаспределениеПартийНДС2_4
		|ИЗ
		|	ВТПартииПрочихДляРаспределения2_4 КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Т.СтатьяРасходов КАК СтатьяРасходов,
		|	Т.АналитикаРасходов КАК АналитикаРасходов
		|ПОМЕСТИТЬ ВТАналитикиРаспределенияПартийПрочих2_4
		|ИЗ
		|	ВТПартииПрочихДляРаспределения2_4 КАК Т
		|";
КонецФункции

Функция ТекстДвиженияСебестоимостиНДСФИФОСкользящая()
	Возврат "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеАвто)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|
		|		ИНАЧЕ ДД.ТипЗаписи
		|	КОНЕЦ КАК ТипЗаписи,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения) ТОГДА ЛОЖЬ
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ЭтоСторно,
		|	МАКСИМУМ(ЕСТЬNULL(Знаменатели.Знаменатель, 0))
		|		+ СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Знаменатели.Знаменатель, 0) <> 0
		|				ТОГДА 0
		|				ИНАЧЕ ВЫРАЗИТЬ(
		|						ВЫРАЗИТЬ(ДД.Количество КАК ЧИСЛО(15, 3))
		|						* ВЫРАЗИТЬ(ЕСТЬNULL(Цены.СтоимостьРегл, ЕСТЬNULL(ПлановыеЦены.Цена, 0)) КАК ЧИСЛО(31, 10))
		|					  КАК ЧИСЛО(31,2))
		|		  КОНЕЦ) КАК Знаменатель,
		|	МАКСИМУМ(ЕСТЬNULL(Знаменатели.ЗнаменательДляИсточников, 0)) КАК ЗнаменательДляИсточников,
		|	СУММА(ДД.Количество) КАК Количество,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
		|	
		|	ДД.Период,
		|	ДД.Регистратор КАК Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ДД.Организация КАК Организация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА ДД.Партия
		|	КОНЕЦ КАК Партия,
		|	ЕСТЬNULL(АналитикиУчетаПартий.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)) КАК АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	ДД.КорОрганизация,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА ДД.КорПартия
		|	КОНЕЦ КАК КорПартия,
		|	ЕСТЬNULL(КорАналитикиУчетаПартий.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)) КАК КорАналитикаУчетаПартий,
		|	ЕСТЬNULL(ДД.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ДД.КорНаправлениеДеятельности) КАК КорНаправлениеДеятельности,
		|	ДД.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов КАК КорВидЗапасов,
		|	ДД.Подразделение,
		|	(ВЫБОР
		|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.СтатьяРасходовСписания
		|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
		|			ТОГДА ДД.СтатьяАктивовПассивов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов КАК АналитикаАктивов,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика)
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5)
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ) КАК ДокументИсточник,
		|	ДД.РазделУчета КАК РазделУчета,
		|	ДД.КорРазделУчета КАК КорРазделУчета,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.Сторно
		|ПОМЕСТИТЬ ДвиженияСебестоимостиНДС2_4
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗнаменателиПриходов КАК Знаменатели
		|		ПО Знаменатели.Регистратор = ДД.Регистратор
		|		И Знаменатели.Организация = ДД.Организация
		|		И Знаменатели.Партия = ДД.Партия
		|		И Знаменатели.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|		И Знаменатели.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Знаменатели.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|		И Знаменатели.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Знаменатели.ВидЗапасов = ДД.ВидЗапасов
		|		И Знаменатели.РазделУчета = ДД.РазделУчета
		|		И ДД.СлужебноеВидДвиженияПриход
		|		И НЕ (ДД.Сторно И ДД.Количество < 0)
		|		И ВЫБОР КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией))
		|			ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		  КОНЕЦ = Знаменатели.ЭтоДопРасходы
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетныеЦены КАК Цены
		|		ПО Цены.Организация = ДД.Организация
		|		И Цены.Партия = ДД.Партия
		|		И Цены.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|		И Цены.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|		И Цены.ВидДеятельностиНДС = ДД.ВидДеятельностиНДС
		|		И Цены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Цены.ВидЗапасов = ДД.ВидЗапасов
		|		И Цены.РазделУчета = ДД.РазделУчета
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеЦены КАК ПлановыеЦены
		|		ПО ПлановыеЦены.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборАналитикиУчетаПартийНДС2_4 КАК АналитикиУчетаПартий
		|		ПО ДД.АналитикаУчетаПартий = АналитикиУчетаПартий.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборАналитикиУчетаПартийНДС2_4 КАК КорАналитикиУчетаПартий
		|		ПО ДД.КорАналитикаУчетаПартий = КорАналитикиУчетаПартий.Ссылка
		|ГДЕ
		|	ДД.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И ДД.Партия <> НЕОПРЕДЕЛЕНО
		|	И ДД.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
		|	И ВЫБОР
		|		КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПотреблениеАвто),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПотреблениеПроизводство),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Распределение),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратНаДругойСклад))
		|			И ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				= ЕСТЬNULL(ДД.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|			И ДД.ВидДеятельностиНДС         = ДД.КорВидДеятельностиНДС
		|			И ДД.Партия         			= ДД.КорПартия
		|			И (ДД.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ИЛИ ДД.Организация = ДД.КорОрганизация)
		|			И ДД.КорРазделУчета	<> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|			
		|		КОГДА ДД.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеОбособленно),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеАвто),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноВозвратНаДругойСклад))
		|			И ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				= ЕСТЬNULL(ДД.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|			И ДД.ВидДеятельностиНДС         = ДД.КорВидДеятельностиНДС
		|			И ДД.Партия         			= ДД.КорПартия
		|			И (ДД.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ИЛИ ДД.Организация = ДД.КорОрганизация)
		|			ТОГДА ЛОЖЬ
		|			
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости)
		|			ТОГДА ЛОЖЬ
		|			
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ = ИСТИНА
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И НЕ ДД.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
		|	И (НЕ ДД.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов))
		|	  )
		|	И НЕ (ДД.Регистратор ССЫЛКА Документ.ПересортицаТоваров И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение))
		|	И НЕ (ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеАвто)
		|
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|
		|		ИНАЧЕ ДД.ТипЗаписи
		|	КОНЕЦ,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения) ТОГДА ЛОЖЬ
		|		КОГДА ДД.Количество < 0 ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ),
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.АналитикаУчетаНоменклатуры.Характеристика,
		|	ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
		|	ЕСТЬNULL(ДД.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ДД.КорНаправлениеДеятельности),
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ВЫБОР КОГДА ДД.СлужебноеВидДвиженияПриход
		|		 ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	ДД.Организация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА ДД.Партия
		|	КОНЕЦ,
		|	ЕСТЬNULL(АналитикиУчетаПартий.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)),
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорОрганизация,
		|	ВЫБОР
		|		КОГДА ИСТИНА
		|			ТОГДА ДД.КорПартия
		|	КОНЕЦ,
		|	ЕСТЬNULL(ДД.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
		|	ДД.Подразделение,
		|	(ВЫБОР
		|		КОГДА ДД.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		 И ДД.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.СтатьяРасходовСписания
		|		КОГДА ДД.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
		|			ТОГДА ДД.СтатьяАктивовПассивов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ),
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов,
		|	(ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика)
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|		 И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5)
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) И НЕ ДД.СлужебноеВидДвиженияПриход
		|		 И ДД.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
		|		 И ДД.ДокументИсточник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.ДокументИсточник КОНЕЦ),
		|	ДД.РазделУчета,
		|	ДД.КорРазделУчета,
		|	ЕСТЬNULL(КорАналитикиУчетаПартий.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.Сторно
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР КОГДА ДД.Знаменатель <> 0
		|			ТОГДА ДД.Знаменатель
		|			ИНАЧЕ ЕСТЬNULL(Знаменатели.Знаменатель, ЕСТЬNULL(ЗнаменателиПартий.Знаменатель, 0))
		|		КОНЕЦ) КАК Знаменатель,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ВЫБОР
		|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|		ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ ДД.КорАналитикаУчетаНоменклатуры
		|	КОНЕЦ КАК КорАналитикаУчетаНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ДД.КорВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|		ТОГДА ДД.ВидЗапасов
		|		ИНАЧЕ ДД.КорВидЗапасов
		|	КОНЕЦ КАК КорВидЗапасов,
		|	ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|		 И ДД.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.Партия
		|	КОНЕЦ КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.НаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаУчетаПартий,
		|	ВЫБОР
		|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ДД.КорНаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|		ТОГДА ДД.НаправлениеДеятельности
		|		ИНАЧЕ ДД.КорНаправлениеДеятельности
		|	КОНЕЦ КАК КорНаправлениеДеятельности,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.РазделУчета,
		|	ДД.АналитикаФинансовогоУчета
		|ПОМЕСТИТЬ ДвиженияСебестоимостиНДС2_4ДляРаспределения
		|ИЗ
		|	ДвиженияСебестоимостиНДС2_4 КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗнаменателиРегистраторов КАК Знаменатели
		|		ПО Знаменатели.Регистратор = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ ЗнаменателиПартий КАК ЗнаменателиПартий
		|		ПО ЗнаменателиПартий.Партия = ДД.Партия
		|ГДЕ
		|	ДД.Знаменатель <> 0
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|	И ИСТИНА В (ВЫБРАТЬ Т.ЕстьЗаписи ИЗ ВыполнятьРаспределениеПартийНДС2_4 КАК Т)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.ВидДвижения,
		|	ДД.Организация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов,
		|	ВЫБОР
		|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|		ТОГДА ДД.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ ДД.КорАналитикаУчетаНоменклатуры
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ДД.КорВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|		ТОГДА ДД.ВидЗапасов
		|		ИНАЧЕ ДД.КорВидЗапасов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Выпуск)
		|		 И ДД.Партия = НЕОПРЕДЕЛЕНО
		|			ТОГДА ДД.Регистратор
		|		ИНАЧЕ ДД.Партия
		|	КОНЕЦ,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.НаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаУчетаПартий,
		|	ВЫБОР
		|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ДД.КорНаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|		ТОГДА ДД.НаправлениеДеятельности
		|		ИНАЧЕ ДД.КорНаправлениеДеятельности
		|	КОНЕЦ,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.РазделУчета,
		|	ДД.АналитикаФинансовогоУчета
		|";
	КонецФункции
	

Функция ТекстЗапросаРаспределенияПартийНДС(ИмяТаблицыДанных, ИмяТаблицыСвязей)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.К,
	|	Т.НомерУзла,
	|	Т.Знаменатель,
	|	Т.ЗнаменательУпр,
	|	Т.СтоимостьСНДС,
	|	Т.СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл,
	|	Т.НДСРегл,
	|	Т.НДСУпр
	|ПОМЕСТИТЬ ТаблицаДанныхИндексированная
	|ИЗ
	|	ИмяТаблицыДанных КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	К
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Связи.Источник КАК Источник,
	|	Приемники.НомерУзла КАК Приемник,
	|	Приемники.Знаменатель,
	|	Приемники.ЗнаменательУпр
	|ПОМЕСТИТЬ ВТЗнаменателиПриемников
	|ИЗ
	|	ИмяТаблицыСвязей КАК Связи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхИндексированная КАК Приемники
	|		ПО Связи.Приемник = Приемники.К
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Источники.НомерУзла КАК Источник,
	|	Приемники.Приемник КАК Приемник,
	|	Приемники.Знаменатель,
	|	Приемники.ЗнаменательУпр,
	|
	|	Источники.СтоимостьСНДС КАК СтоимостьСНДСИсходная,
	|	Источники.СтоимостьБезНДС КАК СтоимостьБезНДСИсходная,
	|	Источники.СтоимостьБезНДСРегл КАК СтоимостьБезНДСРеглИсходная,
	|	Источники.НДСРегл КАК НДСРеглИсходная,
	|	Источники.НДСУпр КАК НДСУпрИсходная,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА Источники.ЗнаменательУпр = 0
	|		ТОГДА 0
	|		ИНАЧЕ Источники.СтоимостьСНДС * Приемники.ЗнаменательУпр / Источники.ЗнаменательУпр
	|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА Источники.ЗнаменательУпр = 0
	|		ТОГДА 0
	|		ИНАЧЕ Источники.СтоимостьБезНДС * Приемники.ЗнаменательУпр / Источники.ЗнаменательУпр
	|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА Источники.ЗнаменательУпр = 0
	|		ТОГДА 0
	|		ИНАЧЕ Источники.НДСУпр * Приемники.ЗнаменательУпр / Источники.ЗнаменательУпр
	|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК НДСУпр,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА Источники.Знаменатель = 0
	|		ТОГДА 0
	|		ИНАЧЕ Источники.СтоимостьБезНДСРегл * Приемники.Знаменатель / Источники.Знаменатель
	|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК СтоимостьБезНДСРегл,
	|	ВЫРАЗИТЬ(ВЫБОР КОГДА Источники.Знаменатель = 0
	|		ТОГДА 0
	|		ИНАЧЕ Источники.НДСРегл * Приемники.Знаменатель / Источники.Знаменатель
	|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК НДСРегл
	|ПОМЕСТИТЬ ВТРаспределениеПредварительное
	|ИЗ
	|	ВТЗнаменателиПриемников КАК Приемники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхИндексированная КАК Источники
	|		ПО Приемники.Источник = Источники.К
	|ГДЕ
	|	(Приемники.ЗнаменательУпр <> 0
	|		И Источники.ЗнаменательУпр <> 0
	|		И (Источники.СтоимостьСНДС <> 0
	|			ИЛИ Источники.СтоимостьБезНДС <> 0
	|			ИЛИ Источники.НДСУпр <> 0))
	|	ИЛИ
	|	(Приемники.Знаменатель <> 0
	|		И Источники.Знаменатель <> 0
	|		И (Источники.СтоимостьБезНДСРегл <> 0
	|			ИЛИ Источники.НДСРегл <> 0))
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	| УНИЧТОЖИТЬ ТаблицаДанныхИндексированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Источник,
	|	МАКСИМУМ(Т.СтоимостьСНДСИсходная) - СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	МАКСИМУМ(Т.СтоимостьБезНДСИсходная) - СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	МАКСИМУМ(Т.СтоимостьБезНДСРеглИсходная) - СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	МАКСИМУМ(Т.НДСРеглИсходная) - СУММА(Т.НДСРегл) КАК НДСРегл,
	|	МАКСИМУМ(Т.НДСУпрИсходная) - СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ВТРаспределениеКопейки
	|ИЗ
	|	ВТРаспределениеПредварительное КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Источник
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Т.СтоимостьСНДСИсходная) - СУММА(Т.СтоимостьСНДС) <> 0
	|	ИЛИ МАКСИМУМ(Т.СтоимостьБезНДСИсходная) - СУММА(Т.СтоимостьБезНДС) <> 0
	|	ИЛИ МАКСИМУМ(Т.СтоимостьБезНДСРеглИсходная) - СУММА(Т.СтоимостьБезНДСРегл) <> 0
	|	ИЛИ МАКСИМУМ(Т.НДСРеглИсходная) - СУММА(Т.НДСРегл) <> 0
	|	ИЛИ МАКСИМУМ(Т.НДСУпрИсходная) - СУММА(Т.НДСУпр) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Источник,
	|	Т.Приемник,
	|	СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
	|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|ПОМЕСТИТЬ ВТРаспределение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Источник,
	|		Т.Приемник,
	|		Т.СтоимостьСНДС,
	|		Т.СтоимостьБезНДС,
	|		Т.СтоимостьБезНДСРегл,
	|		Т.НДСРегл,
	|		Т.НДСУпр
	|	ИЗ
	|		ВТРаспределениеПредварительное КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.Источник,
	|		МИНИМУМ(Т.Приемник) КАК Приемник,
	|		0,
	|		0,
	|		Копейки.СтоимостьБезНДСРегл,
	|		Копейки.НДСРегл,
	|		0
	|	ИЗ
	|		ВТРаспределениеПредварительное КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаспределениеКопейки КАК Копейки
	|			ПО Т.Источник = Копейки.Источник
	|			И Т.Знаменатель <> 0
	|	СГРУППИРОВАТЬ ПО
	|		Т.Источник,
	|		Копейки.СтоимостьБезНДСРегл,
	|		Копейки.НДСРегл
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.Источник,
	|		МИНИМУМ(Т.Приемник) КАК Приемник,
	|		Копейки.СтоимостьСНДС,
	|		Копейки.СтоимостьБезНДС,
	|		0,
	|		0,
	|		Копейки.НДСУпр
	|	ИЗ
	|		ВТРаспределениеПредварительное КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаспределениеКопейки КАК Копейки
	|			ПО Т.Источник = Копейки.Источник
	|			И Т.ЗнаменательУпр <> 0
	|	СГРУППИРОВАТЬ ПО
	|		Т.Источник,
	|		Копейки.СтоимостьСНДС,
	|		Копейки.СтоимостьБезНДС,
	|		Копейки.НДСУпр
	|) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Источник,
	|	Т.Приемник
	|ИМЕЮЩИЕ
	|	СУММА(Т.СтоимостьСНДС) <> 0
	|	ИЛИ СУММА(Т.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(Т.СтоимостьБезНДСРегл) <> 0
	|	ИЛИ СУММА(Т.НДСРегл) <> 0
	|	ИЛИ СУММА(Т.НДСУпр) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыДанных", ИмяТаблицыДанных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыСвязей", ИмяТаблицыСвязей);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура СформироватьПромежуточныйРезультатРаспределенияПартийНДС(ПараметрыРасчета, Запрос, НомерШага)
	
	ТипыЗаписейДополнения = Новый Массив;
	
	Если НомерШага = 1 Тогда // доп. расходы по базе
		
		Пояснение = НСтр("ru = 'Доп. расходы по базе'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ИмяТаблицыИсточникаДанных = "ВТДанныеПостатейныеЗатратыПоУзлу";
		ИмяТаблицыРезультатаПредварительная = "ВТРезультатШаг1Предварительная";
		ИмяТаблицыРезультата = "ВТРезультатШаг1";
		ИмяТаблицыСвязей = "ВТСвязи1";
		
		ИмяПоляЗнаменательРегл = "Т.ЗнаменательДляИсточников";
		ИмяПоляЗнаменательУпр = "Т.ЗнаменательДляИсточниковУпр";
		ИмяПоляПартия = "Т.Партия";
		ИмяПоляАналитикаУчетаПартий = "Т.АналитикаУчетаПартий";
		ИмяПоляСтатьяКалькуляции = "Т.СтатьяКалькуляции";
		ИмяПоляГруппаПродукции = "Т.ГруппаПродукции";
		ИмяПоляПравилоОтнесенияНаВыпуск = "Т.ПравилоОтнесенияНаВыпуск";
		ИмяПоляХозяйственнаяОперация = "Источники.ХозяйственнаяОперация";
		ИмяПоляКорВидДеятельностиНДС = "Источники.ВидДеятельностиНДС";
		ИмяПоляПодразделение = "Источники.Подразделение";
		ИмяПоляАналитикаСписанияНДС = "Источники.АналитикаСписанияНДС";
		
		ИмяПоляИндекса = "К";
		
		ТипЗаписиРезультата = Перечисления.ТипыЗаписейПартий.ДопРасходы;
		
		ТипыЗаписейДополнения.Добавить(Перечисления.ТипыЗаписейПартий.СписанияНаВыпускПостатейные); // еще не обработанные записи
		ТипыЗаписейДополнения.Добавить(Перечисления.ТипыЗаписейПартий.Выпуск); // еще не обработанные записи
		
	ИначеЕсли НомерШага = 2 Тогда // доп. расходы по списанию на выпуск
		
		Пояснение = НСтр("ru = 'Доп. расходы по списанию на выпуск'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ИмяТаблицыИсточникаДанных = "ВТРезультатШаг1";
		ИмяТаблицыРезультатаПредварительная = "ВТРезультатШаг2Предварительная";
		ИмяТаблицыРезультата = "ВТРезультатШаг2";
		ИмяТаблицыСвязей = "ВТСвязи2";
		
		ИмяПоляЗнаменательРегл = "Т.Знаменатель";
		ИмяПоляЗнаменательУпр = "Т.ЗнаменательУпр";
		ИмяПоляПартия = "ВЫБОР КОГДА Т.Партия = НЕОПРЕДЕЛЕНО ТОГДА Источники.Партия ИНАЧЕ Т.Партия КОНЕЦ";
		ИмяПоляАналитикаУчетаПартий = "ВЫБОР КОГДА Т.Партия = НЕОПРЕДЕЛЕНО ТОГДА Источники.АналитикаУчетаПартий ИНАЧЕ Т.АналитикаУчетаПартий КОНЕЦ";
		ИмяПоляСтатьяКалькуляции = "Источники.СтатьяКалькуляции";
		ИмяПоляГруппаПродукции = "Источники.ГруппаПродукции";
		ИмяПоляПравилоОтнесенияНаВыпуск = "Источники.ПравилоОтнесенияНаВыпуск";
		ИмяПоляХозяйственнаяОперация = "Т.ХозяйственнаяОперация";
		ИмяПоляКорВидДеятельностиНДС = "Т.КорВидДеятельностиНДС";
		ИмяПоляПодразделение = "Т.Подразделение";
		ИмяПоляАналитикаСписанияНДС = "Т.АналитикаСписанияНДС";
		
		ИмяПоляИндекса = "К";
		
		ТипЗаписиРезультата = Перечисления.ТипыЗаписейПартий.СписанияНаВыпускПостатейные;
		
		ТипыЗаписейДополнения.Добавить(Перечисления.ТипыЗаписейПартий.ДопРасходы); // результат предыдущего шага
		ТипыЗаписейДополнения.Добавить(Перечисления.ТипыЗаписейПартий.Выпуск); // еще не обработанные записи
		
	Иначе // доп. расходы по выпуску
		
		Пояснение = НСтр("ru = 'Доп. расходы по выпуску'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ИмяТаблицыИсточникаДанных = "ВТРезультатШаг2";
		ИмяТаблицыРезультатаПредварительная = "ВТСписаниеПостатейныхЗатратПредварительная";
		ИмяТаблицыРезультата = "ВТСписаниеПостатейныхЗатрат";
		ИмяТаблицыСвязей = "ВТСвязи3";
		
		ИмяПоляЗнаменательРегл = "Т.Знаменатель";
		ИмяПоляЗнаменательУпр = "Т.ЗнаменательУпр";
		ИмяПоляПартия = "ВЫБОР КОГДА Т.Партия = НЕОПРЕДЕЛЕНО ТОГДА Источники.Партия ИНАЧЕ Т.Партия КОНЕЦ";
		ИмяПоляАналитикаУчетаПартий = "ВЫБОР КОГДА Т.Партия = НЕОПРЕДЕЛЕНО ТОГДА Источники.АналитикаУчетаПартий ИНАЧЕ Т.АналитикаУчетаПартий КОНЕЦ";
		ИмяПоляСтатьяКалькуляции = "Источники.СтатьяКалькуляции";
		ИмяПоляГруппаПродукции = "Источники.ГруппаПродукции";
		ИмяПоляПравилоОтнесенияНаВыпуск = "Источники.ПравилоОтнесенияНаВыпуск";
		ИмяПоляХозяйственнаяОперация = "Т.ХозяйственнаяОперация";
		ИмяПоляКорВидДеятельностиНДС = "Т.КорВидДеятельностиНДС";
		ИмяПоляПодразделение = "Т.Подразделение";
		ИмяПоляАналитикаСписанияНДС = "Т.АналитикаСписанияНДС";
		
		ИмяПоляИндекса = "Регистратор, АналитикаУчетаНоменклатуры";
		
		ТипЗаписиРезультата = Перечисления.ТипыЗаписейПартий.Выпуск;
		
		ТипыЗаписейДополнения.Добавить(Перечисления.ТипыЗаписейПартий.ДопРасходы); // результат предыдущего шага
		ТипыЗаписейДополнения.Добавить(Перечисления.ТипыЗаписейПартий.СписанияНаВыпускПостатейные); // результат предыдущего шага
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаРаспределенияПартийНДС(ИмяТаблицыИсточникаДанных, ИмяТаблицыСвязей);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(
		ПараметрыРасчета,
		Запрос,,,,
		Пояснение);
	
	Запрос.УстановитьПараметр("ТипыЗаписейДополнения", ТипыЗаписейДополнения);
	Запрос.УстановитьПараметр("ТипЗаписиРезультата", ТипЗаписиРезультата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.К,
	|	Источники.Приемник,
	|	Т.ТипЗаписи,
	|	Т.Знаменатель,
	|	Т.ЗнаменательУпр,
	|	Т.ЗнаменательДляИсточников,
	|	Т.ЗнаменательДляИсточниковУпр,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.ДокументПоступленияВТекущемПериоде,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.ХозяйственнаяОперация,
	|	Т.КорВидДеятельностиНДС,
	|	Т.Подразделение,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходов,
	|	Т.АналитикаСписанияНДС,
	|
	|	Источники.СтоимостьСНДС,
	|	Источники.СтоимостьБезНДС,
	|	Источники.СтоимостьБезНДСРегл,
	|	Источники.НДСРегл,
	|	Источники.НДСУпр
	|ПОМЕСТИТЬ ВТРезультатПредварительный
	|ИЗ
	|	ИмяТаблицыИсточникаДанных КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаспределение КАК Источники
	|		ПО Т.НомерУзла = Источники.Источник
	|ИНДЕКСИРОВАТЬ ПО
	|	Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.К КАК К,
	|	&ТипЗаписиРезультата КАК ТипЗаписи,
	|	&ИмяПоляЗнаменательРегл КАК Знаменатель,
	|	&ИмяПоляЗнаменательУпр КАК ЗнаменательУпр,
	|	Т.ЗнаменательДляИсточников,
	|	Т.ЗнаменательДляИсточниковУпр,
	|	Т.Период,
	|	Т.Регистратор КАК Регистратор,
	|	Т.ВидДвижения,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	ВЫБОР КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) ИНАЧЕ Т.КорАналитикаУчетаНоменклатуры КОНЕЦ КАК КорАналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) ИНАЧЕ Т.КорВидЗапасов КОНЕЦ КАК КорВидЗапасов,
	|	&ИмяПоляПартия КАК Партия,
	|	&ИмяПоляАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Источники.ДокументПоступления КАК ДокументПоступления,
	|	Источники.ДокументПоступленияВТекущемПериоде,
	|	Источники.АналитикаУчетаПартийДокументаПоступления,
	|	Т.НаправлениеДеятельности,
	|	&ИмяПоляХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&ИмяПоляКорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Т.КорНаправлениеДеятельности,
	|	&ИмяПоляПодразделение КАК Подразделение,
	|	Источники.СтатьяРасходовАктивов,
	|	Источники.АналитикаРасходов,
	|	Т.КорПодразделение,
	|	ВЫБОР
	|		КОГДА НЕ НастройкиСписанияНДС.Организация ЕСТЬ NULL
	|	  	  И (НЕ НастройкиСписанияНДС.ЗависитОтПериод ИЛИ НЕ Источники.ДокументПоступленияВТекущемПериоде)
	|	  	  И Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		  И &ИмяПоляКорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	  	ТОГДА
	|			ВЫБОР КОГДА &ИмяПоляКорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ТОГДА НастройкиСписанияНДС.СтатьяРасходовНеНДС
	|				ИНАЧЕ НастройкиСписанияНДС.СтатьяРасходовЕНВД
	|			КОНЕЦ
	|		ИНАЧЕ Т.СтатьяСписанияНДС
	|	КОНЕЦ КАК СтатьяСписанияНДС, 
	|	ВЫБОР
	|		КОГДА НЕ НастройкиСписанияНДС.Организация ЕСТЬ NULL
	|	  	  И (НЕ НастройкиСписанияНДС.ЗависитОтПериод ИЛИ НЕ Источники.ДокументПоступленияВТекущемПериоде)
	|	  	  И Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		  И &ИмяПоляКорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	  	ТОГДА
	|			ВЫБОР КОГДА &ИмяПоляКорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				ТОГДА НастройкиСписанияНДС.АналитикаРасходовНеНДС
	|				ИНАЧЕ НастройкиСписанияНДС.АналитикаРасходовЕНВД
	|			КОНЕЦ
	|		ИНАЧЕ &ИмяПоляАналитикаСписанияНДС
	|	КОНЕЦ КАК АналитикаСписанияНДС, 
	|	Т.РазделУчета,
	|	Т.АналитикаФинансовогоУчета,
	|
	|	Источники.СтоимостьСНДС,
	|	Источники.СтоимостьБезНДС,
	|	Источники.СтоимостьБезНДСРегл,
	|	ВЫБОР
	|		КОГДА НЕ НастройкиСписанияНДС.Организация ЕСТЬ NULL
	|	  	  И (НЕ НастройкиСписанияНДС.ЗависитОтПериод ИЛИ НЕ Источники.ДокументПоступленияВТекущемПериоде)
	|	  	  И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	  	  И Источники.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	  	  И Источники.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	  	ТОГДА 0
	|	  	ИНАЧЕ Источники.НДСРегл
	|	КОНЕЦ КАК НДСРегл,
	|	ВЫБОР
	|		КОГДА НЕ НастройкиСписанияНДС.Организация ЕСТЬ NULL
	|	  	  И (НЕ НастройкиСписанияНДС.ЗависитОтПериод ИЛИ НЕ Источники.ДокументПоступленияВТекущемПериоде)
	|	  	  И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	  	  И Источники.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	  	  И Источники.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|	  	ТОГДА 0
	|	  	ИНАЧЕ Источники.НДСУпр
	|	КОНЕЦ КАК НДСУпр
	|ПОМЕСТИТЬ ИмяТаблицыРезультатаПредварительная
	|ИЗ
	|	ВТРезультатПредварительный КАК Источники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыИсточникаДанных КАК Т
	|		ПО Источники.Приемник = Т.НомерУзла
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиСписанияНДС КАК НастройкиСписанияНДС
	|		ПО Т.Организация = НастройкиСписанияНДС.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.К,
	|	Т.ТипЗаписи,
	|	Т.Знаменатель,
	|	Т.ЗнаменательУпр,
	|	Т.ЗнаменательДляИсточников,
	|	Т.ЗнаменательДляИсточниковУпр,
	|	Т.Период,
	|	Т.Регистратор,
	|	Т.ВидДвижения,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.КорАналитикаУчетаНоменклатуры,
	|	Т.КорВидЗапасов,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.ДокументПоступленияВТекущемПериоде,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.НаправлениеДеятельности,
	|	Т.ХозяйственнаяОперация,
	|	Т.КорВидДеятельностиНДС,
	|	Т.КорНаправлениеДеятельности,
	|	Т.Подразделение,
	|	Т.СтатьяРасходовАктивов,
	|	Т.АналитикаРасходов,
	|	Т.КорПодразделение,
	|	Т.СтатьяСписанияНДС,
	|	Т.АналитикаСписанияНДС,
	|	Т.РазделУчета,
	|	Т.АналитикаФинансовогоУчета,
	|
	|	Т.СтоимостьСНДС,
	|	Т.СтоимостьБезНДС,
	|	Т.СтоимостьБезНДСРегл,
	|	Т.НДСРегл,
	|	Т.НДСУпр
	|ИЗ
	|	ИмяТаблицыИсточникаДанных КАК Т
	|ГДЕ
	|	Т.ТипЗаписи В (&ТипыЗаписейДополнения)
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыИсточникаДанных", ИмяТаблицыИсточникаДанных);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыРезультатаПредварительная", ИмяТаблицыРезультатаПредварительная);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыСвязей", ИмяТаблицыСвязей);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляЗнаменательРегл", ИмяПоляЗнаменательРегл);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляЗнаменательУпр", ИмяПоляЗнаменательУпр);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляПартия", ИмяПоляПартия);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляАналитикаУчетаПартий", ИмяПоляАналитикаУчетаПартий);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляСтатьяКалькуляции", ИмяПоляСтатьяКалькуляции);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляГруппаПродукции", ИмяПоляГруппаПродукции);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляПравилоОтнесенияНаВыпуск", ИмяПоляПравилоОтнесенияНаВыпуск);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляХозяйственнаяОперация", ИмяПоляХозяйственнаяОперация);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляКорВидДеятельностиНДС", ИмяПоляКорВидДеятельностиНДС);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляПодразделение", ИмяПоляПодразделение);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяПоляАналитикаСписанияНДС", ИмяПоляАналитикаСписанияНДС);
	
	Запрос.Текст = Запрос.Текст + "
	|ИНДЕКСИРОВАТЬ ПО
	|	" + ИмяПоляИндекса;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(
		ПараметрыРасчета,
		"ВТЗнаменателиПриемников, ВТРаспределениеПредварительное, ВТРаспределениеКопейки, ВТРаспределение, ВТРезультатПредварительный"
			 + ", " + ИмяТаблицыИсточникаДанных + ", " + ИмяТаблицыСвязей);
	
	Если НомерШага < 3 Тогда
		
		ПараметрыНумерации = РасчетСебестоимостиПрикладныеАлгоритмы.СформироватьПараметрыНумерацииСтрокВременнойТаблицы(
			"", // разделитель
			"", // ресурсы
			"К", // порядок
			"НомерУзла", // номер
			"НомерУзла", // индекс
			);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьНомераСтрокВременнойТаблицы(
			ПараметрыРасчета,
			ПараметрыНумерации,
			ИмяТаблицыРезультатаПредварительная,
			ИмяТаблицыРезультата);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ТипЗаписи,
		|	Т.Период,
		|	Т.Регистратор,
		|	Т.ВидДвижения,
		|	Т.Организация,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.КорАналитикаУчетаНоменклатуры,
		|	Т.КорВидЗапасов,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.ВидДеятельностиНДС,
		|	Т.ДокументПоступления,
		|	Т.ДокументПоступленияВТекущемПериоде,
		|	Т.АналитикаУчетаПартийДокументаПоступления,
		|	Т.НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация,
		|	Т.КорВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовАктивов,
		|	Т.АналитикаРасходов,
		|	Т.КорПодразделение,
		|	Т.СтатьяСписанияНДС,
		|	Т.АналитикаСписанияНДС,
		|	Т.РазделУчета,
		|	Т.АналитикаФинансовогоУчета,
		|
		|	СУММА(Т.СтоимостьСНДС) КАК СтоимостьСНДС,
		|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(Т.СтоимостьБезНДСРегл) КАК СтоимостьБезНДСРегл,
		|	СУММА(Т.НДСРегл) КАК НДСРегл,
		|	0 КАК СтоимостьБезНДСУпр,
		|	СУММА(Т.НДСУпр) КАК НДСУпр
		|ПОМЕСТИТЬ ИмяТаблицыРезультата 
		|ИЗ
		|	ИмяТаблицыРезультатаПредварительная КАК Т
		|ГДЕ
		|	Т.Регистратор <> НЕОПРЕДЕЛЕНО
		|СГРУППИРОВАТЬ ПО
		|	Т.ТипЗаписи,
		|	Т.Период,
		|	Т.Регистратор,
		|	Т.ВидДвижения,
		|	Т.Организация,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.КорАналитикаУчетаНоменклатуры,
		|	Т.КорВидЗапасов,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.ВидДеятельностиНДС,
		|	Т.ДокументПоступления,
		|	Т.ДокументПоступленияВТекущемПериоде,
		|	Т.АналитикаУчетаПартийДокументаПоступления,
		|	Т.НаправлениеДеятельности,
		|	Т.ХозяйственнаяОперация,
		|	Т.КорВидДеятельностиНДС,
		|	Т.КорНаправлениеДеятельности,
		|	Т.Подразделение,
		|	Т.СтатьяРасходовАктивов,
		|	Т.АналитикаРасходов,
		|	Т.КорПодразделение,
		|	Т.СтатьяСписанияНДС,
		|	Т.АналитикаСписанияНДС,
		|	Т.РазделУчета,
		|	Т.АналитикаФинансовогоУчета
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыРезультатаПредварительная", ИмяТаблицыРезультатаПредварительная);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыРезультата", ИмяТаблицыРезультата);
	
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(
			ПараметрыРасчета,
			"ВТДанныеПостатейныеЗатраты, ВТНастройкиСписанияНДС, " + ИмяТаблицыРезультатаПредварительная);
		
	КонецЕсли;
	
КонецПроцедуры

// ... выборки данных

//-- Локализация

// Заполнение расчетной партии

Процедура ЗаполнитьРасчетнуюПартиюНДС2_4(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход)
	
	СуммовыеРесурсы = Новый Структура("СтоимостьСНДС, СтоимостьБезНДС, СтоимостьБезНДСРегл, НДСРегл, СтоимостьБезНДСУпр, НДСУпр");
	
	// Заполняем расчетную партию по расходной партии-основании
	ЗаполнитьЗначенияСвойств(РасчетнаяПартия, Расход);
	
	// Заполняем партионную идентификацию в расчетной партии
	ЗаполнитьЗначенияСвойств(РасчетнаяПартия, Приход,
		"ДокументПоступления, АналитикаУчетаПартийДокументаПоступления, СтатьяРасходовАктивов, АналитикаРасходов
		|");
	
	Если Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаРегл
	 ИЛИ Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаУпр Тогда
		ЗаполнитьЗначенияСвойств(РасчетнаяПартия, Расход, "СтатьяКалькуляции, ГруппаПродукции, ПравилоОтнесенияНаВыпуск,
			|КорПодразделение, КорНаправлениеДеятельности");
	КонецЕсли;

	Если РасчетнаяПартия.ТипЗаписи <> Перечисления.ТипыЗаписейПартий.ВозвратПрошлыхПериодов Тогда
		РасчетнаяПартия.ДокументИсточник = Неопределено;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РасчетнаяПартия.Партия) Тогда
		РасчетнаяПартия.Партия = Приход.Партия;
		РасчетнаяПартия.АналитикаУчетаПартий = Приход.АналитикаУчетаПартий;
	КонецЕсли;
	
	// Заменим старые аналитики учета партий на новые.
	Если ПараметрыРасчета.РаспределениеПартий.ДополнительныеСвойства.Свойство("АналитикиУчетаПартий") Тогда
		
		АналитикиУчетаПартий = ПараметрыРасчета.РаспределениеПартий.ДополнительныеСвойства.АналитикиУчетаПартий; // Соответствие
		
		НоваяАналитикаУчетаПартий = АналитикиУчетаПартий.Получить(РасчетнаяПартия.АналитикаУчетаПартийДокументаПоступления);
		
		Если ЗначениеЗаполнено(НоваяАналитикаУчетаПартий) Тогда
			РасчетнаяПартия.АналитикаУчетаПартийДокументаПоступления = НоваяАналитикаУчетаПартий;
		КонецЕсли;
		
		НоваяАналитикаУчетаПартий = АналитикиУчетаПартий.Получить(РасчетнаяПартия.АналитикаУчетаПартий);
		
		Если ЗначениеЗаполнено(НоваяАналитикаУчетаПартий) Тогда
			РасчетнаяПартия.АналитикаУчетаПартий = НоваяАналитикаУчетаПартий;
		КонецЕсли;
		
	КонецЕсли;
	
	// Очистим не используемые в дальнейшем поля.
	Если РасчетнаяПартия.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
		РасчетнаяПартия.КорАналитикаУчетаНоменклатуры = Неопределено;
		РасчетнаяПартия.КорВидЗапасов = Неопределено;
	КонецЕсли;
	
	// Расчетная партия заполняется на наибольшее общее вычитаемое
	ПриходБазис = 0;
	
	Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаРегл
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаУпр
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр Тогда
	 
		КоличествоСписания = Мин(Расход.Знаменатель, Приход.Знаменатель);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = ?(Приход.Знаменатель <> 0, КоличествоСписания / Приход.Знаменатель, 0);
		
		ЗаполнитьЗначенияСвойств(РасчетнаяПартия, Приход, "ХозяйственнаяОперация, АналитикаСписанияНДС, Подразделение");
		ЗаполнитьЗначенияСвойств(РасчетнаяПартия, Расход, "Партия, АналитикаУчетаПартий, ВидДеятельностиНДС, Период, Регистратор, АналитикаФинансовогоУчета, РазделУчета");
		
		РасчетнаяПартия.КорВидДеятельностиНДС = Приход.ВидДеятельностиНДС;
		
		Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыРегл
	 	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаДопРасходыУпр Тогда
			РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ДопРасходыСПартией;
			РасчетнаяПартия.ХозяйственнаяОперация = Расход.ХозяйственнаяОперация;
		Иначе
			РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ДопРасходы;
		КонецЕсли;
		
	ИначеЕсли ((РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Перемещение
	 	  И ТипЗнч(РасчетнаяПартия.Регистратор) = Тип("ДокументСсылка.СборкаТоваров"))
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Выпуск
	 ИЛИ РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.СписанияНаВыпуск) Тогда
		КоличествоСписания = Мин(Расход.Знаменатель, Приход.Знаменатель);
		ЗнаменательСписания = КоличествоСписания;
		ПриходБазис = ?(Приход.Знаменатель <> 0, КоличествоСписания / Приход.Знаменатель, 0);
	Иначе
		
		Если Расход.ВидДвижения = ВидДвиженияНакопления.Приход И Расход.ЗнаменательДляИсточников <> 0 Тогда
			ИмяПоляЗнаменательРасхода = "ЗнаменательДляИсточников";
		Иначе
			ИмяПоляЗнаменательРасхода = "Знаменатель";
		КонецЕсли;
		
		Если Приход.Знаменатель <> 0 Тогда
			КоличествоСписания = Мин(Расход[ИмяПоляЗнаменательРасхода], Приход.Знаменатель);
			ЗнаменательСписания = КоличествоСписания;
			ПриходБазис = ?(Приход.Знаменатель <> 0, КоличествоСписания / Приход.Знаменатель, 0);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПриходБазис = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем показатели расчетной партии
	Для Каждого ИмяРесурса Из СуммовыеРесурсы Цикл
		РасчетнаяПартия[ИмяРесурса.Ключ] = Окр(ПриходБазис * Приход[ИмяРесурса.Ключ], 2);
	КонецЦикла;
	
	Если РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.ОстатокСгруппированный Тогда
		РасчетнаяПартия.Знаменатель = Приход.Знаменатель;
	ИначеЕсли Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаРегл
	 ИЛИ Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.БазаУпр Тогда
		РасчетнаяПартия.Знаменатель = Расход.ЗнаменательДляИсточников;
	Иначе
		РасчетнаяПартия.Знаменатель = 0;
	КонецЕсли;
	
	// Корректируем базу расчета в приходе
	Если НЕ (Приход.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет
		И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Потребление)
	И НЕ (Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.СписаниеНаДругиеПартии
		И Расход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.СторноСписанияНаДругиеПартии)
	И НЕ (Приход.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства
		И Приход.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Распределение) Тогда
	 
	 	Если НЕ Приход.ЭтоСторно И РасчетнаяПартия.ЭтоСторно
		 И РасчетнаяПартия.ТипЗаписи = Перечисления.ТипыЗаписейПартий.Потребление Тогда
			Знак = -1;
		Иначе
			Знак = 1;
		КонецЕсли;
	 	
	    Приход.Знаменатель = Приход.Знаменатель - Знак * ЗнаменательСписания;
		
		Для Каждого ИмяРесурса Из СуммовыеРесурсы Цикл
			Приход[ИмяРесурса.Ключ] = Приход[ИмяРесурса.Ключ] - Знак * РасчетнаяПартия[ИмяРесурса.Ключ];
		КонецЦикла;
	 	
	КонецЕсли;
	
	//++ Локализация
	ЗаполнитьСтатьюИАналитикуСписанияНДС(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход);
	//-- Локализация
	
	// По результатам партионной идентификации определяем завершенность расчета
	Если ТипЗнч(Приход.Регистратор) = Тип("ДокументСсылка.ВводОстатков")
		Или ТипЗнч(Приход.Регистратор) = Тип("ДокументСсылка.ВводОстатковТоваров") Тогда
		// Для документов ВводОстатков с реквизитом ВводОстатков22 = Ложь в таблице Данные
		// установлен признак РасчетЗавершен = Ложь для того, чтобы движения этого документа не записывались в ИБ,
		// т.к. они уже сформированы самим документом.
		РасчетнаяПартия.РасчетЗавершен = Истина;
	ИначеЕсли РасчетнаяПартия.СтоимостьСНДС = 0
	 И РасчетнаяПартия.СтоимостьБезНДС = 0
	 И РасчетнаяПартия.СтоимостьБезНДСРегл = 0
	 И РасчетнаяПартия.НДСРегл = 0
	 И РасчетнаяПартия.СтоимостьБезНДСУпр = 0
	 И РасчетнаяПартия.НДСУпр = 0 Тогда
		// Сформирована пустая расчетная запись. Такая запись не нужна в результатах расчета.
		РасчетнаяПартия.РасчетЗавершен = Ложь;
	Иначе
		РасчетнаяПартия.РасчетЗавершен = Приход.РасчетЗавершен;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//++ Локализация

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляВключенияИсключенияНДСДопРасходовВСтоимость24

// Выборка данных

Процедура ПолучитьДанныеДляВключенияИсключенияНДСДопРасходов(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляВключенияИсключенияНДСДопРасходов(ПараметрыРасчета));
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляВключенияИсключенияНДСДопРасходов(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхДляВключенияИсключенияНДСДопРасходов() //вт Данные
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстВключенияИсключенияНДСДопРасходов()
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляВключенияИсключенияНДСДопРасходов()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	0 КАК Приоритет,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	Т.ТипЗаписи КАК ТипЗаписи,
		|	Т.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	Т.ВидДвижения КАК ВидДвижения,
		|	Т.Период КАК Период,
		|	Т.Регистратор КАК Регистратор,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета КАК РазделУчета,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Организация КАК Организация,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	0 КАК СтоимостьРегл,
		|	0 КАК СтоимостьУпр
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК Т";

	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

// ... выборки данных

Функция ТекстВключенияИсключенияНДСДопРасходов()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстВключенияИсключенияНДСДопРасходов"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости) КАК ТипЗаписи,
		|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	Т.Период КАК Период,
		|	Т.Регистратор КАК Регистратор,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета КАК РазделУчета,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Организация КАК Организация,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ВЫБОР
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|			ТОГДА Т.НДСРегл
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|			ТОГДА Т.НДСРегл
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|			ТОГДА -Т.НДСРегл
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|			ТОГДА -Т.НДСРегл
		|			ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьРегл,
		|	ВЫБОР
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|			ТОГДА Т.НДСУпр
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|			ТОГДА Т.НДСУпр
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|			ТОГДА -Т.НДСУпр
		|		КОГДА Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 И Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|			ТОГДА -Т.НДСУпр
		|			ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьУпр
		|ИЗ
		|	ВТДопрасходыДляПостатейныхЗатрат КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО ДанныеПервичныхДокументов.Организация = Т.Организация
		|		И ДанныеПервичныхДокументов.Документ = Т.ДокументПоступления
		|ГДЕ
		|	Т.ВидДеятельностиНДС <> Т.КорВидДеятельностиНДС
		|	И Т.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И Т.КорВидДеятельностиНДС <> НЕОПРЕДЕЛЕНО
		|	И Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|	И Т.РазделУчета <> НЕОПРЕДЕЛЕНО
		|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией)
		|	И (Т.СтатьяСписанияНДС = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|		ИЛИ Т.СтатьяСписанияНДС = НЕОПРЕДЕЛЕНО)
		|	И (Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0)
		|";
КонецФункции

#КонецОбласти
//-- Локализация

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляПартийПрочихРасходов

// Выборка данных

Процедура ПолучитьДанныеДляПартийПрочихРасходов(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляПартийПрочихРасходов(ПараметрыРасчета));
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляПартийПрочихРасходов(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхДляПартийПрочихРасходов() //вт Данные
		//++ Локализация
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступлениеПартийПрочихРасходовДляДопРасходовФИФО()
		//-- Локализация
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступлениеПартийПрочихРасходовПриСписанииНоменклатурыНаДопРасходыФИФО()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстСписаниеПартийПрочихРасходовДляДопРасходовФИФО()
		//++ Локализация
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстСписаниеПартийПрочихРасходовДляДопРасходовСредняяЗаМесяц()
		//-- Локализация
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляПартийПрочихРасходов()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	0 КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов,
		|	ДД.ДокументПоступленияРасходов,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
		|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.КорГруппаПродукции,
		|	0 КАК Стоимость,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьРегл,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
		|	ДД.Сторно
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ПартииПрочихРасходов КАК ДД
		|";

	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

// ... выборки данных

//++ Локализация

Функция ТекстПоступлениеПартийПрочихРасходовДляДопРасходовФИФО()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступлениеПартийПрочихРасходовДляДопРасходовФИФО"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.ДокументПоступления КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
		|	ДД.Организация,
		|	ДД.КорПодразделение КАК Подразделение,
		|	ДД.КорСтатьяРасходов КАК СтатьяРасходов,
		|	ДД.КорАналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ДД.ДокументПоступления КАК ДокументПоступленияРасходов,
		|	ДД.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартий,
		|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.СтатьяРасходовАктивов КАК КорСтатьяРасходов,
		|	ДД.АналитикаРасходов КАК КорАналитикаРасходов,
		|	ДД.Подразделение КАК КорПодразделение,
		|	ДД.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорГруппаПродукции,
		|	СУММА(ДД.СтоимостьСНДС * Статьи.КоэффициентУпр) КАК Стоимость,
		|	СУММА(ДД.СтоимостьБезНДС * Статьи.КоэффициентУпр) КАК СтоимостьБезНДС,
		|	СУММА(ДД.СтоимостьБезНДСРегл * Статьи.КоэффициентРегл) КАК СтоимостьРегл,
		|	СУММА(ДД.НДСРегл * Статьи.КоэффициентРегл) КАК НДСРегл,
		|	СУММА(ДД.НДСУпр * Статьи.КоэффициентУпр) КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	ДД.КорВидДеятельностиНДС КАК НалогообложениеНДС,
		|	ДД.Сторно
		|ИЗ
		|	ВТДопРасходыДляПостатейныхЗатрат КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
		|		ПО ДД.КорСтатьяРасходов = Статьи.Ссылка
		|ГДЕ
		|	ДД.Организация В(&ОрганизацииСРаздельнымУчетомПостатейныхЗатрат)
		|	И ДД.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией))
		|	И (ДД.СтоимостьСНДС <> 0 ИЛИ ДД.СтоимостьБезНДС <> 0
		|		ИЛИ ДД.СтоимостьБезНДСРегл <> 0 ИЛИ ДД.НДСРегл <> 0 ИЛИ ДД.НДСУпр <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.Сторно,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.КорПодразделение,
		|	ДД.КорНаправлениеДеятельности
		|";
КонецФункции

//-- Локализация

Функция ТекстПоступлениеПартийПрочихРасходовПриСписанииНоменклатурыНаДопРасходыФИФО()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступлениеПартийПрочихРасходовПриСписанииНоменклатурыНаДопРасходыФИФО"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор КАК Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ДД.ДокументПоступления КАК ДокументПоступленияРасходов,
		|	ДД.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартий,
		|	ДД.НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорГруппаПродукции,
		|	СУММА(ДД.Стоимость) КАК Стоимость,
		|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
		|	СУММА(ДД.НДСРегл) КАК НДСРегл,
		|	СУММА(ДД.НДСУпр) КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
		|	ЛОЖЬ КАК Сторно
		|ИЗ
		|	ВТДопРасходыДляРаспределенияФИФО КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
		|		ПО ДД.Регистратор = Передача.Ссылка
		|		И ДД.Организация = Передача.Организация
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
		|		ПО ДД.Регистратор = Корректировка.Ссылка
		|ГДЕ
		// Исключаем доп расходы, которые были в остатках регистра ""Партии прочих расходов""
		|	ДД.Регистратор <> НЕОПРЕДЕЛЕНО
		// Исключаем доп расходы, по которым уже есть приходы в регистр ""Партии прочих расходов"" в текущем периоде
		|	И (ДД.Регистратор <> ДД.ДокументПоступления
		|		ИЛИ ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
		|	И ДД.ДокументПоступления <> НЕОПРЕДЕЛЕНО
		|	И ЕСТЬNULL(Корректировка.ДокументОснование, НЕОПРЕДЕЛЕНО) <> ДД.ДокументПоступления
		|	И ТИПЗНАЧЕНИЯ(ДД.Регистратор) <> ТИП(Документ.Сторно)
		// Исключаем доп расходы у организации-отправителя - они учитываются только у организации-получателя
		|	И Передача.Ссылка ЕСТь NULL
		|	И (ДД.Стоимость <> 0 ИЛИ ДД.СтоимостьБезНДС <> 0
		|		ИЛИ ДД.СтоимостьРегл <> 0 ИЛИ ДД.НДСРегл <> 0 ИЛИ ДД.НДСУпр <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|	ДД.ВидДеятельностиНДС
		|";
КонецФункции

Функция ТекстСписаниеПартийПрочихРасходовДляДопРасходовФИФО()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстСписаниеПартийПрочихРасходовДляДопРасходовФИФО"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ДД.ДокументПоступления КАК ДокументПоступленияРасходов,
		|	ДД.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартий,
		|	ДД.НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	ДД.КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорГруппаПродукции,
		|	СУММА(ДД.СтоимостьСНДС) КАК Стоимость,
		|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(ДД.СтоимостьБезНДСРегл) КАК СтоимостьРегл,
		|	СУММА(ДД.НДСРегл) КАК НДСРегл,
		|	СУММА(ДД.НДСУпр) КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	ДД.ВидДеятельностиНДС КАК НалогообложениеНДС,
		|	ДД.Сторно
		|ИЗ
		|	ВТДопРасходыДляПостатейныхЗатрат КАК ДД
		|ГДЕ
		|	ДД.ТипЗаписи В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией))
		|	И (ДД.СтоимостьСНДС <> 0 ИЛИ ДД.СтоимостьБезНДС <> 0
		|		ИЛИ ДД.СтоимостьБезНДСРегл <> 0 ИЛИ ДД.НДСРегл <> 0
		|		ИЛИ ДД.СтоимостьБезНДСУпр <> 0 ИЛИ ДД.НДСУпр <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.ДокументПоступления,
		|	ДД.АналитикаУчетаПартийДокументаПоступления,
		|	ДД.НаправлениеДеятельности,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.Сторно,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	ДД.КорНаправлениеДеятельности
		|";
КонецФункции

//++ Локализация
Функция ТекстСписаниеПартийПрочихРасходовДляДопРасходовСредняяЗаМесяц()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстСписаниеПартийПрочихРасходовДляДопРасходовСредняяЗаМесяц"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ВЫБОР КОГДА ДД.ДокументПоступления = НЕОПРЕДЕЛЕНО
		|		ТОГДА ДД.ДокументИсточник
		|		ИНАЧЕ ДД.ДокументПоступления
		|	КОНЕЦ КАК ДокументПоступленияРасходов,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	ДД.КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК КорГруппаПродукции,
		|	СУММА(ВЫБОР
		|		КОГДА (Статьи.Ссылка ЕСТЬ NULL
		|		  ИЛИ Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		 И ДД.СтоимостьБезНДС <> 0
		|			ТОГДА ДД.СтоимостьБезНДС + ДД.НДС
		|		ИНАЧЕ 0 КОНЕЦ) КАК Стоимость,
		|	СУММА(ВЫБОР
		|		КОГДА Статьи.Ссылка ЕСТЬ NULL
		|		  ИЛИ Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|			ТОГДА ДД.СтоимостьБезНДС
		|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьБезНДС,
		|	СУММА(ВЫБОР
		|		КОГДА Статьи.Ссылка ЕСТЬ NULL
		|		  ИЛИ Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|			ТОГДА ДД.СтоимостьБезНДС
		|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьРегл,
		|	СУММА(ВЫБОР
		|		КОГДА Статьи.Ссылка ЕСТЬ NULL
		|		  ИЛИ Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|			ТОГДА ДД.НДС
		|		ИНАЧЕ 0 КОНЕЦ) КАК НДСРегл,
		|	СУММА(ВЫБОР
		|		КОГДА Статьи.Ссылка ЕСТЬ NULL
		|		  ИЛИ Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|			ТОГДА ДД.НДСУпр
		|		ИНАЧЕ 0 КОНЕЦ) КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	ДД.ВидДеятельностиНДС КАК НалогообложениеНДС,
		|	ДД.Сторно
		|ИЗ
		|	ВТДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
		|		ПО ДД.СтатьяРасходовАктивов = Статьи.Ссылка
		|ГДЕ
		|	ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ДД.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам))
		|	И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.РаспределениеПрочихЗатрат)
		|	И (ДД.СтоимостьБезНДС <> 0 ИЛИ ДД.НДС <> 0 ИЛИ ДД.НДСУпр <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ВЫБОР КОГДА ДД.ДокументПоступления = НЕОПРЕДЕЛЕНО
		|		ТОГДА ДД.ДокументИсточник
		|		ИНАЧЕ ДД.ДокументПоступления
		|	КОНЕЦ,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.НаправлениеДеятельности,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов,
		|	ДД.КорПодразделение,
		|	ДД.Сторно
		|";
КонецФункции
//-- Локализация

#КонецОбласти

//++ Локализация
#Область ПроцедурыЭтапа_ПодготовкаДанныхДляПрочихРасходов

// Выборка данных

Процедура ПолучитьДанныеДляПрочихРасходов(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляПрочихРасходов(ПараметрыРасчета));
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляПрочихРасходов(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхДляПрочихРасходов() //вт Данные
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстВключениеИсключениеНДСВСтоимостиНДСНалоговогоАгента()
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляПрочихРасходов()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	0 КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	0 КАК Сумма,
		|	0 КАК СуммаБезНДС,
		|	0 КАК СуммаРегл,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК СуммаУпр,
		|	ДД.ИдентификаторФинЗаписи
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ПрочиеРасходы КАК ДД
		|";

	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

// ... выборки данных

Функция ТекстВключениеИсключениеНДСВСтоимостиНДСНалоговогоАгента()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстВключениеИсключениеНДСВСтоимостиНДСНалоговогоАгента"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение) КАК ТипЗаписи,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
		|	ДД.Организация,
		|	ДД.КорПодразделение КАК Подразделение,
		|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДД.КорСтатьяРасходов КАК СтатьяРасходов,
		|	ДД.КорАналитикаРасходов КАК АналитикаРасходов,
		|	0 КАК Сумма,
		|	0 КАК СуммаБезНДС,
		|	СУММА(ВЫБОР
		|		КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 И ДД.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|			ТОГДА ДД.НДСРегл
		|		КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 И ДД.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|			ТОГДА -ДД.НДСРегл
		|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	СУММА(ВЫБОР
		|		КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 И ДД.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|			ТОГДА ДД.НДСУпр
		|		КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 И ДД.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|			ТОГДА -ДД.НДСУпр
		|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
		|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи
		|ИЗ
		|	ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК ДД
		|ГДЕ
		|	НЕ ДД.СлужебноеВидДвиженияПриход
		|	И ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.РаспределениеПрочихЗатрат)
		|	И ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|	И ДД.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.КорПодразделение,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.КорСтатьяРасходов,
		|	ДД.КорАналитикаРасходов
		|";
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляПартийНДСКРаспределению

// Выборка данных

Процедура ПолучитьДанныеДляПартийНДСКРаспределению(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляПартийНДСКРаспределению(ПараметрыРасчета));
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляПартийНДСКРаспределению(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхДляПартийНДСКРаспределению() //вт Данные
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступленияПартийНДСКРаспределениюИзПартийНДС()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступленияПартийНДСКРаспределениюИзПриходовСебестоимости() // использует ПриходыТоваровНДС
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступленияПартийНДСКРаспределениюИзДопРасходовПартийНДС()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступленияПартийНДСКРаспределениюИзПартийНДС2_4()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступленияПартийНДСКРаспределениюИзПриходовСебестоимости2_4() // использует ПриходыТоваровНДС2_4
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступленияПартийНДСКРаспределениюИзДопРасходовПартийНДС2_4()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстПоступленияПартийНДСКРаспределениюИзПартийПрочихРасходов()
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхДляПартийНДСКРаспределению()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	0 КАК Приоритет,
		|	ЛОЖЬ КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов,
		|	ДД.Поставщик,
		|	ДД.ДокументПоступленияРасходов,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.ВидЦенности,
		|	ДД.СтавкаНДС,
		|	0 КАК СтоимостьРегл,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр,
		|	ДД.Сторно
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ПартииНДСКРаспределению КАК ДД
		|";

	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

// ... выборки данных

Функция ТекстПоступленияПартийНДСКРаспределениюИзПартийНДС()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступленияПартийНДСКРаспределениюИзПартийНДС"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов КАК АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартий.Контрагент КАК Поставщик,
		|	ВЫБОР КОГДА ДД.ДокументПоступления = НЕОПРЕДЕЛЕНО
		|		ТОГДА ДД.ДокументИсточник
		|		ИНАЧЕ ДД.ДокументПоступления
		|	КОНЕЦ КАК ДокументПоступленияРасходов,
		|	(ВЫБОР
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|			ТОГДА ДД.КорВидДеятельностиНДС
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС) ТОГДА
		|			(ВЫБОР
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.КорВидДеятельностиНДС
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.ВидДеятельностиНДС
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию) КОНЕЦ)
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА ДД.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ) КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий.ВидЦенности КАК ВидЦенности,
		|	ДД.АналитикаУчетаПартий.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьРегл,
		|	СУММА(ДД.НДС) КАК НДСРегл,
		|	СУММА(ДД.НДСУпр) КАК НДСУпр,
		|	ДД.Сторно
		|ИЗ
		|	ВтДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО Аналитика.МестоХранения = Склады.Ссылка
		|			ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО Назначения.Ссылка = Аналитика.Назначение
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
		|		ПО Потребление.Ссылка = ДД.Регистратор
		
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
		|		ПО Статья.Ссылка = ДД.СтатьяРасходовАктивов
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьяАктивов
		|		ПО СтатьяАктивов.Ссылка = ДД.СтатьяРасходовАктивов
		|ГДЕ
		|	ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И (Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
		|		ИЛИ Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|			И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС)
		|		ИЛИ ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|			И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		ИЛИ НЕ СтатьяАктивов.Ссылка ЕСТЬ NULL
		|			И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|		ИЛИ НЕ СтатьяАктивов.Ссылка ЕСТЬ NULL
		|			И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг)
		|	)
		|	И (ДД.НДС <> 0 ИЛИ ДД.НДСУпр <> 0)
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов,
		|	ДД.АналитикаУчетаПартий.Контрагент,
		|	ВЫБОР КОГДА ДД.ДокументПоступления = НЕОПРЕДЕЛЕНО
		|		ТОГДА ДД.ДокументИсточник
		|		ИНАЧЕ ДД.ДокументПоступления
		|	КОНЕЦ,
		|	(ВЫБОР
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|			ТОГДА ДД.КорВидДеятельностиНДС
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС) ТОГДА
		|			(ВЫБОР
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.КорВидДеятельностиНДС
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.ВидДеятельностиНДС
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию) КОНЕЦ)
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА ДД.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ),
		|	ДД.АналитикаУчетаПартий.ВидЦенности,
		|	ДД.АналитикаУчетаПартий.СтавкаНДС,
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстПоступленияПартийНДСКРаспределениюИзПриходовСебестоимости()// использует ПриходыТоваровНДС
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступленияПартийНДСКРаспределениюИзПриходовСебестоимости"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(Потребление.НаправлениеДеятельности,
		|		ЕСТЬNULL(Назначения.НаправлениеДеятельности,
		|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартий.Контрагент КАК Поставщик,
		|	ДД.ДокументПоступления КАК ДокументПоступленияРасходов,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий.ВидЦенности КАК ВидЦенности,
		|	ДД.АналитикаУчетаПартий.СтавкаНДС КАК СтавкаНДС,
		|	ДД.СтоимостьБезНДС КАК СтоимостьРегл,
		|	ДД.НДС КАК НДСРегл,
		|	ДД.НДСУпр КАК НДСУпр,
		|	ДД.Сторно
		|ИЗ
		|	ПриходыТоваровНДС КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО Аналитика.МестоХранения = Склады.Ссылка
		|			ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
		|		ПО Назначения.Ссылка = Аналитика.Назначение
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
		|		ПО Потребление.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
		|		ПО Статья.Ссылка = ДД.СтатьяРасходовАктивов
		|
		|ГДЕ
		|	ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|";
КонецФункции

Функция ТекстПоступленияПартийНДСКРаспределениюИзДопРасходовПартийНДС()// использует ПриходыТоваровНДС
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступленияПартийНДСКРаспределениюИзДопРасходовПартийНДС"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов КАК АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартий.Контрагент КАК Поставщик,
		|	ДД.ДокументПоступления КАК ДокументПоступленияРасходов,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий.ВидЦенности КАК ВидЦенности,
		|	ДД.АналитикаУчетаПартий.СтавкаНДС КАК СтавкаНДС,
		|	ДД.СтоимостьБезНДС КАК СтоимостьРегл,
		|	ДД.НДС КАК НДСРегл,
		|	ДД.НДСУпр КАК НДСУпр,
		|	ДД.Сторно
		|ИЗ
		|	ВтДетализацияПартийТоваровДляНДСиУСН КАК ДД
		|ГДЕ
		|	ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|";
КонецФункции

Функция ТекстПоступленияПартийНДСКРаспределениюИзПартийНДС2_4()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступленияПартийНДСКРаспределениюИзПартийНДС2_4"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(Потребление.НаправлениеДеятельности,
		|		ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) КАК НаправлениеДеятельности,
		|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.Контрагент КАК Поставщик,
		|	ДД.ДокументПоступления КАК ДокументПоступленияРасходов,
		|	(ВЫБОР
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|			ТОГДА ДД.КорВидДеятельностиНДС
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС) ТОГДА
		|			(ВЫБОР
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.КорВидДеятельностиНДС
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.ВидДеятельностиНДС
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию) КОНЕЦ)
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА ДД.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ) КАК ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ДД.СтоимостьБезНДС) КАК СтоимостьРегл,
		|	СУММА(ДД.НДС) КАК НДСРегл,
		|	СУММА(ДД.НДСУпр) КАК НДСУпр,
		|	ДД.Сторно
		|ИЗ
		|	ВТОборотыСтоимостьПартийНДС КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
		|		ПО Потребление.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
		|		ПО Статья.Ссылка = ДД.СтатьяРасходовАктивов
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьяАктивов
		|		ПО СтатьяАктивов.Ссылка = ДД.СтатьяРасходовАктивов
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО Аналитика.МестоХранения = Склады.Ссылка
		|			ПО Аналитика.Ссылка = ДД.КорАналитикаУчетаНоменклатуры
		|ГДЕ
		|	НЕ ДД.СлужебноеВидДвиженияПриход
		|	И (Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
		|		ИЛИ Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|			И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС)
		|		ИЛИ ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|			И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|		ИЛИ НЕ СтатьяАктивов.Ссылка ЕСТЬ NULL
		|			И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|		ИЛИ НЕ СтатьяАктивов.Ссылка ЕСТЬ NULL
		|			И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг)
		|	)
		|	И (ДД.НДС <> 0 ИЛИ ДД.НДСУпр <> 0)
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями
		|СГРУППИРОВАТЬ ПО
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ЕСТЬNULL(Потребление.НаправлениеДеятельности,
		|		ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))),
		|	ДД.СтатьяРасходовАктивов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.Контрагент,
		|	ДД.ДокументПоступления,
		|	(ВЫБОР
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|			ТОГДА ДД.КорВидДеятельностиНДС
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС) ТОГДА
		|			(ВЫБОР
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.КорВидДеятельностиНДС
		|				КОГДА Статья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.ИзДокумента)
		|				 И ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|					ТОГДА ДД.ВидДеятельностиНДС
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию) КОНЕЦ)
		|		КОГДА Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|		 И Статья.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию)
		|		КОГДА ДД.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|			ТОГДА ДД.ВидДеятельностиНДС
		|		ИНАЧЕ ДД.КорВидДеятельностиНДС КОНЕЦ),
		|	ДД.АналитикаУчетаПартийДокументаПоступления.ВидЦенности,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.СтавкаНДС,
		|	ДД.Сторно
		|";
КонецФункции

Функция ТекстПоступленияПартийНДСКРаспределениюИзПриходовСебестоимости2_4()// использует ПриходыТоваровНДС2_4
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступленияПартийНДСКРаспределениюИзПриходовСебестоимости2_4"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(Потребление.НаправлениеДеятельности,
		|		ЕСТЬNULL(ДД.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) КАК НаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.Контрагент КАК Поставщик,
		|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступления) В (&ТипыДокументовПартии)
		|		ТОГДА ДД.ДокументПоступления
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументПоступленияРасходов,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
		|	ДД.АналитикаУчетаПартийДокументаПоступления.СтавкаНДС КАК СтавкаНДС,
		|	ДД.СтоимостьБезНДСРегл КАК СтоимостьРегл,
		|	ДД.НДСРегл КАК НДСРегл,
		|	ДД.НДСУпр КАК НДСУпр,
		|	ДД.Сторно
		|ИЗ
		|	ПриходыТоваровНДС2_4 КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Потребление
		|		ПО Потребление.Ссылка = ДД.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
		|		ПО Статья.Ссылка = ДД.СтатьяРасходовАктивов
		|
		|ГДЕ
		|	ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|";
КонецФункции

Функция ТекстПоступленияПартийНДСКРаспределениюИзДопРасходовПартийНДС2_4()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступленияПартийНДСКРаспределениюИзДопРасходовПартийНДС2_4"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.Подразделение КАК Подразделение,
		|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДД.СтатьяРасходовАктивов КАК СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.АналитикаАктивов КАК АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартий.Контрагент КАК Поставщик,
		|	ДД.ДокументПоступления КАК ДокументПоступленияРасходов,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий.ВидЦенности КАК ВидЦенности,
		|	ДД.АналитикаУчетаПартий.СтавкаНДС КАК СтавкаНДС,
		|	ДД.СтоимостьБезНДС КАК СтоимостьРегл,
		|	ДД.НДСРегл КАК НДСРегл,
		|	ДД.НДСУпр КАК НДСУпр,
		|	ДД.Сторно
		|ИЗ
		|	ВТДопрасходыДляПостатейныхЗатрат КАК ДД
		|ГДЕ
		|	ДД.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
		|	И ДД.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией)
		|";
КонецФункции

Функция ТекстПоступленияПартийНДСКРаспределениюИзПартийПрочихРасходов()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстПоступленияПартийНДСКРаспределениюИзПартийПрочихРасходов"" КАК ЗапросИсточник,
		|	10 КАК Приоритет,
		|	ИСТИНА КАК РасчетЗавершен,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДД.Период,
		|	ДД.Регистратор,
		|	ДД.Организация,
		|	ДД.КорПодразделение КАК Подразделение,
		|	ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ДД.КорСтатьяРасходов КАК СтатьяРасходов,
		|	ДД.КорАналитикаРасходов КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	ДД.АналитикаУчетаПартий.Контрагент КАК Поставщик,
		|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДД.ДокументПоступленияРасходов) В (&ТипыДокументовПартии)
		|		ТОГДА ДД.ДокументПоступленияРасходов
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументПоступленияРасходов,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПартий.ВидЦенности КАК ВидЦенности,
		|	ДД.АналитикаУчетаПартий.СтавкаНДС КАК СтавкаНДС,
		|	ДД.СтоимостьРегл КАК СтоимостьРегл,
		|	ДД.НДСРегл КАК НДСРегл,
		|	ДД.НДСУпр КАК НДСУпр,
		|	ДД.Сторно
		|ИЗ
		|	ВТКэшРасчетныеОборотыПартииПрочихРасходов КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК КорСтатья
		|		ПО КорСтатья.Ссылка = ДД.КорСтатьяРасходов
		|ГДЕ
		|	НЕ ДД.СлужебноеВидДвиженияПриход
		|	И ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|	И КорСтатья.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
		|	И ДД.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
		|";
КонецФункции

#КонецОбласти

//-- Локализация

#Область ПроцедурыЭтапов_Контекстные

// Используется для всех вызовов заполнения расчетной партии.
//
Процедура ЗаполнитьРасчетнуюПартию(ПараметрыРасчета, Контекст, РасчетнаяПартия, Расход, Приход, ПартияЗаполнена) Экспорт
	
	Если Контекст = "РаспределениеПартийНДСФИФОСкользящаяПоДопРасходам" Тогда
		ЗаполнитьРасчетнуюПартиюНДС2_4(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход);
		ПартияЗаполнена = Истина;
	//++ Локализация
	ИначеЕсли Контекст = "ПодготовкаДанныхДляУчетаНДСиУСН" Тогда
		// Этап 11
		ЗаполнитьРасчетнуюПартиюНДС(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход);
		ПартияЗаполнена = Истина;
	ИначеЕсли Контекст = "РаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов" Тогда
		ЗаполнитьРасчетнуюПартиюНДС2_4(ПараметрыРасчета, РасчетнаяПартия, Расход, Приход);
		ПартияЗаполнена = Истина;
	//-- Локализация
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//++ Локализация

#Область ВключитьИсключитьНДСВСтоимость

// Этап 3.1
Процедура ВключитьИсключитьНДСВСтоимость(ПараметрыРасчета) Экспорт

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимость");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ДокументПоступления,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов
	|ПОМЕСТИТЬ РасходыПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|	И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Партии.Активность
	|	И Партии.Организация В(&МассивОрганизаций)
	|	И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|ИНДЕКСИРОВАТЬ ПО
	|	Партии.Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС
	|ПОМЕСТИТЬ ДвиженияСебестоимости
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|	И (УчетСебестоимости.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ИЛИ УчетСебестоимости.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И УчетСебестоимости.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.НалогообложениеПартии,
	|	Партии.Сторно,
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЛОЖЬ КАК Сторно
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаПродукции КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаПродукции КАК КорАналитикаУчетаНоменклатуры,
	|		РасходыПартий.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЛОЖЬ КАК Сторно
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыПартий КАК РасходыПартий
	|			ПО РасходыПартий.Регистратор = Партии.Регистратор
	|			И РасходыПартий.Организация = Партии.Организация
	|			И РасходыПартий.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаПродукции
	|			И РасходыПартий.ДокументПоступления = Партии.ДокументВыпуска
	|			И РасходыПартий.СтатьяРасходовСписания = Партии.СтатьяРасходовСписания
	|			И РасходыПартий.АналитикаРасходов = Партии.АналитикаРасходов 
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЛОЖЬ КАК Сторно
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		(ВЫБОР
	|			КОГДА ДвиженияСебестоимости.Регистратор ЕСТЬ NULL ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Партии.Партия КОНЕЦ) КАК Партия,
	|		Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		Партии.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
	|		Партии.СтатьяРасходовАктивов КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА (ВЫБОР
	|					КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|						ТОГДА Партии.СтоимостьБезНДС + Партии.НДС
	|					КОГДА Партии.СтоимостьБезНДС = 0 ТОГДА Партии.НДС
	|					ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ)
	|			ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		Партии.Сторно
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСебестоимости КАК ДвиженияСебестоимости
	|		 ПО ДвиженияСебестоимости.Период = Партии.Период
	|		 И ДвиженияСебестоимости.Регистратор = Партии.Регистратор
	|		 И ДвиженияСебестоимости.Организация = Партии.Организация
	|		 И ДвиженияСебестоимости.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		 И ДвиженияСебестоимости.Партия = Партии.Партия
	|		 И ДвиженияСебестоимости.АналитикаФинансовогоУчета = Партии.АналитикаФинансовогоУчета
	|		 И ДвиженияСебестоимости.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|
	|	) КАК Партии
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация = Партии.Организация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступления
	|	
	|ГДЕ
	|	НЕ Партии.НалогообложениеПартии ЕСТЬ NULL
	|	И Партии.НалогообложениеПартии <> Партии.НалогообложениеНДС
	|	И Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.КорАналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.НалогообложениеПартии,
	|	Партии.Сторно
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	УчетСебестоимости.Период КАК Период,
	|	УчетСебестоимости.Регистратор КАК Регистратор,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.Партия КАК Партия,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22
	|		ТОГДА УчетСебестоимости.ВидДеятельностиНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	КОНЕЦ КАК ВидДеятельностиНДС,
	|	УчетСебестоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов КАК АналитикаРасходов,
	|	УчетСебестоимости.Сторно КАК Сторно,
	|
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ) КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов КАК КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение КАК Подразделение,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции КАК ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.Регистратор КАК ДокументДвижения,
	|	ЛОЖЬ КАК ЭтоПередачаМеждуОрганизациями,
	|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости) КАК ТипЗаписи,
	|
	|	СУММА(ВЫБОР
	|		КОГДА УчетСебестоимости.ТипЗаписи В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|			ТОГДА (ВЫБОР
	|				КОГДА УчетСебестоимости.ДопРасходыРегл = 0 ТОГДА УчетСебестоимости.НДСРегл
	|				ИНАЧЕ УчетСебестоимости.ДопРасходыРегл КОНЕЦ)
	|		ИНАЧЕ УчетСебестоимости.Количество КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	СУММА(УчетСебестоимости.Количество) КАК ИсходноеКоличество
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|		ПО Регистраторы.Регистратор = УчетСебестоимости.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И (УчетСебестоимости.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ИЛИ УчетСебестоимости.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И УчетСебестоимости.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|	И НЕ УчетСебестоимости.Сторно
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.Партия,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22
	|		ТОГДА УчетСебестоимости.ВидДеятельностиНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	КОНЕЦ,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.Сторно,
	|
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ),
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22
	|		ТОГДА Партии.НалогообложениеПартии
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	КОНЕЦ КАК ВидДеятельностиНДС,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|	Партии.Сторно КАК Сторно,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	НЕОПРЕДЕЛЕНО КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	Партии.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовРегл,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
	|	Партии.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	ЛОЖЬ 		 КАК ЭтоПередачаМеждуОрганизациями,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗаписи,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Партии.НДСРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.НДСУпр) КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК ИсходноеКоличество
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.КорАналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.Партия,
	|	ВЫБОР КОГДА &ПартионныйУчетВерсии22
	|		ТОГДА Партии.НалогообложениеПартии
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	КОНЕЦ,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.КорАналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.Сторно
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|	ИЛИ СУММА(Партии.НДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Партия,
	|	ВидДеятельностиНДС,
	|	АналитикаФинансовогоУчета,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	КорАналитикаУчетаНоменклатуры,
	|	КорАналитикаФинансовогоУчета,
	|	Сторно,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад, Партия, АналитикаФинансовогоУчета,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов, КорОрганизация,
	|АналитикаУчетаНоменклатурыВО, АналитикаФинансовогоУчетаВО, АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ВариантРаспределенияРасходовУпр, ВариантРаспределенияРасходовРегл,
	|ДокументДвижения, ИдентификаторСтроки, ПринятиеКНалоговомуУчету, ГруппаПродукции, СписаниеПриПередачеНУ,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл, НДСРегл,
	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС, ВидДеятельностиНДС,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, ИдентификаторФинЗаписи, Сторно,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр
	|");
	
	СуммыРаспределения = Новый Структура("
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, Партия, АналитикаФинансовогоУчета, СтатьяРасходовСписания, АналитикаРасходов,
	|КорАналитикаУчетаНоменклатуры, КорАналитикаФинансовогоУчета, Сторно, ВидДеятельностиНДС,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
			И (СтрокаОстатка.КорАналитикаУчетаНоменклатуры = Выборка.КорАналитикаУчетаНоменклатуры
				ИЛИ НЕ ЗначениеЗаполнено(Выборка.КорРазделУчета))
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.Партия = Выборка.Партия
			И СтрокаОстатка.ВидДеятельностиНДС = Выборка.ВидДеятельностиНДС
			И СтрокаОстатка.АналитикаФинансовогоУчета = Выборка.АналитикаФинансовогоУчета
			И (СтрокаОстатка.КорАналитикаФинансовогоУчета = Выборка.КорАналитикаФинансовогоУчета
				ИЛИ НЕ ЗначениеЗаполнено(Выборка.КорРазделУчета))
			И СтрокаОстатка.СтатьяРасходовСписания = Выборка.СтатьяРасходовСписания
			И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
			И СтрокаОстатка.Сторно = Выборка.Сторно Тогда
				
			Если СтрокаОстатка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			РасчетСебестоимостиКорректировкаСтоимости.ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			
			Если ЗаписьРаспределения.СтоимостьРегл <> 0 ИЛИ ЗаписьРаспределения.СтоимостьУпр <> 0 Тогда
					
				// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
				Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета) Тогда
					
					РасчетСебестоимостиКорректировкаСтоимости.СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения, ПараметрыРасчета.ПредварительныйРасчет);
							
				КонецЕсли;
				
				Если ПараметрыРасчета.ПредварительныйРасчет Тогда
					Продолжить;
				КонецЕсли;
				
				// Корректировка списания товаров на затраты в регистре учет прочих расходов.
				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаПартийТоваров
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании Тогда
				 	
				 	СуммовыеПоказатели = Новый Структура;
					СуммовыеПоказатели.Вставить("СуммаСНДС", 0);
					СуммовыеПоказатели.Вставить("СуммаБезНДС", 0);
					СуммовыеПоказатели.Вставить("СуммаРегл", ЗаписьРаспределения.СтоимостьРегл);
					СуммовыеПоказатели.Вставить("СуммаУпр", ЗаписьРаспределения.СтоимостьУпр);
					СуммовыеПоказатели.Вставить("ПостояннаяРазница", 0);
					СуммовыеПоказатели.Вставить("ВременнаяРазница", 0);
				 
				 	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходы(
				 		ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммовыеПоказатели);
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "РасходыПартий, ДвиженияСебестоимости, ВтПартии, ВтРегистраторы");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.1.2
Процедура ВключитьИсключитьНДСВСтоимость24(ПараметрыРасчета) Экспорт
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ВТОборотыСтоимостьПартийНДС") Тогда
		Возврат;
	КонецЕсли;
		
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимость24");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|
	|	ВЫБОР КОГДА Партии.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Партии.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.КорВидДеятельностиНДС,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.Сторно КАК Сторно,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр
	|
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов,
	|		Партии.РазделУчета,
	|		Партии.Партия,
	|		Партии.АналитикаУчетаПартий,
	|		Партии.АналитикаФинансовогоУчета,
	|		Партии.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|
	|		Партии.ДокументПоступления КАК ДокументПоступления,
	|		Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Партии.АналитикаРасходов КАК АналитикаРасходов,
	|		Партии.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		Партии.Сторно,
	|
	|		Партии.Количество,
	|		Партии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		Партии.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр
	|	ИЗ
	|		ВТОборотыСтоимостьПартийНДС КАК Партии
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|		И НЕ (Партии.Сторно
	|			И Партии.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода))
	|
	|	) КАК Партии
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация = Партии.Организация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступления
	|ГДЕ
	|	НЕ Партии.ВидДеятельностиНДС ЕСТЬ NULL
	|	И Партии.ВидДеятельностиНДС <> Партии.КорВидДеятельностиНДС
	|	И Партии.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|
	|	ВЫБОР КОГДА Партии.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Партии.СтатьяРасходовСписания
	|	КОНЕЦ,
	|	Партии.АналитикаРасходов,
	|	Партии.КорВидДеятельностиНДС,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.Сторно
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	УчетСебестоимости.Период КАК Период,
	|	УчетСебестоимости.Регистратор КАК Регистратор,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.Партия КАК Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	УчетСебестоимости.РазделУчета КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ) КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов КАК КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение КАК Подразделение,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ) КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции КАК ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.Партия
	|		ИНАЧЕ УчетСебестоимости.КорПартия
	|	КОНЕЦ КАК КорПартия,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.АналитикаУчетаПартий
	|		ИНАЧЕ УчетСебестоимости.КорАналитикаУчетаПартий
	|	КОНЕЦ КАК КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.Регистратор КАК ДокументДвижения,
	|	УчетСебестоимости.Сторно КАК Сторно,
	|
	|	СУММА(УчетСебестоимости.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТСебестоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|		ПО Регистраторы.Регистратор = УчетСебестоимости.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
	|		ПО Цены.Организация = УчетСебестоимости.Организация
	|		И Цены.Партия = УчетСебестоимости.Партия
	|		И Цены.АналитикаУчетаПартий = УчетСебестоимости.АналитикаУчетаПартий
	|		И Цены.АналитикаФинансовогоУчета = УчетСебестоимости.АналитикаФинансовогоУчета
	|		И Цены.ВидДеятельностиНДС = УчетСебестоимости.ВидДеятельностиНДС
	|		И Цены.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И Цены.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И Цены.РазделУчета = УчетСебестоимости.РазделУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО УчетСебестоимости.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикаНоменклатуры.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитикаНоменклатуры
	|		ПО УчетСебестоимости.КорАналитикаУчетаНоменклатуры = КорАналитикаНоменклатуры.Ссылка
	|ГДЕ
	|	НЕ УчетСебестоимости.СлужебноеВидДвиженияПриход
	|	И УчетСебестоимости.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И (УчетСебестоимости.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ИЛИ УчетСебестоимости.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			И УчетСебестоимости.СтатьяРасходовСписания <> НЕОПРЕДЕЛЕНО)
	|	И УчетСебестоимости.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|	И УчетСебестоимости.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|	И НЕ (УчетСебестоимости.Сторно
	|		И УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода))
	|	
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА УчетСебестоимости.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.СтатьяРасходовСписания
	|	КОНЕЦ,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл,
	|	ЕСТЬNULL(УчетСебестоимости.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ЛОЖЬ),
	|	УчетСебестоимости.АналитикаРасходов,
	|
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА УчетСебестоимости.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ УчетСебестоимости.ХозяйственнаяОперация КОНЕЦ),
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.ГруппаПродукции,
	|	ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.Партия
	|		ИНАЧЕ УчетСебестоимости.КорПартия
	|	КОНЕЦ,
	|	ВЫБОР КОГДА УчетСебестоимости.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
	|		ТОГДА УчетСебестоимости.АналитикаУчетаПартий
	|		ИНАЧЕ УчетСебестоимости.КорАналитикаУчетаПартий
	|	КОНЕЦ,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.ВидДеятельностиНДС,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		ТОГДА УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ УчетСебестоимости.КорАналитикаУчетаНоменклатуры
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетСебестоимости.КорВидЗапасов = ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ТОГДА УчетСебестоимости.ВидЗапасов
	|		ИНАЧЕ УчетСебестоимости.КорВидЗапасов
	|	КОНЕЦ,
	|	УчетСебестоимости.Сторно
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.АналитикаРасходов,
	|	ДД.Сторно,
	|	СУММА(ВЫБОР КОГДА ДД.Количество < 0
	|		ТОГДА -ДД.Количество
	|		ИНАЧЕ ДД.Количество КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ ЗнаменателиРасходовПартийНДС
	|ИЗ
	|	ВтПартии КАК ДД
	|ГДЕ
	|	ДД.Количество <> 0
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.АналитикаРасходов,
	|	ДД.Сторно
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.АналитикаРасходов,
	|	ДД.Сторно,
	|	СУММА(ВЫБОР КОГДА ДД.Количество < 0
	|		ТОГДА -ДД.Количество
	|		ИНАЧЕ ДД.Количество 
	|	КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ ЗнаменателиРасходовСебестоимости
	|ИЗ
	|	ВТСебестоимость КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.РазделУчета,
	|	ДД.ВидЗапасов,
	|	ДД.Организация,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.СтатьяРасходовСписания,
	|	ДД.АналитикаРасходов,
	|	ДД.Сторно
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	УчетСебестоимости.Период КАК Период,
	|	УчетСебестоимости.Регистратор КАК Регистратор,
	|	УчетСебестоимости.Организация КАК Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	УчетСебестоимости.Партия КАК Партия,
	|	УчетСебестоимости.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	УчетСебестоимости.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов КАК АналитикаРасходов,
	|	УчетСебестоимости.Сторно КАК Сторно,
	|
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	УчетСебестоимости.РазделУчета КАК РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета КАК КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов КАК КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация КАК КорОрганизация,
	|	УчетСебестоимости.Подразделение КАК Подразделение,
	|	УчетСебестоимости.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	УчетСебестоимости.ПринятиеКНалоговомуУчету КАК ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции КАК ГруппаПродукции,
	|	УчетСебестоимости.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.ДокументДвижения КАК ДокументДвижения,
	|	ЛОЖЬ КАК ЭтоПередачаМеждуОрганизациями,
	|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости) КАК ТипЗаписи,
	|
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Количество < 0
	|		ТОГДА -УчетСебестоимости.Количество
	|		ИНАЧЕ УчетСебестоимости.Количество 
	|	КОНЕЦ * ЗнаменателиРасходов.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Количество < 0
	|		ТОГДА -УчетСебестоимости.Количество
	|		ИНАЧЕ УчетСебестоимости.Количество 
	|	КОНЕЦ * ЗнаменателиРасходов.Количество) КАК ИсходноеКоличество
	|ИЗ
	|	ВТСебестоимость КАК УчетСебестоимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗнаменателиРасходовПартийНДС КАК ЗнаменателиРасходов
	|		ПО ЗнаменателиРасходов.Регистратор = УчетСебестоимости.Регистратор
	|		И ЗнаменателиРасходов.Партия = УчетСебестоимости.Партия
	|		И ЗнаменателиРасходов.АналитикаУчетаПартий = УчетСебестоимости.АналитикаУчетаПартий
	|		И ЗнаменателиРасходов.ВидДеятельностиНДС = УчетСебестоимости.ВидДеятельностиНДС
	|		И ЗнаменателиРасходов.АналитикаФинансовогоУчета = УчетСебестоимости.АналитикаФинансовогоУчета
	|		И ЗнаменателиРасходов.АналитикаУчетаНоменклатуры = УчетСебестоимости.АналитикаУчетаНоменклатуры
	|		И ЗнаменателиРасходов.ВидЗапасов = УчетСебестоимости.ВидЗапасов
	|		И ЗнаменателиРасходов.РазделУчета = УчетСебестоимости.РазделУчета
	|		И ЗнаменателиРасходов.Организация = УчетСебестоимости.Организация
	|		И ЗнаменателиРасходов.СтатьяРасходовСписания = УчетСебестоимости.СтатьяРасходовСписания
	|		И ЗнаменателиРасходов.АналитикаРасходов = УчетСебестоимости.АналитикаРасходов
	|		И ЗнаменателиРасходов.Сторно = УчетСебестоимости.Сторно
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетСебестоимости.Период,
	|	УчетСебестоимости.Регистратор,
	|	УчетСебестоимости.Организация,
	|	УчетСебестоимости.АналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.ВидЗапасов,
	|	УчетСебестоимости.Партия,
	|	УчетСебестоимости.АналитикаУчетаПартий,
	|	УчетСебестоимости.КорПартия,
	|	УчетСебестоимости.КорАналитикаУчетаПартий,
	|	УчетСебестоимости.АналитикаФинансовогоУчета,
	|	УчетСебестоимости.СтатьяРасходовСписания,
	|	УчетСебестоимости.АналитикаРасходов,
	|	УчетСебестоимости.Сторно,
	|	УчетСебестоимости.РазделУчета,
	|	УчетСебестоимости.АналитикаУчетаПоПартнерам,
	|	УчетСебестоимости.ЗаказКлиента,
	|	УчетСебестоимости.ХозяйственнаяОперация,
	|	УчетСебестоимости.КорАналитикаУчетаНоменклатуры,
	|	УчетСебестоимости.КорРазделУчета,
	|	УчетСебестоимости.КорВидЗапасов,
	|	УчетСебестоимости.КорОрганизация,
	|	УчетСебестоимости.Подразделение,
	|	УчетСебестоимости.ВариантРаспределенияРасходовУпр,
	|	УчетСебестоимости.ВариантРаспределенияРасходовРегл,
	|	УчетСебестоимости.ПринятиеКНалоговомуУчету,
	|	УчетСебестоимости.ГруппаПродукции,
	|	УчетСебестоимости.НаправлениеДеятельности,
	|	УчетСебестоимости.КорНаправлениеДеятельности,
	|	УчетСебестоимости.КорАналитикаФинансовогоУчета,
	|	УчетСебестоимости.КорВидДеятельностиНДС,
	|	УчетСебестоимости.ДокументДвижения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР КОГДА УчетСебестоимости.Количество < 0
	|		ТОГДА -УчетСебестоимости.Количество
	|		ИНАЧЕ УчетСебестоимости.Количество 
	|	КОНЕЦ) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.Партия КАК Партия,
	|	Партии.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов КАК АналитикаРасходов,
	|	Партии.Сторно КАК Сторно,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидДвижения,
	|	Партии.РазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовРегл,
	|	НЕОПРЕДЕЛЕНО КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаПродукции,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|	Партии.КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	ЛОЖЬ 		 КАК ЭтоПередачаМеждуОрганизациями,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗаписи,
	|
	|	СУММА(ВЫБОР КОГДА Партии.Количество < 0
	|		ТОГДА -Партии.Количество
	|		ИНАЧЕ Партии.Количество 
	|	КОНЕЦ * ЗнаменателиРасходов.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Партии.НДСРегл) КАК СтоимостьРегл,
	|	СУММА(Партии.НДСУпр) КАК СтоимостьУпр,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК ИсходноеКоличество
	|ИЗ
	|	ВтПартии КАК Партии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗнаменателиРасходовСебестоимости КАК ЗнаменателиРасходов
	|		ПО ЗнаменателиРасходов.Регистратор = Партии.Регистратор
	|		И ЗнаменателиРасходов.Партия = Партии.Партия
	|		И ЗнаменателиРасходов.АналитикаУчетаПартий = Партии.АналитикаУчетаПартий
	|		И ЗнаменателиРасходов.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|		И ЗнаменателиРасходов.АналитикаФинансовогоУчета = Партии.АналитикаФинансовогоУчета
	|		И ЗнаменателиРасходов.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		И ЗнаменателиРасходов.ВидЗапасов = Партии.ВидЗапасов
	|		И ЗнаменателиРасходов.РазделУчета = Партии.РазделУчета
	|		И ЗнаменателиРасходов.Организация = Партии.Организация
	|		И ЗнаменателиРасходов.СтатьяРасходовСписания = Партии.СтатьяРасходовСписания
	|		И ЗнаменателиРасходов.АналитикаРасходов = Партии.АналитикаРасходов
	|		И ЗнаменателиРасходов.Сторно = Партии.Сторно
	|ГДЕ
	|	Партии.Количество <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.СтатьяРасходовСписания,
	|	Партии.АналитикаРасходов,
	|	Партии.Сторно,
	|	Партии.РазделУчета,
	|	Партии.КорВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.Количество) <> 0
	|	И (СУММА(Партии.НДСРегл) <> 0 ИЛИ СУММА(Партии.НДСУпр) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	Партия,
	|	СтатьяРасходовСписания,
	|	АналитикаРасходов,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	АналитикаФинансовогоУчета,
	|	Сторно,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов, Организация, Склад, Партия, АналитикаФинансовогоУчета,
	|АналитикаУчетаНоменклатуры, ВидЗапасов,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов, АналитикаУчетаПоПартнерам, ЭтоПередачаМеждуОрганизациями,
	|КорАналитикаУчетаНоменклатуры, КорРазделУчета, КорВидЗапасов, КорТипЗапасов, КорОрганизация,
	|АналитикаУчетаНоменклатурыВО, АналитикаФинансовогоУчетаВО, АналитикаАктивовПассивов, КорСклад,
	|СтатьяАктивовПассивов, Подразделение, АналитикаРасходов, СтатьяРасходовСписания, СтатьяДоходов, АналитикаДоходов,
	|ВариантРаспределенияРасходовУпр, ВариантРаспределенияРасходовРегл,
	|ДокументДвижения, ИдентификаторСтроки, ПринятиеКНалоговомуУчету, ГруппаПродукции, СписаниеПриПередачеНУ,
	|ИсточникГФУНоменклатуры, КорИсточникГФУНоменклатуры, НаправлениеДеятельности, КорНаправлениеДеятельности,
	|Стоимость, СтоимостьБезНДС, Количество, КорСтоимость, ПостояннаяРазница, ВременнаяРазница,
	|ДопРасходы, ДопРасходыБезНДС, СтоимостьРегл, НДСРегл,
	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета, КорВидДеятельностиНДС,
	|СтатьяКалькуляции, ТипЗаписи, ДокументИсточник, ИдентификаторФинЗаписи, Сторно,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПостоянныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл,
	|ПостатейныеПеременныеСНДС, ПостатейныеПеременныеБезНДС, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр, НДСУпр
	|");
	
	СуммыРаспределения = Новый Структура("
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов, Партия, АналитикаФинансовогоУчета, СтатьяРасходовСписания, АналитикаРасходов,
	|АналитикаУчетаНоменклатуры, ВидЗапасов, РазделУчета, Сторно,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, СтоимостьРегл, СтоимостьУпр, СтоимостьЗабалансоваяРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ДопРасходыРегл, ДопРасходыУпр, ПостояннаяРазница, ВременнаяРазница
	|");
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	// Формируются движения по регистрам:
	// - СебестоимостьТоваров
	// - ПрочиеРасходы
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
			И СтрокаОстатка.Организация = Выборка.Организация
			И СтрокаОстатка.Партия = Выборка.Партия
			И СтрокаОстатка.РазделУчета = Выборка.РазделУчета
			И СтрокаОстатка.СтатьяРасходовСписания = Выборка.СтатьяРасходовСписания
			И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
			И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
			И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
			И СтрокаОстатка.СтатьяРасходовСписания = Выборка.СтатьяРасходовСписания
			И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
			И СтрокаОстатка.Сторно = Выборка.Сторно Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(СуммыРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			РасчетСебестоимостиКорректировкаСтоимости.ДополнитьСуммыРаспределения(ЗаписьРаспределения, СуммыРаспределения);
			
			Если ЗаписьРаспределения.СтоимостьРегл <> 0 ИЛИ ЗаписьРаспределения.СтоимостьУпр <> 0 Тогда
					
				// Если есть кор. раздел - необходимо скорректировать стоимость в кор. части.
				Если ЗначениеЗаполнено(ЗаписьРаспределения.КорРазделУчета) Тогда
					
					РасчетСебестоимостиКорректировкаСтоимости.СформироватьКорДвиженияСебестоимостьТоваров(ПараметрыРасчета, ЗаписьРаспределения, ПараметрыРасчета.ПредварительныйРасчет);
							
				КонецЕсли;
				
				Если ПараметрыРасчета.ПредварительныйРасчет Тогда
					Продолжить;
				КонецЕсли;
				
				// Корректировка списания товаров на затраты в регистре учет прочих расходов.
				Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваров
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноСписанияНаРасходы
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПорчаТоваровСПереоценкой
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПересортицаПартийТоваров
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаПрочиеЦели
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию
				 Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераОСписании Тогда
				 	
				 	СуммовыеПоказатели = Новый Структура;
					СуммовыеПоказатели.Вставить("СуммаСНДС", 0);
					СуммовыеПоказатели.Вставить("СуммаБезНДС", 0);
					СуммовыеПоказатели.Вставить("СуммаРегл", ЗаписьРаспределения.СтоимостьРегл);
					СуммовыеПоказатели.Вставить("СуммаУпр", ЗаписьРаспределения.СтоимостьУпр);
					СуммовыеПоказатели.Вставить("ПостояннаяРазница", 0);
					СуммовыеПоказатели.Вставить("ВременнаяРазница", 0);
				 
				 	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходы(
				 		ПараметрыРасчета,
						ЗаписьРаспределения,
						СуммовыеПоказатели);
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВтПартии, ВтРегистраторы, ВТСебестоимость, ЗнаменателиРасходовПартийНДС, ЗнаменателиРасходовСебестоимости");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.18
Процедура ВключитьИсключитьНДСВСтоимостьПродаж(ПараметрыРасчета) Экспорт

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимостьПродаж");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	АналитикаПартнеров.Организация,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.Партия,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС
	|ПОМЕСТИТЬ ДвиженияПродаж
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|		ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов КАК ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.РаспределениеПоВыбывшимТоварам,
	|	СУММА(Партии.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДСУпр
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаПродукции КАК АналитикаУчетаНоменклатуры,
	|		ВЫБОР КОГДА Партии.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|			ТОГДА Партии.КорВидЗапасов
	|			ИНАЧЕ Партии.ВидЗапасов
	|		КОНЕЦ КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		0 КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Партии.НДСРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.АналитикаУчетаПартий.НалогообложениеНДС КАК НалогообложениеПартии,
	|		Партии.НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		Партии.Количество КАК Количество,
	|		Партии.НДСРегл КАК НДСРегл,
	|		0 КАК НДСУпр,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяСписанияНДС,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаСписанияНДС,
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК РазделУчета,
	|		НЕОПРЕДЕЛЕНО КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК ВидДеятельностиНДС,
	|		ЛОЖЬ КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровПереданныеНаКомиссию КАК Партии
	|	ГДЕ
	|		НЕ &ПартионныйУчетВерсии22
	|		И Партии.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Партии.Активность
	|		И Партии.Организация В(&МассивОрганизаций)
	|		И Партии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов КАК ВидЗапасов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.ДокументПоступления,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА (ВЫБОР
	|					КОГДА Партии.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|						ТОГДА Партии.СтоимостьБезНДС + Партии.НДС
	|					КОГДА Партии.СтоимостьБезНДС = 0 ТОГДА Партии.НДС
	|					ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ)
	|			ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		Партии.РазделУчета,
	|		(ВЫБОР
	|			КОГДА ДвиженияПродаж.Регистратор ЕСТЬ NULL ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Партии.Партия КОНЕЦ) КАК Партия,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|		Партии.АналитикаФинансовогоУчета,
	|		Партии.ВидДеятельностиНДС,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		ВТКэшРасчетныеОборотыДетализацияПартийТоваровДляНДСиУСН КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПродаж КАК ДвиженияПродаж
	|		 ПО ДвиженияПродаж.Период = Партии.Период
	|		 И ДвиженияПродаж.Регистратор = Партии.Регистратор
	|		 И ДвиженияПродаж.Организация = Партии.Организация
	|		 И ДвиженияПродаж.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		 И ДвиженияПродаж.Партия = Партии.Партия
	|		 И ДвиженияПродаж.АналитикаФинансовогоУчета = Партии.АналитикаФинансовогоУчета
	|		 И ДвиженияПродаж.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии22)
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|		И НЕ Партии.Сторно
	|	
	|	) КАК Партии
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация = Партии.Организация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступления
	|ГДЕ
	|	Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.РаспределениеПоВыбывшимТоварам
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.РазделУчета				   КАК РазделУчета,
	|	Продажи.Партия				   	   КАК Партия,
	|	Продажи.АналитикаУчетаПартий	   КАК АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
	|	СУММА(ВЫБОР
	|		КОГДА Продажи.РасчетПартий И Продажи.Количество = 0
	|			ТОГДА (ВЫБОР
	|				КОГДА Продажи.ДопРасходыРегл = 0 ТОГДА Продажи.НДСРегл
	|				ИНАЧЕ Продажи.ДопРасходыРегл КОНЕЦ)
	|		КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	СУММА(Продажи.Количество)          КАК ИсходноеКоличество,
	|	0                                  КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Продажи.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|
	|ГДЕ
	|	Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	Продажи.РазделУчета,
	|	Продажи.Партия,
	|	Продажи.АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА Продажи.РасчетПартий И Продажи.Количество = 0
	|			ТОГДА (ВЫБОР
	|				КОГДА Продажи.ДопРасходыРегл = 0 ТОГДА Продажи.НДСРегл
	|				ИНАЧЕ Продажи.ДопРасходыРегл КОНЕЦ)
	|		КОГДА Продажи.Количество < 0 ТОГДА
	|			0 - Продажи.Количество
	|		ИНАЧЕ
	|			Продажи.Количество
	|		КОНЕЦ
	|	) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 								   КАК Порядок,
	|	Партии.Период 					   КАК Период,
	|	Партии.Регистратор 				   КАК Регистратор,
	|	Партии.Регистратор 				   КАК ДокументДвижения,
	|	Партии.Организация 				   КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов 				   КАК ВидЗапасов,
	|	Партии.РазделУчета				   КАК РазделУчета,
	|	Партии.Партия				   	   КАК Партия,
	|	Партии.АналитикаУчетаПартий	       КАК АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета   КАК АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|	"""" КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(Партии.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСРегл КОНЕЦ) КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСРегл КОНЕЦ) КАК СтоимостьУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|	ИЛИ СУММА(Партии.НДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	РазделУчета,
	|	Партия,
	|	АналитикаФинансовогоУчета,
	|	ВидДеятельностиНДС,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов,
	|Подразделение, АналитикаУчетаПоПартнерам,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры,
	|НалогообложениеНДС, ДокументДвижения, ИдентификаторФинЗаписи,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Стоимость, СтоимостьБезНДС, Количество,
	|ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, НДСРегл, НДСУпр, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
		 И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
		 И СтрокаОстатка.РазделУчета = Выборка.РазделУчета
		 И СтрокаОстатка.Партия = Выборка.Партия
		 И СтрокаОстатка.АналитикаФинансовогоУчета = Выборка.АналитикаФинансовогоУчета
		 И СтрокаОстатка.ВидДеятельностиНДС = Выборка.ВидДеятельностиНДС
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);

		КонецЕсли;
		
	КонецЦикла;
	
 	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ВтПартии, ДвиженияПродаж, ВтРегистраторы");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Этап 3.18.2
Процедура ВключитьИсключитьНДСВСтоимостьПродаж24(ПараметрыРасчета) Экспорт

	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета, "ВТОборотыСтоимостьПартийНДС") Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ВключитьИсключитьНДСВСтоимостьПродаж24");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	АналитикаПартнеров.Организация,
	|	Продажи.Партия,
	|	Продажи.ВидДеятельностиНДС,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов
	|ПОМЕСТИТЬ ДвиженияПродаж
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|		ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Организация,
	|	Партия,
	|	ВидДеятельностиНДС,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторыВыручки
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ДД
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Партии.Период КАК Период,
	|	Партии.Регистратор КАК Регистратор,
	|	Партии.Организация КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.ЕстьДвиженияПоВыручке,
	|	Партии.РаспределениеПоВыбывшимТоварам,
	|
	|	МАКСИМУМ(Партии.Количество) КАК Количество,
	|	СУММА(Партии.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(Партии.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСРегл
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСРегл
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСРегл,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			Партии.НДСУпр
	|
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		ТОГДА
	|			-Партии.НДСУпр
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		 И Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
	|		 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
	|		ТОГДА
	|			-Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК НДСУпр,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДС,
	|	СУММА(
	|		ВЫБОР КОГДА Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА Партии.НДСУпр
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	) КАК СписаниеНДСУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.НалогообложениеПартии В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|			ТОГДА Партии.СтоимостьБезНДС + Партии.НДСРегл
	|		КОГДА Партии.СтоимостьБезНДС = 0
	|			ТОГДА Партии.НДСРегл
	|		ИНАЧЕ Партии.СтоимостьБезНДС КОНЕЦ) КАК Стоимость
	|ПОМЕСТИТЬ ВтПартии
	|ИЗ (
	|	ВЫБРАТЬ
	|		Партии.Период КАК Период,
	|		Партии.Регистратор КАК Регистратор,
	|		Партии.Организация КАК Организация,
	|		Партии.АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов,
	|		Партии.ВидДеятельностиНДС КАК НалогообложениеПартии,
	|		Партии.КорВидДеятельностиНДС КАК НалогообложениеНДС,
	|		Партии.ДокументПоступления КАК ДокументПоступления,
	|		Партии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		Партии.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|		Партии.НДС КАК НДСРегл,
	|		Партии.НДСУпр КАК НДСУпр,
	|		Партии.Количество,
	|		Партии.СтатьяСписанияНДС,
	|		Партии.АналитикаСписанияНДС,
	|		Партии.РазделУчета,
	|		(ВЫБОР
	|			КОГДА ДвиженияПродаж.Регистратор ЕСТЬ NULL ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Партии.Партия КОНЕЦ) КАК Партия,
	|		НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|		Партии.ВидДеятельностиНДС,
	|		Партии.АналитикаУчетаНоменклатуры,
	|		Партии.ВидЗапасов,
	|		ВЫБОР КОГДА Регистраторы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ЕстьДвиженияПоВыручке,
	|		(ВЫБОР
	|			КОГДА Партии.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределениеПоВыбывшимТоварам
	|	ИЗ
	|		ВТОборотыСтоимостьПартийНДС КАК Партии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРегистраторыВыручки КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Партии.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПродаж КАК ДвиженияПродаж
	|		 ПО ДвиженияПродаж.Период = Партии.Период
	|		 И ДвиженияПродаж.Регистратор = Партии.Регистратор
	|		 И ДвиженияПродаж.Организация = Партии.Организация
	|		 И ДвиженияПродаж.Партия = Партии.Партия
	|		 И ДвиженияПродаж.ВидДеятельностиНДС = Партии.ВидДеятельностиНДС
	|		 И ДвиженияПродаж.АналитикаУчетаНоменклатуры = Партии.АналитикаУчетаНоменклатуры
	|		 И ДвиженияПродаж.ВидЗапасов = Партии.ВидЗапасов
	|	ГДЕ
	|		&ПартионныйУчетВерсии22
	|		И Партии.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|		И НЕ Партии.СлужебноеВидДвиженияПриход
	|		И НЕ Партии.Сторно
	|	
	|	) КАК Партии
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация = Партии.Организация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступления
	|ГДЕ
	|	Партии.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	И (Партии.ЕстьДвиженияПоВыручке
	|		ИЛИ Партии.СтатьяСписанияНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.СтатьяСписанияНДС,
	|	Партии.АналитикаСписанияНДС,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС,
	|	Партии.ЕстьДвиженияПоВыручке,
	|	Партии.РаспределениеПоВыбывшимТоварам
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.НДСРегл <> 0
	|	ИЛИ Партии.НДСУпр <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	Продажи.Период                     КАК Период,
	|	Продажи.Регистратор                КАК Регистратор,
	|	Продажи.Регистратор                КАК ДокументДвижения,
	|	АналитикаПартнеров.Организация     КАК Организация,
	|	Продажи.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажи.ВидЗапасов                 КАК ВидЗапасов,
	|	Продажи.РазделУчета				   КАК РазделУчета,
	|	Продажи.Партия				   	   КАК Партия,
	|	Продажи.АналитикаУчетаПартий	   КАК АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	Продажи.ЗаказКлиента               КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам  КАК АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение              КАК Подразделение,
	|	Продажи.ТипЗапасов                 КАК ТипЗапасов,
	|	Продажи.Менеджер                   КАК Менеджер,
	|	Продажи.Склад                      КАК Склад,
	|	Продажи.Соглашение                 КАК Соглашение,
	|	Продажи.Договор                    КАК Договор,
	|	Продажи.ХозяйственнаяОперация      КАК ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС         КАК НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов       КАК ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента            КАК ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры    КАК ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов        КАК ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	&ИдентификаторНеиспользуемойФинЗаписи КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(Продажи.Количество) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	0 КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	0 КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	0 КАК СтоимостьУпр,
	|	0 КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	СУММА(Продажи.Количество) КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = Продажи.Регистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК АналитикаПартнеров
	|			ПО Продажи.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
	|			ПО Цены.Организация = АналитикаПартнеров.Организация
	|			И Цены.Партия = Продажи.Партия
	|			И Цены.АналитикаУчетаПартий = Продажи.АналитикаУчетаПартий
	|			И Цены.АналитикаФинансовогоУчета = Продажи.АналитикаФинансовогоУчета
	|			И Цены.ВидДеятельностиНДС = Продажи.ВидДеятельностиНДС
	|			И Цены.АналитикаУчетаНоменклатуры = Продажи.АналитикаУчетаНоменклатуры
	|			И Цены.ВидЗапасов = Продажи.ВидЗапасов
	|			И Цены.РазделУчета = Продажи.РазделУчета
	|
	|ГДЕ
	|	АналитикаПартнеров.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Продажи.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Регистратор,
	|	Продажи.АналитикаУчетаНоменклатуры,
	|	Продажи.ЗаказКлиента,
	|	Продажи.АналитикаУчетаПоПартнерам,
	|	Продажи.Подразделение,
	|	Продажи.ТипЗапасов,
	|	Продажи.ВидЗапасов,
	|	Продажи.Менеджер,
	|	Продажи.Склад,
	|	Продажи.Соглашение,
	|	Продажи.Договор,
	|	Продажи.ХозяйственнаяОперация,
	|	Продажи.НалогообложениеНДС,
	|	Продажи.ВалютаВзаиморасчетов,
	|	Продажи.ВалютаДокумента,
	|	Продажи.ИсточникГФУНоменклатуры,
	|	Продажи.ИсточникГФУРасчетов,
	|	Продажи.НаправлениеДеятельностиКонтрагента,
	|	Продажи.НаправлениеДеятельностиНоменклатуры,
	|	АналитикаПартнеров.Организация,
	|	Продажи.РазделУчета,
	|	Продажи.Партия,
	|	Продажи.АналитикаУчетаПартий,
	|	Продажи.АналитикаФинансовогоУчета,
	|	Продажи.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Продажи.Количество) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 								   КАК Порядок,
	|	Партии.Период 					   КАК Период,
	|	Партии.Регистратор 				   КАК Регистратор,
	|	Партии.Регистратор 				   КАК ДокументДвижения,
	|	Партии.Организация 				   КАК Организация,
	|	Партии.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов 				   КАК ВидЗапасов,
	|	Партии.РазделУчета				   КАК РазделУчета,
	|	Партии.Партия				   	   КАК Партия,
	|	НЕОПРЕДЕЛЕНО	       			   КАК АналитикаУчетаПартий,
	|	Партии.АналитикаФинансовогоУчета   КАК АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС		   КАК ВидДеятельностиНДС,
	|
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК Менеджер,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиНоменклатуры,
	|	"""" КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(ВЫБОР КОГДА Партии.Количество < 0 ТОГДА -Партии.Количество
	|		ИНАЧЕ Партии.Количество КОНЕЦ) КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК ДопРасходы,
	|	0 КАК ДопРасходыБезНДС,
	|	0 КАК СтоимостьЗабалансовая,
	|	0 КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСРегл КОНЕЦ) КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК НДСУпр,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК Трудозатраты,
	|	0 КАК ПостатейныеПостоянныеСНДС,
	|	0 КАК ПостатейныеПеременныеСНДС,
	|	0 КАК ПостатейныеПостоянныеБезНДС,
	|	0 КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРегл,
	|	0 КАК ТрудозатратыРегл,
	|	0 КАК ПостатейныеПостоянныеРегл,
	|	0 КАК ПостатейныеПеременныеРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА 0
	|		ИНАЧЕ Партии.НДСУпр КОНЕЦ) КАК СтоимостьУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Партии.РаспределениеПоВыбывшимТоварам ТОГДА Партии.НДСУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпр,
	|	0 КАК ТрудозатратыУпр,
	|	0 КАК ПостатейныеПостоянныеУпр,
	|	0 КАК ПостатейныеПеременныеУпр,
	|
	|	0 КАК ИсходноеКоличество,
	|	0 КАК КорСтоимость
	|ИЗ
	|	ВтПартии КАК Партии
	|ГДЕ
	|	Партии.Стоимость <> 0
	|	И Партии.ЕстьДвиженияПоВыручке
	|
	|СГРУППИРОВАТЬ ПО
	|	Партии.Период,
	|	Партии.Регистратор,
	|	Партии.Организация,
	|	Партии.АналитикаУчетаНоменклатуры,
	|	Партии.ВидЗапасов,
	|	Партии.РазделУчета,
	|	Партии.Партия,
	|	Партии.АналитикаФинансовогоУчета,
	|	Партии.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Партии.НДСРегл) <> 0
	|	ИЛИ СУММА(Партии.НДСУпр) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Организация,
	|	Партия,
	|	ВидДеятельностиНДС,
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	Порядок
	|";
	
	ЗаписьРаспределения = Новый Структура("
	|Период, АналитикаУчетаНоменклатуры, ВидЗапасов, Организация, Менеджер,
	|ХозяйственнаяОперация, ЗаказКлиента, ТипЗапасов,
	|Подразделение, АналитикаУчетаПоПартнерам,
	|Склад, Соглашение, Договор, ВалютаВзаиморасчетов, ВалютаДокумента,
	|ИсточникГФУНоменклатуры, ИсточникГФУРасчетов,
	|НаправлениеДеятельностиКонтрагента, НаправлениеДеятельностиНоменклатуры,
	|НалогообложениеНДС, ДокументДвижения, ИдентификаторФинЗаписи,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Стоимость, СтоимостьБезНДС, Количество,
	|ДопРасходы, ДопРасходыБезНДС,
	|СтоимостьРегл, НДСРегл, НДСУпр, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	СтрокаОстатка = Новый Структура("
	|Регистратор, Организация, АналитикаУчетаНоменклатуры, ВидЗапасов,
	|РазделУчета, Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС,
	|Количество, Стоимость, СтоимостьБезНДС, СтоимостьРегл, НДСРегл, НДСУпр,
	|ДопРасходы, ДопРасходыБезНДС, ПостояннаяРазница, ВременнаяРазница,
	|СтоимостьЗабалансовая, Трудозатраты, ПостатейныеПостоянныеСНДС, ПостатейныеПеременныеСНДС,
	|ПостатейныеПостоянныеБезНДС, ПостатейныеПеременныеБезНДС,
	|СтоимостьЗабалансоваяРегл, ДопРасходыРегл, ТрудозатратыРегл, ПостатейныеПостоянныеРегл, ПостатейныеПеременныеРегл,
	|СтоимостьУпр, ДопРасходыУпр, ТрудозатратыУпр, ПостатейныеПостоянныеУпр, ПостатейныеПеременныеУпр");
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина,,,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			
		ИначеЕсли СтрокаОстатка.Регистратор = Выборка.Регистратор
		 И СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.Партия = Выборка.Партия
		 И СтрокаОстатка.ВидДеятельностиНДС = Выборка.ВидДеятельностиНДС
		 И СтрокаОстатка.АналитикаУчетаНоменклатуры = Выборка.АналитикаУчетаНоменклатуры
		 И СтрокаОстатка.ВидЗапасов = Выборка.ВидЗапасов
		 И СтрокаОстатка.Количество > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, Выборка);
			
			РасчетСебестоимостиКорректировкаСтоимости.РаспределитьСтоимость(ЗаписьРаспределения, СтрокаОстатка, Выборка, Выборка.Количество);
			
			РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияВыручкаИСебестоимостьПродаж(ПараметрыРасчета, ЗаписьРаспределения);

		КонецЕсли;
		
	КонецЦикла;
	
	// Формируются движения по регистрам:
	// - ПрочиеРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияПрочиеРасходыСписаниеНДС(ПараметрыРасчета);
	
	// Формируются движения по регистрам:
	// - ДвиженияНоменклатураДоходыРасходы
	РасчетСебестоимостиКорректировкаСтоимости.СформироватьДвиженияНоменклатураДоходыРасходыСписаниеНДС(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(
		ПараметрыРасчета,
		"ВтПартии, ДвиженияПродаж, ВтРегистраторыВыручки, ВтРегистраторы");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область УчетНДС

// Возвращает имя регистра, используемого для учета партий НДС, при партионном учете версии 2.2.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - организация
//	Период 		- Дата - период учета НДС
//
// Возвращаемое значение:
//	Строка - имя регистра учета партий НДС; возможные значения "ДетализацияПартийТоваровДляНДСиУСН", "ДетализацияПартийТоваровДляНДСиУСН2_4"
//
Функция ИмяРегистраУчетаПартийНДС(Организация, Период = Неопределено) Экспорт
	
	ИмяРегистра 		   = "";
	ПериодПолитики		   = НачалоМесяца(?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса()));
	ПартионныйУчетВерсии22 = РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(ПериодПолитики);
	
	Если ПартионныйУчетВерсии22 Тогда
		
		ПараметрыУчетнойПолитикиНастройкиУчетаНДС = НастройкиНалоговУчетныхПолитикПовтИсп.ДействующиеПараметрыНалоговУчетныхПолитик(
			"НастройкиУчетаНДС",
			Организация,
			ПериодПолитики);
		
		ПараметрыУчетнойПолитикиНастройкиУчетаУСН = НастройкиНалоговУчетныхПолитикПовтИсп.ДействующиеПараметрыНалоговУчетныхПолитик(
			"НастройкиУчетаУСН",
			Организация,
			ПериодПолитики);
		
		ПараметрыУчетнойПолитикиНастройкиСистемыНалогообложения = НастройкиНалоговУчетныхПолитикПовтИсп.ДействующиеПараметрыНалоговУчетныхПолитик(
			"НастройкиСистемыНалогообложения",
			Организация,
			ПериодПолитики);
		
		Если (ПараметрыУчетнойПолитикиНастройкиУчетаНДС <> Неопределено 
		 	И ПараметрыУчетнойПолитикиНастройкиУчетаНДС.РаздельныйУчетТоваровПоНалогообложениюНДС)
		 ИЛИ (ПараметрыУчетнойПолитикиНастройкиСистемыНалогообложения <> Неопределено
		 		И ПараметрыУчетнойПолитикиНастройкиУчетаНДС <> Неопределено 
		 		И ПараметрыУчетнойПолитикиНастройкиСистемыНалогообложения.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная
		 		И ПараметрыУчетнойПолитикиНастройкиУчетаУСН.РаздельныйУчетТоваров) Тогда
				
					ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитикПовтИсп.ДействующиеПараметрыНалоговУчетныхПолитик(
						"УчетнаяПолитикаФинансовогоУчета",
						Организация,
						ПериодПолитики);
						
					Если ПараметрыУчетнойПолитики <> Неопределено
						И ПараметрыУчетнойПолитики.МетодОценкиСтоимостиТоваров = Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка Тогда
						ИмяРегистра = Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4.Имя;
					Иначе
						ИмяРегистра = Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН.Имя;
					КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяРегистра;
	
КонецФункции

// Формирует временную таблицу ВТСтоимостьПартийНДС, содержащую информацию о ценах партий НДС.
//
Процедура СформироватьДетализациюПартийНДС(МенеджерВременныхТаблиц, Организация,
			НачалоПериода, КонецПериода, УничтожатьВспомогательныеТаблицы = Истина, СтруктураОтбора = Неопределено) Экспорт
	
	ИмяТаблицыРезультата = "ВТСтоимостьПартийНДС"; 
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, ИмяТаблицыРезультата);
	
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОрганизаций", 			  ОбщегоНазначенияУТКлиентСервер.Массив(Организация));
	Запрос.УстановитьПараметр("НачалоПериода", 	   			  НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	   			  КонецМесяца(КонецПериода));
	
	ИнициализироватьДополнительныеПараметрыЗапросаДетализацииПартийНДС(Запрос);
	
	Запрос.Текст = ТекстЗапросаДетализацияПартийНДС(,,, СтруктураОтбора);
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("РезультатВыполненияЗапроса", "");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	// Выведем информацию в журнал регистрации
	Если ЗначениеЗаполнено(СтруктураОтбора) Тогда
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			ИмяТаблицы = КлючИЗначение.Ключ;
			Прервать;
		КонецЦикла;
		
		ТекстОтбор = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"""%1"" (%2)",
			ИмяТаблицы,
			РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(МенеджерВременныхТаблиц, ИмяТаблицы));
		
	Иначе
		ТекстОтбор = НСтр("ru = 'не задан'", ОбщегоНазначения.КодОсновногоЯзыка())
	КонецЕсли;
	
	ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Период: %1
			|Организации: %2
			|Отбор: %3
			|%4'", ОбщегоНазначения.КодОсновногоЯзыка()),
		РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(НачалоПериода),
		РасчетСебестоимостиПрикладныеАлгоритмы.ПредставлениеОрганизаций(ОбщегоНазначенияУТКлиентСервер.Массив(Организация), ", ", Истина),
		ТекстОтбор,
		ПараметрыРасчета.РезультатВыполненияЗапроса);
	
	ЗаписьЖурналаРегистрации(
		РасчетСебестоимостиПрикладныеАлгоритмы.ИмяСобытияЖурналаРегистрации(Неопределено, "СформироватьДетализациюПартийНДС"),
		УровеньЖурналаРегистрации.Информация,,,
		ТекстДляПротокола);
	
	Если УничтожатьВспомогательныеТаблицы Тогда
		
		НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(
			МенеджерВременныхТаблиц,
			РасчетСебестоимостиУниверсальныеАлгоритмы.СоединитьСтроки(СуществующиеВТ, ИмяТаблицыРезультата));
		
		РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, НовыеВТ);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текст запроса формирования временной таблицы ВТСтоимостьПартийНДС.
// 
// Параметры:
// 	ТекстОрганизация - Строка - имя параметра для отбора по организации
// 	ТекстНачалоПериода - Строка - имя параметра для отбора по началу периода
// 	ТекстКонецПериода - Строка - имя параметра для отбора по концу периода
//	СтруктураОтбора - Структура, Неопределено - описание временной таблицы для отбора
//
// Возвращаемое значение:
// 	Строка - текст запроса
//
Функция ТекстЗапросаДетализацияПартийНДС(ТекстОрганизация = "", ТекстНачалоПериода = "", ТекстКонецПериода = "", СтруктураОтбора = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Т.АналитикаУчетаНоменклатуры.Серия КАК Серия
	|ПОМЕСТИТЬ ВТПередачиБезНДС
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передачи
	|		ПО Т.Ссылка = Передачи.Ссылка
	|ГДЕ
	|	Передачи.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Передачи.Организация В (&МассивОрганизаций)
	|	И Передачи.Проведен
	|	И Т.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий,
	|	Т.СтоимостьРегл,
	|	Т.НДСРегл,
	|	Т.НДСУпр
	|ПОМЕСТИТЬ ВТРаспределениеЗатрат
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Отбор
	|		ПО Т.Регистратор = Отбор.Ссылка
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ПериодРегистрации КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	Т.СтоимостьБезНДСРегл КАК СтоимостьБезНДС,
	|	Т.НДСРегл КАК НДС,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр
	|ПОМЕСТИТЬ ВТЦеныПартийНДС
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораПартийНДС КАК ОтборПартийНДС
	|	ПО &УсловияСоединения
	|ГДЕ
	|	Т.ПериодРегистрации <= &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.ПериодРегистрации КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтоимостьБезНДСРегл КАК СтоимостьБезНДС,
	|	Т.НДСРегл КАК НДС,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораПартийНДС КАК ОтборПартийНДС
	|	ПО &УсловияСоединения
	|ГДЕ
	|	Т.ПериодРегистрации <= &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	АналитикаУчетаПартий,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	Т.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Т.НДС КАК НДС,
	|	Т.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр КАК НДСУпр,
	|	Т.КоличествоПартии КАК КоличествоПартии
	|ПОМЕСТИТЬ ВТЦеныПартийНДСДетально
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораПартийНДС КАК ОтборПартийНДС
	|	ПО &УсловияСоединения
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И НЕ Т.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период,
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтоимостьБезНДСРегл,
	|	Т.НДСРегл,
	|	Т.СтоимостьБезНДСУпр,
	|	Т.НДСУпр,
	|	Т.КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораПартийНДС КАК ОтборПартийНДС
	|	ПО &УсловияСоединения
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И НЕ Т.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	АналитикаУчетаПартий,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ДокументПоступления
	|ПОМЕСТИТЬ ВТКорректировкиВДокументеПоступления
	|ИЗ
	|	ВТЦеныПартийНДС КАК Т
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.ДокументПоступления) = ТИП(Документ.КорректировкаПриобретения)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ДокументПоступления
	|ИЗ
	|	ВТЦеныПартийНДСДетально КАК Т
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.ДокументПоступления) = ТИП(Документ.КорректировкаПриобретения)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК ДокументПоступления,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления
	|ПОМЕСТИТЬ ВТИсключитьКорректировки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКорректировкиВДокументеПоступления КАК Отбор
	|		ПО Т.Регистратор = Отбор.ДокументПоступления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
	|		ПО Т.Регистратор = Корректировка.Ссылка
	|ГДЕ
	|	Корректировка.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
	|	И Т.Количество = 0
	|	И (Т.СтоимостьРегл < 0 ИЛИ Т.ДопРасходыРегл < 0)
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Партия
	|ПОМЕСТИТЬ ВТОтборПартии
	|ИЗ
	|	ВТЦеныПартийНДС КАК Т
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Партия
	|ИЗ
	|	ВТЦеныПартийНДСДетально КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС
	|ПОМЕСТИТЬ ВТДвиженияПеремещения
	|ИЗ
	|(ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|	Т.Количество
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораРегистраторов КАК ОтборРегистраторов
	|	ПО &УсловияДляРегистраторов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартии КАК ОтборПартии
	|	ПО Т.Партия = ОтборПартии.Партия
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Т.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И Т.Количество <> 0
	|	И НЕ Т.РазделУчета В (&РазделыУчетаЗабалансовые)
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Регистратор КАК Регистратор,
	|   Т.КорПартия,
	|   Т.КорАналитикаУчетаНоменклатуры,
	|   Т.КорРазделУчета,
	|   Т.КорВидЗапасов,
	|   ВЫБОР КОГДА Т.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		ТОГДА Т.Организация
	|		ИНАЧЕ Т.КорОрганизация
	|	КОНЕЦ,
	|   Т.КорАналитикаУчетаПартий,
	|   Т.КорАналитикаФинансовогоУчета,
	|   Т.КорВидДеятельностиНДС,
	|	-Т.Количество
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораРегистраторов КАК ОтборРегистраторов
	|	ПО &УсловияДляРегистраторов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартии КАК ОтборПартии
	|	ПО Т.Партия = ОтборПартии.Партия
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Т.Количество <> 0
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.Партия = Т.КорПартия
	|	И Т.ВидДеятельностиНДС = Т.КорВидДеятельностиНДС
	|	И ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО)
	|		= ЕСТЬNULL(Т.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО)
	|	И (Т.Организация = Т.КорОрганизация
	|		ИЛИ Т.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И Т.Активность
	|) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС
	|ИМЕЮЩИЕ
	|	СУММА(Т.Количество) = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ВидДвижения,
	|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
	|	Т.Регистратор КАК Регистратор,
	|   Т.Партия КАК Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|   Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|   Т.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТИтогКоличествоПредварительная
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораРегистраторов КАК ОтборРегистраторов
	|	ПО &УсловияДляРегистраторов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартии КАК ОтборПартии
	|	ПО Т.Партия = ОтборПартии.Партия
	|	И НЕ Т.РазделУчета В (&РазделыУчетаЗабалансовые)
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
	|	И Т.Активность
	|СГРУППИРОВАТЬ ПО
	|	Т.ВидДвижения,
	|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ),
	|	Т.Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|   Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|   Т.АналитикаУчетаНоменклатуры.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВТНоменклатураБезКоличества
	|ИЗ
	|	ВТИтогКоличествоПредварительная КАК Т
	|ГДЕ
	|	Т.Количество = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   Т.Партия КАК Партия
	|ПОМЕСТИТЬ ВТПартииБезКоличества
	|ИЗ
	|	ВТИтогКоличествоПредварительная КАК Т
	|ГДЕ
	|	Т.Количество = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   Т.Партия КАК Партия,
	|   Т.АналитикаУчетаПартий,
	|   ОтборНоменклатура.Номенклатура КАК Номенклатура,
	|   ОтборНоменклатура.Характеристика КАК Характеристика,
	|   ОтборНоменклатура.Назначение КАК Назначение,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|	СУММА(Т.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТКоличествоПартий
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартииБезКоличества КАК ОтборРегистраторов
	|		ПО Т.Регистратор = ОтборРегистраторов.Партия
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК ОтборАналитикаНоменклатуры
	|		ПО Т.АналитикаУчетаНоменклатуры = ОтборАналитикаНоменклатуры.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатураБезКоличества КАК ОтборНоменклатура
	|		ПО ОтборАналитикаНоменклатуры.Номенклатура = ОтборНоменклатура.Номенклатура
	|		И ОтборАналитикаНоменклатуры.Характеристика = ОтборНоменклатура.Характеристика
	|		И ОтборАналитикаНоменклатуры.Назначение = ОтборНоменклатура.Назначение
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Партия = Т.Регистратор
	|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И Т.Количество <> 0
	|	И Т.Активность
	|СГРУППИРОВАТЬ ПО
	|   Т.Партия,
	|   Т.АналитикаУчетаПартий,
	|   ОтборНоменклатура.Номенклатура,
	|   ОтборНоменклатура.Характеристика,
	|   ОтборНоменклатура.Назначение,
	|   Т.ВидЗапасов,
	|   Т.Организация
	|ИМЕЮЩИЕ
	|	СУММА(Т.Количество) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Период КАК Период,
	|	Т.Партия КАК Партия,
	|   Т.АналитикаУчетаПартий,
	|   ОтборНоменклатура.Номенклатура КАК Номенклатура,
	|   ОтборНоменклатура.Характеристика КАК Характеристика,
	|   ОтборНоменклатура.Назначение КАК Назначение,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|	СУММА(Т.КоличествоНачальныйОстаток) КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиПартий
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, ,
	|		Партия В (ВЫБРАТЬ Отбор.Партия ИЗ ВТПартииБезКоличества КАК Отбор)) КАК Т	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК ОтборАналитикаНоменклатуры
	|		ПО Т.АналитикаУчетаНоменклатуры = ОтборАналитикаНоменклатуры.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатураБезКоличества КАК ОтборНоменклатура
	|		ПО ОтборАналитикаНоменклатуры.Номенклатура = ОтборНоменклатура.Номенклатура
	|		И ОтборАналитикаНоменклатуры.Характеристика = ОтборНоменклатура.Характеристика
	|		И ОтборАналитикаНоменклатуры.Назначение = ОтборНоменклатура.Назначение
	|СГРУППИРОВАТЬ ПО
	|	Т.Период,
	|   Т.Партия,
	|   Т.АналитикаУчетаПартий,
	|   ОтборНоменклатура.Номенклатура,
	|   ОтборНоменклатура.Характеристика,
	|   ОтборНоменклатура.Назначение,
	|   Т.ВидЗапасов,
	|   Т.Организация
	|ИМЕЮЩИЕ
	|	СУММА(Т.КоличествоНачальныйОстаток) <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|   Т.Партия КАК Партия,
	|   Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация КАК Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|	Т.Количество,
	|	СУММА(ЕСТЬNULL(ОстаткиПартий.Количество, ЕСТЬNULL(КоличествоПартий.Количество, 1))) КАК КоличествоПартии
	|ПОМЕСТИТЬ ВТИтогКоличество
	|ИЗ
	|	ВТИтогКоличествоПредварительная КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиПартий КАК ОстаткиПартий
	|		ПО Т.Партия = ОстаткиПартий.Партия
	|		И Т.АналитикаУчетаПартий = ОстаткиПартий.АналитикаУчетаПартий
	|		И Т.Номенклатура = ОстаткиПартий.Номенклатура
	|		И Т.Характеристика = ОстаткиПартий.Характеристика
	|		И Т.Назначение = ОстаткиПартий.Назначение
	|		И Т.ВидЗапасов = ОстаткиПартий.ВидЗапасов
	|		И Т.Организация = ОстаткиПартий.Организация
	|		И Т.Количество = 0
	|		И Т.Период = ОстаткиПартий.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоПартий КАК КоличествоПартий
	|		ПО Т.Партия = КоличествоПартий.Партия
	|		И Т.АналитикаУчетаПартий = КоличествоПартий.АналитикаУчетаПартий
	|		И Т.Номенклатура = КоличествоПартий.Номенклатура
	|		И Т.Характеристика = КоличествоПартий.Характеристика
	|		И Т.Назначение = КоличествоПартий.Назначение
	|		И Т.ВидЗапасов = КоличествоПартий.ВидЗапасов
	|		И Т.Организация = КоличествоПартий.Организация
	|		И Т.Количество = 0
	|СГРУППИРОВАТЬ ПО
	|	Т.ВидДвижения,
	|	Т.Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|	Т.Количество
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.МоментВремени,
	|	Т.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК МесяцДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	ВЫБОР КОГДА Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ Т.ВидДвижения
	|	КОНЕЦ КАК ВидДвижения,
	|   Т.Партия КАК Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация КАК Организация,
	|   Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|   Т.ХозяйственнаяОперация,
	|   Т.КорАналитикаУчетаНоменклатуры,
	|   Т.КорРазделУчета,
	|   Т.КорВидЗапасов,
	|   Т.КорОрганизация,
	|   Т.КорСтоимость,
	|   Т.АналитикаУчетаПоПартнерам,
	|   Т.ЗаказКлиента,
	|   Т.Подразделение,
	|   Т.СтатьяРасходовСписания,
	|   Т.АналитикаРасходов,
	|   Т.СтатьяДоходов,
	|   Т.АналитикаДоходов,
	|   Т.ПериодПродажи,
	|   Т.СтатьяАктивовПассивов,
	|   Т.АналитикаАктивовПассивов,
	|   Т.ДокументДвижения,
	|   Т.ИдентификаторСтроки,
	|   Т.ГруппаПродукции,
	|   Т.РасчетПартий,
	|   Т.РасчетСебестоимости,
	|   Т.КорПартия,
	|   Т.КорАналитикаУчетаПартий,
	|   Т.КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ ПередачаВидыЗапасов.Ссылка ЕСТЬ NULL И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		 И Передача.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		КОГДА НЕ Передача.Ссылка ЕСТЬ NULL И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА Передача.НалогообложениеНДС
	|		КОГДА НЕ Возврат.Ссылка ЕСТЬ NULL И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Возврат.НалогообложениеНДС
	|		ИНАЧЕ Т.КорВидДеятельностиНДС
	|	КОНЕЦ КАК КорВидДеятельностиНДС,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
	|		ТОГДА Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности
	|		ИНАЧЕ Т.КорНаправлениеДеятельности
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|   Т.ГруппаПродукции КАК КорГруппаПродукции,
	|   Т.ТипЗаписи,
	|   Т.ДокументИсточник,
	|   Т.КодСтроки,
	|   Т.РасчетНеЗавершен,
	|   Т.НастройкаХозяйственнойОперации,
	|   Т.ИдентификаторФинЗаписи,
	|   Т.Сторно,
	|	ВЫБОР КОГДА Т.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|	  И Т.КорВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозможноСписаниеНДС,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,

	|	ВЫБОР КОГДА Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|		ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЗнакКоличество,
	|	Т.Количество КАК Количество,
	|	ИтогКоличество.Количество КАК КоличествоИтог,
	|	ИтогКоличество.КоличествоПартии КАК КоличествоПартии
	|ПОМЕСТИТЬ ВТДвиженияСебестоимостиДляПартийНДС
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораРегистраторов КАК ОтборРегистраторов
	|		ПО &УсловияДляРегистраторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборПартии КАК ОтборПартии
	|		ПО Т.Партия = ОтборПартии.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияПеремещения КАК ИсключитьПриходы
	|		ПО (ИсключитьПриходы.Регистратор = Т.Регистратор)
	|			И (ИсключитьПриходы.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры)
	|			И (ИсключитьПриходы.Организация = Т.Организация)
	|			И (ИсключитьПриходы.Партия = Т.Партия)
	|			И (ИсключитьПриходы.РазделУчета = Т.РазделУчета)
	|			И (ИсключитьПриходы.ВидЗапасов = Т.ВидЗапасов)
	|			И (ИсключитьПриходы.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (ИсключитьПриходы.ВидДеятельностиНДС = Т.ВидДеятельностиНДС)
	|			И (ИсключитьПриходы.АналитикаФинансовогоУчета = Т.АналитикаФинансовогоУчета)
	|			И (Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияПеремещения КАК ИсключитьРасходы
	|		ПО (ИсключитьРасходы.Регистратор = Т.Регистратор)
	|			И (ИсключитьРасходы.АналитикаУчетаНоменклатуры = Т.КорАналитикаУчетаНоменклатуры)
	|			И (ИсключитьРасходы.Организация =
	|				ВЫБОР КОГДА Т.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА Т.Организация
	|					ИНАЧЕ Т.КорОрганизация
	|				КОНЕЦ)
	|			И (ИсключитьРасходы.Партия = Т.КорПартия)
	|			И (ИсключитьРасходы.РазделУчета = Т.КорРазделУчета)
	|			И (ИсключитьРасходы.ВидЗапасов = Т.КорВидЗапасов)
	|			И (ИсключитьРасходы.АналитикаУчетаПартий = Т.КорАналитикаУчетаПартий)
	|			И (ИсключитьРасходы.ВидДеятельностиНДС = Т.КорВидДеятельностиНДС)
	|			И (ИсключитьРасходы.АналитикаФинансовогоУчета = Т.КорАналитикаФинансовогоУчета)
	|			И (Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогКоличество КАК ИтогКоличество
	|		ПО (ИтогКоличество.Регистратор = Т.Регистратор)
	|			И (ИтогКоличество.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры)
	|			И (ИтогКоличество.Организация = Т.Организация)
	|			И (ИтогКоличество.Партия = Т.Партия)
	|			И (ИтогКоличество.РазделУчета = Т.РазделУчета)
	|			И (ИтогКоличество.ВидЗапасов = Т.ВидЗапасов)
	|			И (ИтогКоличество.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (ИтогКоличество.ВидДеятельностиНДС = Т.ВидДеятельностиНДС)
	|			И (ИтогКоличество.АналитикаФинансовогоУчета = Т.АналитикаФинансовогоУчета)
	|			И (ИтогКоличество.ВидДвижения = Т.ВидДвижения)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Передача.Ссылка = Т.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПередачиБезНДС КАК ПередачаВидыЗапасов
	|		ПО ПередачаВидыЗапасов.Ссылка = Т.Регистратор
	|			И ПередачаВидыЗапасов.Номенклатура = Т.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ПередачаВидыЗапасов.Характеристика = Т.АналитикаУчетаНоменклатуры.Характеристика
	|			И ПередачаВидыЗапасов.Серия = Т.АналитикаУчетаНоменклатуры.Серия
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК Возврат
	|		ПО Возврат.Ссылка = Т.Регистратор
	|
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
	|	И НЕ (Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости)
	|		И ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИП(Документ.РаспределениеПрочихЗатрат))
	|	И НЕ Т.РазделУчета В (&РазделыУчетаЗабалансовые)
	|	И (Т.Количество <> 0
	|		ИЛИ Т.СтоимостьБезНДС <> 0
	|		ИЛИ Т.СтоимостьЗабалансовая <> 0
	|		ИЛИ Т.ДопРасходы <> 0
	|		ИЛИ Т.ДопРасходыБезНДС <> 0
	|		ИЛИ Т.СтоимостьРегл <> 0
	|		ИЛИ Т.СтоимостьЗабалансоваяРегл <> 0
	|		ИЛИ Т.ДопРасходыРегл <> 0
	|		ИЛИ Т.СтоимостьУпр <> 0
	|		ИЛИ Т.ДопРасходыУпр <> 0)
	|	И НЕ (Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И ИсключитьПриходы.Регистратор ЕСТЬ НЕ NULL)
	|	И НЕ (Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ИсключитьРасходы.Регистратор ЕСТЬ НЕ NULL)
	|	И Т.Активность
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	АналитикаУчетаПартий,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.МоментВремени,
	|	Т.Период КАК Период,
	|	Т.ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация КАК Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|   Т.ХозяйственнаяОперация,
	|   Т.КорАналитикаУчетаНоменклатуры,
	|   Т.КорРазделУчета,
	|   Т.КорВидЗапасов,
	|   Т.КорОрганизация,
	|   Т.КорСтоимость,
	|   Т.АналитикаУчетаПоПартнерам,
	|   Т.ЗаказКлиента,
	|   Т.Подразделение,
	|   ВЫБОР КОГДА Цены.СтатьяРасходов ЕСТЬ НЕ NULL И Цены.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Цены.СтатьяРасходов
	|		ИНАЧЕ Т.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|   ВЫБОР КОГДА Цены.СтатьяРасходов ЕСТЬ НЕ NULL И Цены.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Цены.АналитикаРасходов
	|		ИНАЧЕ Т.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаРасходов,
	|   Т.СтатьяДоходов,
	|   Т.АналитикаДоходов,
	|   Т.ПериодПродажи,
	|   Т.СтатьяАктивовПассивов,
	|   Т.АналитикаАктивовПассивов,
	|   Т.ДокументДвижения,
	|   Т.ИдентификаторСтроки,
	|   Т.ГруппаПродукции,
	|   Т.РасчетПартий,
	|   Т.РасчетСебестоимости,
	|   Т.КорПартия,
	|   Т.КорАналитикаУчетаПартий,
	|   Т.КорАналитикаФинансовогоУчета,
	|   Т.КорВидДеятельностиНДС,
	|   Т.ТипЗаписи,
	|   Т.ДокументИсточник,
	|   Т.КодСтроки,
	|   Т.РасчетНеЗавершен,
	|   Т.НастройкаХозяйственнойОперации,
	|   Т.ИдентификаторФинЗаписи,
	|   Т.Сторно,
	|	Т.ВозможноСписаниеНДС,
	|
	|	Т.Номенклатура,
	|	Т.НаправлениеДеятельности,
	|	ЕСТЬNULL(Т.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЕСТЬNULL(Т.КорНаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) КАК КорНаправлениеДеятельности,
	|   Т.КорГруппаПродукции,
	|
	|	Цены.ДокументПоступления КАК ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	Т.ЗнакКоличество * Т.Количество 	КАК Количество,
	|	ВЫБОР
	|		КОГДА Т.Количество <> 0
	|			ТОГДА Т.Количество
	|		КОГДА НЕ РаспределениеЗатрат.Регистратор ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА Цены.СтоимостьБезНДС <> 0
	|					ТОГДА РаспределениеЗатрат.СтоимостьРегл / Цены.СтоимостьБезНДС
	|				КОГДА Цены.НДС <> 0
	|					ТОГДА РаспределениеЗатрат.НДСРегл / Цены.НДС
	|				КОГДА Цены.НДСУпр <> 0
	|					ТОГДА РаспределениеЗатрат.НДСУпр / Цены.НДСУпр
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОГДА Т.Партия = Цены.ДокументПоступления
	|		  И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартийДокументаПоступления
	|		  И Т.КоличествоИтог ЕСТЬ НЕ NULL
	|			ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(Т.КоличествоПартии, 1)
	|	КОНЕЦ * Т.ЗнакКоличество 			КАК Коэффициент,
	|	Цены.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
	|	Цены.НДС 							КАК НДС,
	|	Цены.СтоимостьБезНДСУпр 			КАК СтоимостьБезНДСУпр,
	|	Цены.НДСУпр 						КАК НДСУпр
	|ПОМЕСТИТЬ ВТСтоимостьПартийНДСПредварительная
	|ИЗ
	|	ВТДвиженияСебестоимостиДляПартийНДС КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПартийНДС КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеЗатрат КАК РаспределениеЗатрат
	|		ПО РаспределениеЗатрат.Регистратор = Т.Регистратор
	|		И РаспределениеЗатрат.ДокументПоступленияРасходов = Цены.ДокументПоступления
	|		И РаспределениеЗатрат.АналитикаУчетаПартий = Цены.АналитикаУчетаПартийДокументаПоступления
	|ГДЕ
	|   НЕ (Т.Регистратор = Т.Партия
	|		И Т.Регистратор <> Цены.ДокументПоступления
	|		И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (
	|			ТИП(Документ.РеализацияТоваровУслуг),
	|			ТИП(Документ.СборкаТоваров),
	|			ТИП(Документ.ПередачаТоваровМеждуОрганизациями),
	|			ТИП(Документ.ВозвратТоваровМеждуОрганизациями),
	|			ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании)))
	|	И НЕ (Т.Количество = 0
	|		  	И Т.Партия = Цены.ДокументПоступления
	|			И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартийДокументаПоступления
	|			И Т.КоличествоИтог ЕСТЬ НЕ NULL)
	|	И (ТИПЗНАЧЕНИЯ(Т.Регистратор) <> ТИП(Документ.РаспределениеПрочихЗатрат)
	|		ИЛИ НЕ РаспределениеЗатрат.Регистратор ЕСТЬ NULL)
	|	И (НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИП(Документ.ТаможеннаяДекларацияИмпорт)
	|		ИЛИ Т.Регистратор = Цены.ДокументПоступления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.МоментВремени,
	|	Т.Период КАК Период,
	|	Т.ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   Т.РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация КАК Организация,
	|   Т.АналитикаУчетаПартий,
	|   Т.АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|   Т.ХозяйственнаяОперация,
	|   Т.КорАналитикаУчетаНоменклатуры,
	|   Т.КорРазделУчета,
	|   Т.КорВидЗапасов,
	|   Т.КорОрганизация,
	|   Т.КорСтоимость,
	|   Т.АналитикаУчетаПоПартнерам,
	|   Т.ЗаказКлиента,
	|   Т.Подразделение,
	|   ВЫБОР КОГДА Цены.СтатьяРасходов ЕСТЬ НЕ NULL И Цены.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Цены.СтатьяРасходов
	|		ИНАЧЕ Т.СтатьяРасходовСписания
	|	КОНЕЦ КАК СтатьяРасходовСписания,
	|   ВЫБОР КОГДА Цены.СтатьяРасходов ЕСТЬ НЕ NULL И Цены.СтатьяРасходов <> НЕОПРЕДЕЛЕНО
	|		ТОГДА Цены.АналитикаРасходов
	|		ИНАЧЕ Т.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаРасходов,
	|   Т.СтатьяДоходов,
	|   Т.АналитикаДоходов,
	|   Т.ПериодПродажи,
	|   Т.СтатьяАктивовПассивов,
	|   Т.АналитикаАктивовПассивов,
	|   Т.ДокументДвижения,
	|   Т.ИдентификаторСтроки,
	|   Т.ГруппаПродукции,
	|   Т.РасчетПартий,
	|   Т.РасчетСебестоимости,
	|   Т.КорПартия,
	|   Т.КорАналитикаУчетаПартий,
	|   Т.КорАналитикаФинансовогоУчета,
	|   Т.КорВидДеятельностиНДС,
	|   Т.ТипЗаписи,
	|   Т.ДокументИсточник,
	|   Т.КодСтроки,
	|   Т.РасчетНеЗавершен,
	|   Т.НастройкаХозяйственнойОперации,
	|   Т.ИдентификаторФинЗаписи,
	|   Т.Сторно,
	|	Т.ВозможноСписаниеНДС,
	|
	|	Т.Номенклатура,
	|	Т.НаправлениеДеятельности,
	|	ЕСТЬNULL(Т.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|		ЕСТЬNULL(Т.КорНаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) КАК КорНаправлениеДеятельности,
	|   Т.КорГруппаПродукции,
	|
	|	Цены.ДокументПоступления КАК ДокументПоступления,
	|	Цены.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Цены.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	Т.ЗнакКоличество * Т.Количество 	КАК Количество,
	|	ВЫБОР
	|		КОГДА Т.Количество <> 0
	|			ТОГДА Т.Количество
	|		КОГДА НЕ РаспределениеЗатрат.Регистратор ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|				КОГДА Цены.СтоимостьБезНДС <> 0
	|					ТОГДА РаспределениеЗатрат.СтоимостьРегл / Цены.СтоимостьБезНДС
	|				КОГДА Цены.НДС <> 0
	|					ТОГДА РаспределениеЗатрат.НДСРегл / Цены.НДС
	|				КОГДА Цены.НДСУпр <> 0
	|					ТОГДА РаспределениеЗатрат.НДСУпр / Цены.НДСУпр
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОГДА Т.Партия = Цены.ДокументПоступления
	|		  И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартийДокументаПоступления
	|		  И Т.КоличествоИтог ЕСТЬ НЕ NULL
	|			ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(Т.КоличествоПартии, 1)
	|	КОНЕЦ * Т.ЗнакКоличество 			КАК Коэффициент,
	|	Цены.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
	|	Цены.НДС 							КАК НДС,
	|	Цены.СтоимостьБезНДСУпр 			КАК СтоимостьБезНДСУпр,
	|	Цены.НДСУпр 						КАК НДСУпр
	|ИЗ
	|	ВТДвиженияСебестоимостиДляПартийНДС КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПартийНДСДетально КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры)
	|			И (Цены.РазделУчета = Т.РазделУчета)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидДеятельностиНДС = Т.ВидДеятельностиНДС)
	|			И (Цены.АналитикаФинансовогоУчета = Т.АналитикаФинансовогоУчета)
	|			И (Цены.Период = Т.МесяцДвижения)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеЗатрат КАК РаспределениеЗатрат
	|		ПО РаспределениеЗатрат.Регистратор = Т.Регистратор
	|		И РаспределениеЗатрат.ДокументПоступленияРасходов = Цены.ДокументПоступления
	|		И РаспределениеЗатрат.АналитикаУчетаПартий = Цены.АналитикаУчетаПартийДокументаПоступления
	|ГДЕ
	|   НЕ (Т.Регистратор = Т.Партия
	|		И Т.Регистратор <> Цены.ДокументПоступления
	|		И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (
	|			ТИП(Документ.РеализацияТоваровУслуг),
	|			ТИП(Документ.СборкаТоваров),
	|			ТИП(Документ.ПередачаТоваровМеждуОрганизациями),
	|			ТИП(Документ.ВозвратТоваровМеждуОрганизациями),
	|			ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании)))
	|	И НЕ (Т.Количество = 0
	|		  	И Т.Партия = Цены.ДокументПоступления
	|			И Т.АналитикаУчетаПартий = Цены.АналитикаУчетаПартийДокументаПоступления
	|			И Т.КоличествоИтог ЕСТЬ НЕ NULL)
	|	И (ТИПЗНАЧЕНИЯ(Т.Регистратор) <> ТИП(Документ.РаспределениеПрочихЗатрат)
	|		ИЛИ НЕ РаспределениеЗатрат.Регистратор ЕСТЬ NULL)
	|	И (НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИП(Документ.ТаможеннаяДекларацияИмпорт)
	|		ИЛИ Т.Регистратор = Цены.ДокументПоступления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Период КАК МоментВремени,
	|	Т.Период КАК Период,
	|	ВЫБОР КОГДА ПриходЗатрат
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	Т.ДокументДвижения КАК Регистратор,
	|   Т.Партия,
	|   Т.АналитикаУчетаНоменклатуры,
	|   ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
	|   Т.ВидЗапасов,
	|   Т.Организация КАК Организация,
	|   Т.АналитикаУчетаПартий,
	|   НЕОПРЕДЕЛЕНО КАК АналитикаФинансовогоУчета,
	|   Т.ВидДеятельностиНДС,
	|   НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|   Т.КорАналитикаУчетаНоменклатуры,
	|   ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) КАК КорРазделУчета,
	|   Т.КорВидЗапасов,
	|   ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК КорОрганизация,
	|   0 КАК КорСтоимость,
	|   НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
	|   НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|   Т.Подразделение,
	|   Т.СтатьяРасходов КАК СтатьяРасходовСписания,
	|   Т.АналитикаРасходов,
	|   ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) КАК СтатьяДоходов,
	|   НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|   Т.Период КАК ПериодПродажи,
	|   ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК СтатьяАктивовПассивов,
	|   НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|   НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|   НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|   ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка) КАК ГруппаПродукции,
	|   ЛОЖЬ КАК РасчетПартий,
	|   ЛОЖЬ КАК РасчетСебестоимости,
	|   НЕОПРЕДЕЛЕНО КАК КорПартия,
	|   ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК КорАналитикаУчетаПартий,
	|   НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
	|   Т.КорВидДеятельностиНДС,
	|   ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
	|   НЕОПРЕДЕЛЕНО КАК ДокументИсточник,
	|   0 КАК КодСтроки,
	|   ЛОЖЬ КАК РасчетНеЗавершен,
	|   ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК НастройкаХозяйственнойОперации,
	|   НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
	|   ЛОЖЬ КАК Сторно,
	|	ЛОЖЬ КАК ВозможноСписаниеНДС,
	|
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности,
	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		КАК НаправлениеДеятельности,
	|   Т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|   Т.КорГруппаПродукции КАК КорГруппаПродукции,
	|
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|
	|	1 						КАК Количество,
	|	1 						КАК Коэффициент,
	|	Т.СтоимостьБезНДС		КАК СтоимостьБезНДС,
	|	Т.НДС					КАК НДС,
	|	Т.СтоимостьБезНДСУпр	КАК СтоимостьБезНДСУпр,
	|	Т.НДСУпр				КАК НДСУпр
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтбораПартийНДС КАК ОтборПартийНДС
	|	ПО &УсловияСоединения
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор,
	|	Т.СтатьяРасходовСписания,
	|   Т.АналитикаРасходов,
	|	Т.ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления
	|ПОМЕСТИТЬ ВТДокументыРаспределенияДопРасходов
	|ИЗ
	|	ВТСтоимостьПартийНДСПредварительная КАК Т
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИП(Документ.РаспределениеПрочихЗатрат)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Регистратор,
	|	Т.СтатьяРасходов КАК СтатьяРасходовСписания,
	|   Т.АналитикаРасходов,
	|	Т.ДокументПоступленияРасходов КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартийДокументаПоступления,
	|	МАКСИМУМ(Т.ВидДеятельностиНДС) КАК КорВидДеятельностиНДС
	|ПОМЕСТИТЬ ВТКорВидыДеятельностиНДС
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтоимостьПартийНДСПредварительная КАК Отбор
	|		ПО Т.Регистратор = Отбор.Регистратор
	|		И Т.ДокументПоступленияРасходов = Отбор.ДокументПоступления
	|		И Т.АналитикаУчетаПартий = Отбор.АналитикаУчетаПартийДокументаПоступления
	|		И Т.СтатьяРасходов = Отбор.СтатьяРасходовСписания
	|		И Т.АналитикаРасходов = Отбор.АналитикаРасходов
	|ГДЕ
	|	Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|СГРУППИРОВАТЬ ПО
	|	Т.Регистратор,
	|	Т.СтатьяРасходов,
	|   Т.АналитикаРасходов,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.ДокументПоступления
	|ПОМЕСТИТЬ ВТДокументыПоступленияНДС
	|ИЗ
	|	ВТСтоимостьПартийНДСПредварительная КАК Т
	|ГДЕ
	|	Т.ВозможноСписаниеНДС
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.ВариантУчетаНДСПриИзмененииВидаДеятельности,
	|	Т.СтатьяРасходовНеНДС,
	|	Т.АналитикаРасходовНеНДС,
	|	Т.СтатьяРасходовЕНВД,
	|	Т.АналитикаРасходовЕНВД
	|ПОМЕСТИТЬ ВТНастройкиСписанияНДС
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&НачалоПериода, Организация В(&МассивОрганизаций)) КАК Т
	|ГДЕ
	|	НЕ Т.ВариантУчетаНДСПриИзмененииВидаДеятельности ЕСТЬ NULL
	|	И Т.ВариантУчетаНДСПриИзмененииВидаДеятельности <> ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимость)
	|	И Т.СтатьяРасходовСписаниеНДС <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	УчетнаяПолитика.СтатьяРасходовНеНДС,
	|	УчетнаяПолитика.АналитикаРасходовНеНДС,
	|	УчетнаяПолитика.СтатьяРасходовЕНВД,
	|	УчетнаяПолитика.АналитикаРасходовЕНВД
	|ПОМЕСТИТЬ ВТДокументыСписанияНДС
	|ИЗ
	|	ВТДокументыПоступленияНДС КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНастройкиСписанияНДС КАК УчетнаяПолитика
	|		ПО Т.Организация = УчетнаяПолитика.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДанныеПервичныхДокументов.Организация = Т.Организация
	|		И ДанныеПервичныхДокументов.Документ = Т.ДокументПоступления
	|ГДЕ
	|	УчетнаяПолитика.ВариантУчетаНДСПриИзмененииВидаДеятельности <> ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДСПриИзмененииВидаДеятельностиНаНеоблагаемую.ВключатьВСтоимостьИлиРасходыВЗависимостиОтПериода)
	|	ИЛИ
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)), МЕСЯЦ) <> &НачалоПериода
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.МоментВремени КАК МоментВремени,
	|	Т.Период КАК Период,
	|	Т.ВидДвижения КАК ВидДвижения,
	|	Т.Регистратор КАК Регистратор,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Т.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Т.КорРазделУчета КАК КорРазделУчета,
	|	Т.КорВидЗапасов КАК КорВидЗапасов,
	|	Т.КорОрганизация КАК КорОрганизация,
	|	Т.КорСтоимость КАК КорСтоимость,
	|	Т.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Т.ЗаказКлиента КАК ЗаказКлиента,
	|	Т.Подразделение КАК Подразделение,
	|	Т.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.СтатьяДоходов КАК СтатьяДоходов,
	|	Т.АналитикаДоходов КАК АналитикаДоходов,
	|	Т.ПериодПродажи КАК ПериодПродажи,
	|	Т.СтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	Т.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	Т.ДокументДвижения КАК ДокументДвижения,
	|	Т.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Т.ГруппаПродукции КАК ГруппаПродукции,
	|	Т.РасчетПартий КАК РасчетПартий,
	|	Т.РасчетСебестоимости КАК РасчетСебестоимости,
	|	Т.КорПартия КАК КорПартия,
	|	Т.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Т.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
	|	ЕСТЬNULL(КорВидыДеятельностиНДС.КорВидДеятельностиНДС, Т.КорВидДеятельностиНДС) КАК КорВидДеятельностиНДС,
	|	Т.ТипЗаписи КАК ТипЗаписи,
	|	Т.ДокументИсточник КАК ДокументИсточник,
	|	Т.КодСтроки КАК КодСтроки,
	|	Т.РасчетНеЗавершен КАК РасчетНеЗавершен,
	|	Т.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	Т.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Т.Сторно КАК Сторно,
	|	Т.Номенклатура КАК Номенклатурв,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|   Т.КорГруппаПродукции КАК КорГруппаПродукции,
	|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ТОГДА ЕСТЬNULL(СписаниеНДС.СтатьяРасходовНеНДС, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(СписаниеНДС.СтатьяРасходовЕНВД, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))
	|	КОНЕЦ КАК СтатьяСписанияНДС,
	|	ВЫБОР КОГДА Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ТОГДА ЕСТЬNULL(СписаниеНДС.АналитикаРасходовНеНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(СписаниеНДС.АналитикаРасходовЕНВД, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК АналитикаСписанияНДС,
	|	ВЫБОР КОГДА Т.ВозможноСписаниеНДС И НЕ СписаниеНДС.Организация ЕСТЬ NULL
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозможноСписаниеНДС,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	Т.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаНоменклатурыДокументаПоступления,
	|	Т.Количество КАК Количество,
	|	ВЫРАЗИТЬ(Т.Коэффициент * Т.СтоимостьБезНДС КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(Т.Коэффициент * Т.НДС КАК ЧИСЛО (31,2)) КАК НДС,
	|	ВЫРАЗИТЬ(Т.Коэффициент * Т.СтоимостьБезНДСУпр КАК ЧИСЛО (31,2)) КАК СтоимостьБезНДСУпр,
	|	ВЫРАЗИТЬ(Т.Коэффициент * Т.НДСУпр КАК ЧИСЛО (31,2)) КАК НДСУпр
	|ПОМЕСТИТЬ ВТСтоимостьПартийНДС
	|ИЗ
	|	ВТСтоимостьПартийНДСПредварительная КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыСписанияНДС КАК СписаниеНДС
	|		ПО СписаниеНДС.Организация = Т.Организация
	|		И СписаниеНДС.ДокументПоступления = Т.ДокументПоступления
	|		И Т.ВозможноСписаниеНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключитьКорректировки КАК ИсключитьКорректировки
	|		ПО Т.ДокументПоступления = ИсключитьКорректировки.ДокументПоступления
	|		И Т.АналитикаУчетаНоменклатурыДокументаПоступления = ИсключитьКорректировки.АналитикаУчетаНоменклатурыДокументаПоступления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКорВидыДеятельностиНДС КАК КорВидыДеятельностиНДС
	|		ПО Т.Регистратор = КорВидыДеятельностиНДС.Регистратор
	|		И Т.ДокументПоступления = КорВидыДеятельностиНДС.ДокументПоступления
	|		И Т.АналитикаУчетаПартийДокументаПоступления = КорВидыДеятельностиНДС.АналитикаУчетаПартийДокументаПоступления
	|		И Т.СтатьяРасходовСписания = КорВидыДеятельностиНДС.СтатьяРасходовСписания
	|		И Т.АналитикаРасходов = КорВидыДеятельностиНДС.АналитикаРасходов
	|ГДЕ
	|	ИсключитьКорректировки.ДокументПоступления ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";
	
	Если ЗначениеЗаполнено(ТекстОрганизация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&МассивОрганизаций", "&" + ТекстОрганизация);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекстНачалоПериода) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&" + ТекстНачалоПериода);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстКонецПериода) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&" + ТекстКонецПериода);
	КонецЕсли;
	
	ПолеОтбораПоРегистратору = "";
	ТаблицаОтбораПоРегистратору = "";
	
	// Условия отбора партий НДС
	Если ЗначениеЗаполнено(СтруктураОтбора) Тогда
		
		ПоляОтбора = "";
		СоединениеПолей = "";
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			
			ТекстТаблицаОтбора =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	&ПоляОтбора
			|ПОМЕСТИТЬ ВТТаблицаОтбораПартийНДС
			|ИЗ
			|	&ТаблицаОтбора КАК Т
			|ИНДЕКСИРОВАТЬ ПО
			|	&ПоляИндексирования
			|;
			|";
			
			ТаблицаПоляИндекса = Новый ТаблицаЗначений;
			ТаблицаПоляИндекса.Колонки.Добавить("Поле");
			ТаблицаПоляИндекса.Колонки.Добавить("Приоритет");
			
			ПоляИндексирования = "";
			
			Для Каждого ОписаниеПолей Из КлючИЗначение.Значение Цикл
				
				Если НРег(ОписаниеПолей.Значение) = НРег("Регистратор") Тогда
					ТаблицаОтбораПоРегистратору = КлючИЗначение.Ключ;
					ПолеОтбораПоРегистратору = ОписаниеПолей.Ключ;
					Продолжить;
				КонецЕсли;
				
				ПоляОтбора = ПоляОтбора + ?(ПоляОтбора = "", "", ",
					|	") + "Т." + ОписаниеПолей.Ключ;
				
				СоединениеПолей = СоединениеПолей + ?(СоединениеПолей = "", "", "
					|	И ") + "ОтборПартийНДС." + ОписаниеПолей.Ключ + " = "
					+ "Т." + ОписаниеПолей.Значение;
				
				НовоеПоле = ТаблицаПоляИндекса.Добавить();
				НовоеПоле.Поле = ОписаниеПолей.Ключ;
				НовоеПоле.Приоритет = ?(НРег(ОписаниеПолей.Значение) = НРег("ДокументПоступления"), 0, 1);
				
			КонецЦикла;
			
			Если ТаблицаПоляИндекса.Количество() = 0 Тогда
				// Пустой отбор или отбор только по регистраторам
				ТекстТаблицаОтбора =
				"ВЫБРАТЬ
				|	ИСТИНА КАК Поле
				|ПОМЕСТИТЬ ВТТаблицаОтбораПартийНДС
				|;
				|";
				СоединениеПолей = "ИСТИНА";
				Прервать;
			КонецЕсли;
			
			ТаблицаПоляИндекса.Сортировать("Приоритет, Поле");
			
			Для Каждого НовоеПоле Из ТаблицаПоляИндекса Цикл
				ПоляИндексирования = ПоляИндексирования + ?(ПоляИндексирования = "", "", ",
					|	") + "Т." + НовоеПоле.Поле;
			КонецЦикла;
			
			ТекстТаблицаОтбора = СтрЗаменить(ТекстТаблицаОтбора, "&ТаблицаОтбора", КлючИЗначение.Ключ);
			ТекстТаблицаОтбора = СтрЗаменить(ТекстТаблицаОтбора, "&ПоляОтбора", ПоляОтбора);
			ТекстТаблицаОтбора = СтрЗаменить(ТекстТаблицаОтбора, "&ПоляИндексирования", ПоляИндексирования);
			
			Прервать; // поддерживается отбор только по одной таблице
			
		КонецЦикла;
			
	Иначе
		
		ТекстТаблицаОтбора =
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле
		|ПОМЕСТИТЬ ВТТаблицаОтбораПартийНДС
		|;
		|";
		СоединениеПолей = "ИСТИНА";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияСоединения", СоединениеПолей);
	ТекстЗапроса = ТекстТаблицаОтбора + ТекстЗапроса;
	
	// Условия отбора регистраторов себестоимости
	Если ЗначениеЗаполнено(ПолеОтбораПоРегистратору) Тогда
		
		ТекстТаблицаОтбора =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ПолеОтбора
		|ПОМЕСТИТЬ ВТТаблицаОтбораРегистраторов
		|ИЗ
		|	&ТаблицаОтбора КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	&ПолеОтбора
		|;
		|";
		
		ТекстТаблицаОтбора = СтрЗаменить(ТекстТаблицаОтбора, "&ТаблицаОтбора", ТаблицаОтбораПоРегистратору);
		ТекстТаблицаОтбора = СтрЗаменить(ТекстТаблицаОтбора, "&ПолеОтбора", "Т." + ПолеОтбораПоРегистратору);
		
		СоединениеПолей = "ОтборРегистраторов." + ПолеОтбораПоРегистратору + " = Т.Регистратор";
		
	Иначе
		
		ТекстТаблицаОтбора =
		"ВЫБРАТЬ
		|	ИСТИНА КАК Регистратор
		|ПОМЕСТИТЬ ВТТаблицаОтбораРегистраторов
		|;
		|";
		СоединениеПолей = "ИСТИНА";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияДляРегистраторов", СоединениеПолей);
	ТекстЗапроса = ТекстТаблицаОтбора + ТекстЗапроса;
	
	Возврат ТекстЗапроса;

КонецФункции

// Устанавливает параметры запроса детализации партий НДС.
// 
// Параметры:
//  Запрос - Запрос - запрос формирования детализации партий НДС.
//
Процедура ИнициализироватьДополнительныеПараметрыЗапросаДетализацииПартийНДС(Запрос) Экспорт
	
	Запрос.УстановитьПараметр("ТипыЗаписейКонвертацииДанных", РасчетСебестоимостиПрикладныеАлгоритмы.ТипыЗаписейКонвертацииДанных());
	
	// Типы налогообложения НДС
	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСНеУчитываетсяВСтоимости",
		УчетНДСУП.ВидыДеятельностиНДСПринимаетсяКВозмещению());
	Запрос.УстановитьПараметр("ТипыНалогообложенияНДСУчитываетсяВСтоимости",
		УчетНДСУП.ВидыДеятельностиНДСУчитываетсяВСтоимости());
	
	// Разделы учета себестоимости для забалансового учета товаров. 
	РазделыУчетаЗабалансовые = Новый Массив;
	РазделыУчетаЗабалансовые.Добавить(Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию);
	РазделыУчетаЗабалансовые.Добавить(Перечисления.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку);
	РазделыУчетаЗабалансовые.Добавить(Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи);
	РазделыУчетаЗабалансовые.Добавить(Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам);
	РазделыУчетаЗабалансовые.Добавить(Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания);
	РазделыУчетаЗабалансовые.Добавить(Перечисления.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение);
	
	Запрос.УстановитьПараметр("РазделыУчетаЗабалансовые", РазделыУчетаЗабалансовые);
	
КонецПроцедуры
	
#КонецОбласти

#Область ПоследовательностиРасчета

// Устанавливает признак необходимости распределению НДС и формирования записей книги покупок/продаж в указанном периоде.
//
Процедура СформироватьЗаданияДляМеханизмовУчетаНДСПартионныйУчет21(РассчитанныйПериод, МассивОрганизаций, ОкончаниеРасчета = Истина) Экспорт
	
	ТекстЗапроса = "";
	ШаблонТекстаЗапроса = "
	|%1
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Организация,
	|	%2
	|	%3
	|	Т.НалогообложениеНДС КАК КорВидДеятельностиНДС
	|ИЗ 
	|	РегистрНакопления.%4 КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Т.Активность
	|	%5
	|";
	
	ПартионныеРегистры = Новый Соответствие;
	ПартионныеРегистры.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, 			"ДокументПоступления");
	ПартионныеРегистры.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, 	"ДокументПоступления");
	ПартионныеРегистры.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, "ДокументПоступления");
	ПартионныеРегистры.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, 		"ДокументПоступления");
	ПартионныеРегистры.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, 				"ДокументПоступления");
	ПартионныеРегистры.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, 				"ДокументПоступленияРасходов");
	
	Для Каждого КлючИЗначение Из ПартионныеРегистры Цикл
		
		ОбслуживаемыйРегистр = КлючИЗначение.Ключ; // ОбъектМетаданныхРегистрНакопления
		ИмяПоляРегистра = КлючИЗначение.Значение; // Строка
		
		ТекстЗапроса = ТекстЗапроса
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонТекстаЗапроса,
				?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ"),
				?(ОкончаниеРасчета, "ЕСТЬNULL(Т.АналитикаУчетаПартий.НалогообложениеНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) КАК ВидДеятельностиНДС,", ""),
				?(ОкончаниеРасчета, "Т." + ИмяПоляРегистра + " КАК СчетФактура,", ""),
				ОбслуживаемыйРегистр.Имя,
				?(ОбслуживаемыйРегистр = Метаданные.РегистрыНакопления.ПартииПрочихРасходов, "И НЕ Т.Регистратор ССЫЛКА Документ.РаспределениеНДС", ""));
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода",     НачалоМесяца(РассчитанныйПериод));
	Запрос.УстановитьПараметр("КонецПериода",      КонецМесяца(РассчитанныйПериод));
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПериода КАК Период,
	|	Т.Организация,
	|	%1
	|	%2
	|	Т.КорВидДеятельностиНДС
	|ПОМЕСТИТЬ ВтИзменениеПартий
	|ИЗ
	|(%3) КАК Т";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Запрос.Текст,
		?(ОкончаниеРасчета, "Т.ВидДеятельностиНДС,", ""),
		?(ОкончаниеРасчета, "Т.СчетФактура,", ""),
		СокрЛП(ТекстЗапроса));
	
	Запрос.Выполнить();
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(Запрос, "ВтИзменениеПартий") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УчетНДСЛокализация.СформироватьЗаданияДляРаспределенияНДС(Запрос.МенеджерВременныхТаблиц);
	
	Если ОкончаниеРасчета Тогда
		УчетНДСЛокализация.СформироватьЗаданияДляФормированияКнигиПокупокПродаж(Запрос.МенеджерВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает данные для формирования записей книги покупок/продаж в указанном периоде.
// Для этого необходимо собрать данные регистров НДС из ИБ до начала записи сформированных при расчете движений.
//
Процедура ПодготовитьДанныеДляФормированияЗаданийДляМеханизмовУчетаНДСПартионныйУчет22(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.ВариантРасчета <> Перечисления.ВариантыРасчетаПартийИСебестоимости.ПартииИСебестоимость Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.ИсходныеЗаданияКРасчетуСебестоимости;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Документ
	|ИЗ
	|	ИсходныеЗадания КАК Т
	|ГДЕ
	|	Т.Документ <> НЕОПРЕДЕЛЕНО";
	
	ТаблицаДокументы = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.УстановитьПараметр("ТаблицаДокументы", ТаблицаДокументы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Документ
	|ПОМЕСТИТЬ ВТДокументыИзЗаданийКРасчетуСебестоимости
	|ИЗ
	|	&ТаблицаДокументы КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.КорВидДеятельностиНДС,
	|	ИСТИНА КАК ДвиженияТекущегоПериода
	|ПОМЕСТИТЬ ВТДвиженияСебестоимостиДляФормированияЗаданий
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.КорВидДеятельностиНДС,
	|	ЛОЖЬ КАК ДвиженияТекущегоПериода
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИзЗаданийКРасчетуСебестоимости КАК Отбор
	|		ПО Т.Регистратор = Отбор.Документ
	|ГДЕ
	|	Т.Период > &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.Организация
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления
	|ПОМЕСТИТЬ ВТДвиженияПартийНДСДляФормированияЗаданий
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваров КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И (Т.СтоимостьБезНДС <> 0 ИЛИ Т.НДС <> 0 ИЛИ Т.НДСУпр <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.РазделУчета,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.ДокументПоступления
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И (Т.СтоимостьБезНДС <> 0 ИЛИ Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.Организация
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Организация,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Т.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ВтСтарыеДанныеДляМеханизмовУчетаНДС
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация КАК Организация,
	|		Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|		Т.ДокументПоступления КАК СчетФактура
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК Т
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Т.Организация В(&МассивОрганизаций)
	|		И (Т.СтоимостьБезНДС <> 0 ИЛИ Т.НДС <> 0 ИЛИ Т.НДСУпр <> 0)
	|		И Т.Активность
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Т.ДокументПоступления
	|	ИЗ
	|		РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Т
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Т.Организация В(&МассивОрганизаций)
	|		И (Т.СтоимостьБезНДС <> 0 ИЛИ Т.НДС <> 0 ИЛИ Т.НДСУпр <> 0)
	|		И Т.Активность
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Цены.ДокументПоступления
	|	ИЗ
	|		ВТДвиженияСебестоимостиДляФормированияЗаданий КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияПартийНДСДляФормированияЗаданий КАК Цены
	|		ПО (Цены.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Партия = Т.Партия)
	|			И (Цены.РазделУчета = Т.РазделУчета)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидДеятельностиНДС = Т.ВидДеятельностиНДС)
	|			И (Цены.АналитикаФинансовогоУчета = Т.АналитикаФинансовогоУчета)
	|			И  Т.ДвиженияТекущегоПериода
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Цены.ДокументПоступления
	|	ИЗ
	|		ВТДвиженияСебестоимостиДляФормированияЗаданий КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияПартийНДСДляФормированияЗаданий КАК Цены
	|		ПО (Цены.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.РазделУчета = Т.РазделУчета)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И  НЕ Т.ДвиженияТекущегоПериода
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Т.ДокументПоступления
	|	ИЗ
	|		РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП КАК Т
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Т.Организация В(&МассивОрганизаций)
	|		И (Т.СтоимостьБезНДС <> 0 ИЛИ Т.НДС <> 0 ИЛИ Т.НДСУпр <> 0)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		ЕСТЬNULL(Т.АналитикаУчетаПартий.НалогообложениеНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)),
	|		Т.НалогообложениеНДС,
	|		Т.ДокументПоступленияРасходов
	|	ИЗ
	|		РегистрНакопления.ПартииПрочихРасходов КАК Т
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Т.Организация В(&МассивОрганизаций)
	|		И НЕ Т.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|		И (Т.СтоимостьРегл <> 0 ИЛИ Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0)
	|		И Т.Активность
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Т.ДокументПоступленияРасходов
	|	ИЗ
	|		РегистрНакопления.ПартииНДСКРаспределению КАК Т
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Т.Организация В(&МассивОрганизаций)
	|		И НЕ Т.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|		И (Т.СтоимостьРегл <> 0 ИЛИ Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0)
	|		И Т.Активность
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Т.ДокументПоступленияРасходов
	|	ИЗ
	|		РегистрНакопления.ПартииНДСКРаспределению КАК Т
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Т.Организация В(&МассивОрганизаций)
	|		И НЕ Т.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|		И (Т.СтоимостьРегл <> 0 ИЛИ Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0)
	|		И Т.Активность
	|	) КАК Т";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета,
		"ВТДокументыИзЗаданийКРасчетуСебестоимости, ВТДвиженияСебестоимостиДляФормированияЗаданий, ВТДвиженияПартийНДСДляФормированияЗаданий");
	
КонецПроцедуры

// Устанавливает признак необходимости распределению НДС и формирования записей книги покупок/продаж в указанном периоде.
//
Процедура СформироватьЗаданияДляМеханизмовУчетаНДСПартионныйУчет22(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.ВариантРасчета <> Перечисления.ВариантыРасчетаПартийИСебестоимости.ПартииИСебестоимость Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыРасчета.ОграниченияВыборки.КоличествоЗаписейВНЗ) Тогда
		// Для отладки - расчет без изменения данных ИБ
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.ВидДеятельностиНДС,
	|	Т.КорВидДеятельностиНДС,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидЗапасов,
	|	ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(Т.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВтСебестоимостьДляФормированияЗаданий
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Организация,
	|	Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПериода КАК Период,
	|	Т.Организация КАК Организация,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Т.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ВтИзменениеПартий
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация КАК Организация,
	|		Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|		Т.ДокументПоступления КАК СчетФактура
	|	ИЗ
	|		ВТКэшДетализацияПартийТоваровДляНДСиУСН КАК Т
	|	ГДЕ
	|		Т.СтоимостьБезНДС <> 0 ИЛИ Т.НДС <> 0 ИЛИ Т.НДСУпр <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Цены.ДокументПоступления
	|	ИЗ
	|		ВтСебестоимостьДляФормированияЗаданий КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшДетализацияСебестоимостиПартииТоваров КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|	ГДЕ
	|		Цены.СтоимостьБезНДСРегл <> 0 ИЛИ Цены.НДСРегл <> 0 ИЛИ Цены.НДСУпр <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Цены.ДокументПоступления
	|	ИЗ
	|		ВтСебестоимостьДляФормированияЗаданий КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.ПериодРегистрации < &НачалоПериода)
	|	ГДЕ
	|		(Цены.СтоимостьБезНДСРегл <> 0 ИЛИ Цены.НДСРегл <> 0 ИЛИ Цены.НДСУпр <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Цены.ДокументПоступления
	|	ИЗ
	|		ВтСебестоимостьДляФормированияЗаданий КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|	ГДЕ
	|		Цены.СтоимостьБезНДСРегл <> 0 ИЛИ Цены.НДСРегл <> 0 ИЛИ Цены.НДСУпр <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Цены.ДокументПоступления
	|	ИЗ
	|		ВтСебестоимостьДляФормированияЗаданий КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Цены
	|		ПО (Цены.Партия = Т.Партия)
	|			И (Цены.Организация = Т.Организация)
	|			И (Цены.Номенклатура = Т.Номенклатура)
	|			И (Цены.Характеристика = Т.Характеристика)
	|			И (Цены.АналитикаУчетаПартий = Т.АналитикаУчетаПартий)
	|			И (Цены.ВидЗапасов = Т.ВидЗапасов)
	|			И (Цены.ПериодРегистрации < &НачалоПериода)
	|	ГДЕ
	|		(Цены.СтоимостьБезНДСРегл <> 0 ИЛИ Цены.НДСРегл <> 0 ИЛИ Цены.НДСУпр <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		ЕСТЬNULL(Т.АналитикаУчетаПартий.НалогообложениеНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)),
	|		Т.НалогообложениеНДС,
	|		Т.ДокументПоступленияРасходов
	|	ИЗ
	|		ВТКэшПартииПрочихРасходов КАК Т
	|	ГДЕ
	|		Т.СтоимостьРегл <> 0 ИЛИ Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением),
	|		Т.ДокументПоступленияРасходов
	|	ИЗ
	|		ВТКэшПартииНДСКРаспределению КАК Т
	|	ГДЕ
	|		Т.СтоимостьРегл <> 0 ИЛИ Т.НДСРегл <> 0 ИЛИ Т.НДСУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Организация,
	|		Т.ВидДеятельностиНДС,
	|		Т.КорВидДеятельностиНДС,
	|		Т.СчетФактура
	|	ИЗ
	|		ВтСтарыеДанныеДляМеханизмовУчетаНДС КАК Т
	|	) КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(Запрос, "ВтИзменениеПартий") > 0 Тогда
		
		УчетНДСЛокализация.СформироватьЗаданияДляРаспределенияНДС(Запрос.МенеджерВременныхТаблиц);
		
		ПараметрыОтраженияВУчете = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыОтраженияВУчете(
			ПараметрыРасчета,
			НСтр("ru = 'Отражение в книге покупок и продаж'", ОбщегоНазначения.КодОсновногоЯзыка()),
			"УчетНДСЛокализация.СформироватьЗаданияДляФормированияКнигиПокупокПродаж",
			"ВтИзменениеПартий",
			Ложь);
			
		РасчетСебестоимостиПрикладныеАлгоритмы.ОтразитьДокументыВУчете(ПараметрыРасчета, ПараметрыОтраженияВУчете);
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(
		ПараметрыРасчета,
		"ВтСебестоимостьДляФормированияЗаданий, ВтСтарыеДанныеДляМеханизмовУчетаНДС, ВтИзменениеПартий");
	
КонецПроцедуры

#КонецОбласти

#Область СостояниеОперацииЗакрытияМесяца

Процедура Использование_РасчетПартийИСебестоимости(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	ПериодРасчета    = ПараметрыРасчета.ПериодРегистрации;
	МассивОрганизаций = ПараметрыОбработчика.ДанныеЭтапа.МассивОрганизаций;
	
	ПериодПересчетаПартийНДС = ПроверкаНеобходимостьПересчетаРегистраПартийНДС(ПараметрыРасчета);
	
	Если ЗначениеЗаполнено(ПериодПересчетаПартийНДС) Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Обнаружены некорректные движения по регистру ""%1"" за период %2.
				|Необходимо выполнить закрытие месяца начиная с данного периода.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4.Синоним,
			РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПериодПересчетаПартийНДС));
		
		ЗакрытиеМесяцаСервер.ДобавитьПоясняющуюИнформациюКЭтапу(
			ПараметрыОбработчика,
			ТекстОшибки,
			,
			,
			Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка);
		
	КонецЕсли;
	
	ОрганизацииСДвижениямиПоСебестоимости = РасчетСебестоимостиПрикладныеАлгоритмы.ОрганизацииСДвижениямиПоСебестоимости(
		ПериодРасчета,
		МассивОрганизаций);
	
	СостояниеКорректировкиНДС = СостояниеКорректировкиНДС(ПериодРасчета, МассивОрганизаций);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если СостояниеКорректировкиНДС = Перечисления.СостоянияОперацийЗакрытияМесяца.НеВыполнено Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
			ПараметрыОбработчика,
			НСтр("ru='Требуется выполнить корректировку налогообложения НДС.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОрганизацииСДвижениямиПоСебестоимости)
 	 И СостояниеКорректировкиНДС = Перечисления.СостоянияОперацийЗакрытияМесяца.НеТребуется Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет движений по регистрам себестоимости и прочих расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текущее состояние корректировки налогообложения НДС.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.СостоянияОперацийЗакрытияМесяца -
//
Функция СостояниеКорректировкиНДС(ПериодРасчета, МассивОрганизаций) Экспорт
	
	НеТребуетсяКорректировкаНДС = Истина;
	ВыполненаКорректировкаНДС	= Истина;
	
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии21(НачалоМесяца(ПериодРасчета))
	 И КонецКвартала(ПериодРасчета) = КонецМесяца(ПериодРасчета) Тогда
		
		НачалоСледНалПериода = КонецМесяца(ПериодРасчета) + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериода", 	   		 НачалоМесяца(ПериодРасчета));
		Запрос.УстановитьПараметр("КонецПериода",  	   		 КонецМесяца(ПериодРасчета));
		Запрос.УстановитьПараметр("МассивОрганизаций", 		 МассивОрганизаций);
		Запрос.УстановитьПараметр("ГраницаКонецПериода", 	 Новый Граница(КонецМесяца(ПериодРасчета), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("НачалоПериодаМинус3Года", ДобавитьМесяц(НачалоСледНалПериода, -36));
		Запрос.УстановитьПараметр("КонецПериодаМинус3Года",  ДобавитьМесяц(КонецКвартала(НачалоСледНалПериода), -36));
		
		// Необходимость корректировки НДС проверяем по наборам аналитик
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Партии.Организация,
		|	Партии.АналитикаУчетаНоменклатуры,
		|	Партии.ДокументПоступления,
		|	Партии.ВидЗапасов,
		|	Партии.АналитикаУчетаПартий,
		|	СУММА(Партии.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(Партии.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТПартии
		|ИЗ
		// Регистры, используемые только в партионном учете версии 2.1
		|	(ВЫБРАТЬ
		|		Остатки.Организация						КАК Организация,
		|		Остатки.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
		|		Остатки.ДокументПоступления				КАК ДокументПоступления,
		|		Остатки.ВидЗапасов						КАК ВидЗапасов,
		|		Остатки.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
		|		Остатки.КоличествоОстаток				КАК КоличествоОстаток,
		|		Остатки.КоличествоОстаток				КАК Количество
		|	ИЗ
		|		РегистрНакопления.ПартииТоваровОрганизаций.Остатки(
		|				&ГраницаКонецПериода,
		|				АналитикаУчетаПартий.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПоФактическомуИспользованию)
		|				И Организация В(&МассивОрганизаций)
		|		) КАК Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|			ПО Остатки.ДокументПоступления = ДанныеПервичныхДокументов.Документ
		|	ГДЕ
		|		ДанныеПервичныхДокументов.ДатаРегистратора МЕЖДУ &НачалоПериодаМинус3Года И &КонецПериодаМинус3Года
		|		И Остатки.КоличествоОстаток > 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Остатки.Организация						КАК Организация,
		|		Остатки.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
		|		Остатки.ДокументПоступления				КАК ДокументПоступления,
		|		Остатки.ВидЗапасов						КАК ВидЗапасов,
		|		Остатки.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
		|		0										КАК КоличествоОстаток,
		|		Остатки.Количество						КАК Количество
		|	ИЗ
		|		РегистрНакопления.ПартииТоваровОрганизаций КАК Остатки
		|	ГДЕ
		|		Остатки.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И Остатки.Организация В(&МассивОрганизаций)
		|		И Остатки.Активность
		|		И Остатки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И Остатки.Регистратор ССЫЛКА Документ.КорректировкаНалогообложенияНДСПартийТоваров
		|		И Остатки.ДокументПоступления.Дата МЕЖДУ &НачалоПериодаМинус3Года И &КонецПериодаМинус3Года
		|	) КАК Партии
		|
		|СГРУППИРОВАТЬ ПО
		|	Партии.Организация,
		|	Партии.АналитикаУчетаНоменклатуры,
		|	Партии.ДокументПоступления,
		|	Партии.ВидЗапасов,
		|	Партии.АналитикаУчетаПартий
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(Партии.КоличествоОстаток) КАК КоличествоОстаток,
		|	МАКСИМУМ(Партии.Количество) КАК Количество
		|ИЗ
		|	ВТПартии КАК Партии";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		НеТребуетсяКорректировкаНДС = (Выборка.Количество = NULL ИЛИ Выборка.Количество <= 0);
		ВыполненаКорректировкаНДС   = НеТребуетсяКорректировкаНДС ИЛИ (Выборка.КоличествоОстаток <> NULL И Выборка.КоличествоОстаток > 0);
		
	КонецЕсли;
	
	Если НеТребуетсяКорректировкаНДС Тогда
		Состояние = Перечисления.СостоянияОперацийЗакрытияМесяца.НеТребуется;
	ИначеЕсли ВыполненаКорректировкаНДС Тогда
		Состояние = Перечисления.СостоянияОперацийЗакрытияМесяца.ВыполненоУспешно;
	Иначе
		Состояние = Перечисления.СостоянияОперацийЗакрытияМесяца.НеВыполнено;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

#КонецОбласти

//-- Локализация

#Область АнализСостоянияСистемы

// Заполняет проверки, выполняемые в рамках расчета партий и себестоимости.
//
// Параметры:
//	ТаблицаПроверок - см. АудитСостоянияСистемы.ТаблицаПроверокСостоянияСистемы
//
Процедура ЗаполнитьПроверкиДляРегистрации(ТаблицаПроверок) Экспорт
	
	// Соответствие остатков в регистрах СебестоимостьТоваров и ДетализацияПартийТоваровДляНДСиУСН.
	// Технологическая проверка для автотестов, см. технологический параметр "ПроверятьСоответствиеСебестоимостиИПартийНДС".
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"СоответствиеРегистровСебестоимостиИПартийНДС",
		Перечисления.ОперацииЗакрытияМесяца.РасчетПартийИСебестоимости,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ПослеРасчета,
		"РасчетСебестоимостиНДС.ПроверкаСоответствияРегистровСебестоимостиИПартийНДС",
		Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка);
	
	ОписаниеПроверки.ВозможноИзменениеВажности = Истина;
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Соответствие остатков в регистрах себестоимости и партий НДС.'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='Остатки по регистру ""Детализация партий товаров для НДС и УСН"" должны соответствовать остаткам по регистру ""Себестоимость товаров"":
			|- остатки по количеству в регистре партий НДС не должны превышать остатки по количеству в регистре себестоимости
			|- не должно быть остатков по суммам регл. (Стоимость без НДС + НДС) в регистре партий НДС при отсутствии остатков по суммам регл. в регистре себестоимости (Стоимость регл + Доп расходы регл)
			|- не должно быть остатков по суммам упр. в регистре партий НДС (НДС упр) при отсутствии остатков по суммам упр. в регистре себестоимости (Стоимость упр + Доп расходы упр)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	// Соответствие остатков в регистрах ПрочиеРасходы и ПартииПрочихРасходов.
	// Технологическая проверка для автотестов, см. технологический параметр "ПроверятьСоответствиеПрочихРасходовИПартийПрочихРасходов".
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"СоответствиеРегистровПрочиеРасходыИПартийПрочихРасходов",
		Перечисления.ОперацииЗакрытияМесяца.РасчетПартийИСебестоимости,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ПослеРасчета,
		"РасчетСебестоимостиНДС.ПроверкаСоответствияРегистровПрочиеРасходыИПартийПрочихРасходов",
		Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка);
	
	ОписаниеПроверки.ВозможноИзменениеВажности = Истина;
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Соответствие остатков в регистрах прочие расходы и партии прочих расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='Остатки по регистру ""Партии прочих расходов"" должны соответствовать остаткам по регистру ""Прочие расходы"":
			|- не должно быть остатков в регистре партий прочих расходов при отсутствии остатков по в регистре прочих расходов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	// Проверка корректности данных в регистрах ДетализацияСебестоимостиПартииТоваров и ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"КорректностьДанныхВРегистрахДетализацияСебестоимостиПартий",
		Перечисления.ОперацииЗакрытияМесяца.РасчетПартийИСебестоимости,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ПослеРасчета,
		"РасчетСебестоимостиНДС.ПроверкаКорректностиДанныхВРегистрахДетализацияСебестоимостиПартий",
		Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка);
	
	ОписаниеПроверки.ВозможноИзменениеВажности = Истина;
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Корректность данных в регистрах детализации себестоимости партий товаров.'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='По одной партии не должно быть записей с разными периодами регистрации.
			|Затраты предыдущих переделов могут быть заполнены только для партий выпуска продукции и работ'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

// Процедура-обработчик проверки состояния системы "СоответствиеРегистровСебестоимостиИПартийНДС".
//
// Параметры:
//	ПараметрыПроверки - см. АудитСостоянияСистемы.ИнициализироватьПараметрыПроверки
//
Процедура ПроверкаСоответствияРегистровСебестоимостиИПартийНДС(ПараметрыПроверки) Экспорт
	
	Если ПараметрыПроверки.ДополнительныеПараметры.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметров = РасчетСебестоимостиПовтИсп.ЗначенияТехнологическихПараметров();
	
	АвтоматическоеТестирование = ЗакрытиеМесяцаСервер.ЗначениеДополнительногоПараметраПроверки(
		ПараметрыПроверки,
		"АвтоматическоеТестирование",
		Ложь);
	
	// Проверка выполняется если явно включены соответствующие технологические параметры.
	Если НЕ ЗначенияПараметров.ПроверятьСоответствиеСебестоимостиИПартийНДС
	 И НЕ ЗначенияПараметров.ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая
	 И НЕ АвтоматическоеТестирование Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	ТекстЗапросаТаблицыДляОтбораАналитикУчетаПартийНДС2_4() + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|" + "
	|
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	Т.Ссылка
	|ПОМЕСТИТЬ ВТСтатьиПроизводственныхЗатрат
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Т
	//++ Локализация
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК Т
	|ГДЕ
	|	(Т.ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		ИЛИ Т.ВариантРаспределенияРасходовРегл В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|	)
	|	И Т.ВариантРаздельногоУчетаНДС <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	//-- Локализация
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Т.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.КоличествоОстаток КАК Количество,
	|	Т.СтоимостьРеглОстаток + Т.ДопРасходыРеглОстаток КАК СтоимостьРегл,
	|	Т.СтоимостьУпрОстаток + Т.ДопРасходыУпрОстаток КАК СтоимостьУпр
	|ПОМЕСТИТЬ ВТСебестоимость
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|		&ГраницаКонецПериода,
	|		Организация В (&МассивОрганизаций)
	|		И &ПартионныйУчетВерсии22
	|		И НЕ РазделУчета В (
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
	|	) КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Организация,
	|	Номенклатура
	|;
	//++ Локализация
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Т.КоличествоОстаток КАК Количество,
	|	Т.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС
	|ПОМЕСТИТЬ ВТПартииНДС
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Остатки(
	|		&ГраницаКонецПериода,
	|		Организация В (&МассивОрганизаций)
	|		И Организация В (&ОрганизацииПоСредней)
	|		И &ПартионныйУчетВерсии22
	|		И &ПроверятьСоответствиеСебестоимостиИПартийНДС
	|		И НЕ РазделУчета В (
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
	|	) КАК Т
	|;
	//-- Локализация
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	МАКСИМУМ(Т.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ ПериодПерехода
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|ГДЕ
	|	Т.ПериодРегистрации <= &НачалоПериода
	|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеПереходНаРегистрДетализацияСебестоимостиТоваров)
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|	И &ПартионныйУчетВерсии22
	|	И &ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Организация,
	|	Т.ДокументПоступления КАК ДокументПоступления
	|ПОМЕСТИТЬ СтарыеДокументыПоступления
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодПерехода КАК Отбор
	|		ПО Т.Организация = Отбор.Организация
	|		И Т.ПериодРегистрации <= Отбор.ПериодРегистрации
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.ДокументПоступления
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодПерехода КАК Отбор
	|		ПО Т.Организация = Отбор.Организация
	|		И Т.Период <= Отбор.ПериодРегистрации
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерРегистра,
	|	Т.Организация КАК Организация,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Остатки.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Остатки.Количество КАК Количество,
	|	ВЫРАЗИТЬ((Т.СтоимостьБезНДСРегл
	|		+ ВЫБОР
	|			КОГДА Остатки.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА Т.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) * Остатки.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ((Т.СтоимостьБезНДСУпр
	|		+ ВЫБОР
	|			КОГДА Остатки.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА Т.НДСУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ) * Остатки.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьУпр
	|ПОМЕСТИТЬ ВТПартииНДС2_4
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимость КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.Номенклатура = Остатки.Номенклатура
	|		И Т.Характеристика = Остатки.Характеристика
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И (Остатки.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			ИЛИ Остатки.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатурыНЗП)
	|ГДЕ
	|	Т.ПериодРегистрации <= &НачалоПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|	И &ПартионныйУчетВерсии22
	|	И &ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК НомерРегистра,
	|	Т.Организация КАК Организация,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Остатки.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Остатки.Количество КАК Количество,
	|	ВЫРАЗИТЬ((Т.СтоимостьБезНДСРегл
	|		+ ВЫБОР
	|			КОГДА Остатки.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА Т.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) * Остатки.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ((Т.СтоимостьБезНДСУпр
	|		+ ВЫБОР
	|			КОГДА Остатки.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА Т.НДСУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ) * Остатки.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьУпр
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимость КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.Номенклатура = Остатки.Номенклатура
	|		И Т.Характеристика = Остатки.Характеристика
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И (Остатки.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			ИЛИ Остатки.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатурыНЗП)
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
	|		ПО Т.СтатьяРасходов = Статьи.Ссылка
	|ГДЕ
	|	Т.ПериодРегистрации <= &НачалоПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|	И Статьи.Ссылка ЕСТЬ NULL
	|	И &ПартионныйУчетВерсии22
	|	И &ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3 КАК НомерРегистра,
	|	Т.Организация КАК Организация,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Остатки.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Остатки.Количество КАК Количество,
	|	ВЫРАЗИТЬ((Т.СтоимостьБезНДСРегл
	|		+ ВЫБОР
	|			КОГДА Остатки.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА Т.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) * Остатки.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ((Т.СтоимостьБезНДСУпр
	|		+ ВЫБОР
	|			КОГДА Остатки.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
	|				ТОГДА Т.НДСУпр
	|			ИНАЧЕ 0
	|		КОНЕЦ) * Остатки.Количество КАК ЧИСЛО (31,2)) КАК СтоимостьУпр
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСебестоимость КАК Остатки
	|		ПО Т.Организация = Остатки.Организация
	|		И Т.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|		И Т.ВидЗапасов = Остатки.ВидЗапасов
	|		И Т.Партия = Остатки.Партия
	|		И Т.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|		И Т.РазделУчета = Остатки.РазделУчета
	|		И Т.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
	|		И Т.ВидДеятельностиНДС = Остатки.ВидДеятельностиНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатьиПроизводственныхЗатрат КАК Статьи
	|		ПО Т.СтатьяРасходов = Статьи.Ссылка
	|ГДЕ
	|	Т.Период = &НачалоПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|	И Статьи.Ссылка ЕСТЬ NULL
	|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|	И &ПартионныйУчетВерсии22
	|	И &ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления,
	|	Организация
	|;
	//++ Локализация
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	СУММА(Т.КоличествоСебестоимость) КАК КоличествоСебестоимость,
	|	СУММА(Т.КоличествоПартииНДС) КАК КоличествоПартииНДС
	|ПОМЕСТИТЬ ВТРасхожденияСебестоимостиИПартийНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Т.РазделУчета КАК РазделУчета,
	|		Т.ВидЗапасов КАК ВидЗапасов,
	|		Т.Организация КАК Организация,
	|		Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		Т.Количество КАК КоличествоСебестоимость,
	|		0 КАК КоличествоПартииНДС
	|	ИЗ
	|		ВТСебестоимость КАК Т
	|	ГДЕ
	|		&ПроверятьСоответствиеСебестоимостиИПартийНДС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.АналитикаУчетаНоменклатуры,
	|		Т.РазделУчета,
	|		Т.ВидЗапасов,
	|		Т.Организация,
	|		Т.АналитикаФинансовогоУчета,
	|		Т.ВидДеятельностиНДС,
	|		0,
	|		Т.Количество
	|	ИЗ
	|		ВТПартииНДС КАК Т
	|	ГДЕ
	|		&ПроверятьСоответствиеСебестоимостиИПартийНДС) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Т.КоличествоСебестоимость) >= 0
	|	И СУММА(Т.КоличествоСебестоимость) < СУММА(Т.КоличествоПартииНДС)
	|;
	//-- Локализация
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаУчетаНоменклатуры,
	|	СУММА(Т.КоличествоСебестоимость) КАК КоличествоСебестоимость,
	|	СУММА(Т.СтоимостьРеглСебестоимость) КАК СтоимостьРеглСебестоимость,
	|	СУММА(Т.СтоимостьУпрСебестоимость) КАК СтоимостьУпрСебестоимость,
	|	СУММА(Т.СтоимостьРеглПартииНДС) КАК СтоимостьРеглПартииНДС,
	|	СУММА(Т.СтоимостьУпрПартииНДС) КАК СтоимостьУпрПартииНДС
	|ПОМЕСТИТЬ ВТРасхожденияСебестоимостиИПартийНДС2_4
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Организация,
	|		Т.Партия,
	|		ЕСТЬNULL(АналитикиУчетаПартий.Ссылка, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)) КАК АналитикаУчетаПартий,
	|		Т.ВидДеятельностиНДС,
	|		Т.АналитикаУчетаНоменклатуры,
	|		Т.Количество КАК КоличествоСебестоимость,
	|		Т.СтоимостьРегл КАК СтоимостьРеглСебестоимость,
	|		Т.СтоимостьУпр КАК СтоимостьУпрСебестоимость,
	|		0 КАК СтоимостьРеглПартииНДС,
	|		0 КАК СтоимостьУпрПартииНДС
	|	ИЗ
	|		ВТСебестоимость КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборАналитикиУчетаПартийНДС2_4 КАК АналитикиУчетаПартий
	|			ПО Т.АналитикаУчетаПартий = АналитикиУчетаПартий.Ссылка
	|	ГДЕ
	|		&ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Организация,
	|		Т.Партия,
	|		Т.АналитикаУчетаПартий,
	|		Т.ВидДеятельностиНДС,
	|		Т.АналитикаУчетаНоменклатуры,
	|		0 КАК КоличествоСебестоимость,
	|		0 КАК СтоимостьРеглСебестоимость,
	|		0 КАК СтоимостьУпрСебестоимость,
	|		Т.СтоимостьРегл КАК СтоимостьРеглПартииНДС,
	|		Т.СтоимостьУпр КАК СтоимостьУпрПартииНДС
	|	ИЗ
	|		ВТПартииНДС2_4 КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтарыеДокументыПоступления КАК Отбор
	|			ПО Т.ДокументПоступления = Отбор.ДокументПоступления
	|			И Т.Организация = Отбор.Организация
	|	ГДЕ
	|		&ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая
	|		И Отбор.ДокументПоступления ЕСТЬ NULL) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС,
	|	Т.АналитикаУчетаНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Т.КоличествоСебестоимость) > 0
	|		И СУММА(Т.СтоимостьРеглСебестоимость) >= 0
	|		И СУММА(Т.СтоимостьРеглСебестоимость) + &ЗначениеПогрешностиСебестоимостьРегл < СУММА(Т.СтоимостьРеглПартииНДС))
	|	ИЛИ
	|	(СУММА(Т.КоличествоСебестоимость) > 0
	|		И СУММА(Т.СтоимостьУпрСебестоимость) >= 0
	|		И СУММА(Т.СтоимостьУпрСебестоимость) + &ЗначениеПогрешностиСебестоимостьУпр < СУММА(Т.СтоимостьУпрПартииНДС))
	|;
	//++ Локализация
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	СУММА(Т.КоличествоСебестоимость) КАК КоличествоСебестоимость,
	|	СУММА(Т.КоличествоПартииНДС) КАК КоличествоПартииНДС,
	|	СУММА(Т.СтоимостьПартииНДС) КАК СтоимостьПартииНДС
	|ПОМЕСТИТЬ ВТСуммовыеОстаткиПартийНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Т.РазделУчета КАК РазделУчета,
	|		Т.ВидЗапасов КАК ВидЗапасов,
	|		Т.Организация КАК Организация,
	|		Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|		Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|		Т.Количество КАК КоличествоСебестоимость,
	|		0 КАК КоличествоПартииНДС,
	|		0 КАК СтоимостьПартииНДС
	|	ИЗ
	|		ВТСебестоимость КАК Т
	|	ГДЕ
	|		&ПроверятьСоответствиеСебестоимостиИПартийНДС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.АналитикаУчетаНоменклатуры,
	|		Т.РазделУчета,
	|		Т.ВидЗапасов,
	|		Т.Организация,
	|		Т.АналитикаФинансовогоУчета,
	|		Т.ВидДеятельностиНДС,
	|		0 КАК КоличествоСебестоимость,
	|		Т.Количество КАК КоличествоПартииНДС,
	|		Т.СтоимостьБезНДС КАК СтоимостьПартииНДС
	|	ИЗ
	|		ВТПартииНДС КАК Т
	|	ГДЕ
	|		&ПроверятьСоответствиеСебестоимостиИПартийНДС) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Т.КоличествоСебестоимость) = 0
	|	И СУММА(Т.КоличествоПартииНДС) = 0
	|	И СУММА(Т.СтоимостьПартииНДС) <> 0
	//-- Локализация
	|";
	
	// Регистрация расхождений по количеству между регистрами себестоимости и партиями НДС 2.4.
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 				НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Партия",						НСтр("ru='Партия'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаУчетаПартий",		НСтр("ru='Аналитика партий'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ВидДеятельностиНДС",			НСтр("ru='Вид деятельности НДС'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаУчетаНоменклатуры",	НСтр("ru = 'Аналитика учета номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтоимостьРеглСебестоимость",	НСтр("ru='Стоимость регл. (себестоимость)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтоимостьУпрСебестоимость",	НСтр("ru='Стоимость упр. (себестоимость)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтоимостьРеглПартииНДС",		НСтр("ru='Стоимость регл. (партии НДС)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтоимостьУпрПартииНДС",		НСтр("ru='Стоимость упр. (партии НДС)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТРасхожденияСебестоимостиИПартийНДС2_4",
		НСтр("ru='Обнаружены расхождения в суммах между регистрами себестоимости и детализации себестоимости партий товаров по организации ""%1"" на конец периода %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартииТоваров.ПолноеИмя());
	
	//++ Локализация
	// Регистрация расхождений по количеству между регистрами себестоимости и партиями НДС 2.2.
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 				НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("РазделУчета",					НСтр("ru='Раздел учета'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаУчетаНоменклатуры",	НСтр("ru='Аналитика номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ВидЗапасов",					НСтр("ru='Вид запасов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаФинансовогоУчета",	НСтр("ru='Аналитика финансового учета'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ВидДеятельностиНДС",			НСтр("ru='Вид деятельности НДС'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("КоличествоСебестоимость",		НСтр("ru='Количество (себестоимость)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("КоличествоПартииНДС",			НСтр("ru='Количество (партии НДС)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ЗакрытиеМесяцаСервер.ДополнитьПараметрыРегистрацииПроблемПроверки(ПараметрыРегистрации,
		"ВТРасхожденияСебестоимостиИПартийНДС",
		НСтр("ru='Обнаружены расхождения по количеству между регистрами себестоимости и партий НДС (средняя за месяц) по организации ""%1"" на конец периода %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН.ПолноеИмя());
		
	// Регистрация наличия суммовых остатков в регистре "Детализация партий товаров для НДС и УСН (средняя за месяц)".
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 				НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("РазделУчета",					НСтр("ru='Раздел учета'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаУчетаНоменклатуры",	НСтр("ru='Аналитика номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ВидЗапасов",					НСтр("ru='Вид запасов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаФинансовогоУчета",	НСтр("ru='Аналитика финансового учета'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ВидДеятельностиНДС",			НСтр("ru='Вид деятельности НДС'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтоимостьПартииНДС",			НСтр("ru='Стоимость без НДС'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ЗакрытиеМесяцаСервер.ДополнитьПараметрыРегистрацииПроблемПроверки(ПараметрыРегистрации,
		"ВТСуммовыеОстаткиПартийНДС",
		НСтр("ru='Обнаружены суммовые остатки без количества в регистре ""Детализация партий товаров для НДС и УСН (средняя за месяц)"" по организации ""%1"" на конец периода %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН.ПолноеИмя());
	//-- Локализация
		
	// Регистрация проблем.
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТипыНалогообложенияНДСУчитываетсяВСтоимости", УчетНДСУП.ВидыДеятельностиНДСУчитываетсяВСтоимости());
	ДопПараметры.Вставить("ЗначениеПогрешностиСебестоимостьРегл", 		 ЗначенияПараметров.ЗначениеПогрешностиСебестоимостьРегл);
	ДопПараметры.Вставить("ЗначениеПогрешностиСебестоимостьУпр", 		 ЗначенияПараметров.ЗначениеПогрешностиСебестоимостьУпр);
	ДопПараметры.Вставить("ПроверятьСоответствиеСебестоимостиИПартийНДС", ЗначенияПараметров.ПроверятьСоответствиеСебестоимостиИПартийНДС);
	Если АвтоматическоеТестирование Тогда
		ДопПараметры.Вставить("ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая", Истина);
	Иначе
		ДопПараметры.Вставить("ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая", ЗначенияПараметров.ПроверятьСоответствиеСебестоимостиИПартийНДСФИФОСкользящая);
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
		ПараметрыПроверки,
		ПараметрыРегистрации,
		ТекстЗапроса,
		ДопПараметры);
	
КонецПроцедуры

// Процедура-обработчик проверки состояния системы.
//
// Параметры:
//	ПараметрыПроверки - см. АудитСостоянияСистемы.ИнициализироватьПараметрыПроверки
// 
Процедура ПроверкаКорректностиДанныхВРегистрахДетализацияСебестоимостиПартий(ПараметрыПроверки) Экспорт
	
	Если ПараметрыПроверки.ДополнительныеПараметры.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.Организация,
	|	ДД.ВидЗапасов,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.ЗатратыПредыдущихПеределов,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаПартийДокументаПоступления,
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ДД.АналитикаУчетаНоменклатурыНЗП,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДД.ПериодРегистрации) КАК РазличныеПериоды
	|ПОМЕСТИТЬ РазныеПериодыРегистрации
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК ДД
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеПереходНаРегистрДетализацияСебестоимостиТоваров)
	|СГРУППИРОВАТЬ ПО
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.Организация,
	|	ДД.ВидЗапасов,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.ЗатратыПредыдущихПеределов,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаПартийДокументаПоступления,
	|	ДД.АналитикаУчетаНоменклатурыДокументаПоступления,
	|	ДД.АналитикаУчетаНоменклатурыНЗП
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДД.ПериодРегистрации) > 1
	|	И МАКСИМУМ(ДД.ПериодРегистрации) <= &КонецПериода
	|;
	|ВЫБРАТЬ
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.Организация,
	|	ДД.ВидЗапасов,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.ЗатратыПредыдущихПеределов,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаПартийДокументаПоступления,
	|	ДД.АналитикаУчетаНоменклатурыНЗП,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДД.ПериодРегистрации) КАК РазличныеПериоды
	|ПОМЕСТИТЬ РазныеПериодыРегистрацииПостатейныеЗатраты
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК ДД
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|СГРУППИРОВАТЬ ПО
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.Организация,
	|	ДД.ВидЗапасов,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.ЗатратыПредыдущихПеределов,
	|	ДД.ДокументПоступления,
	|	ДД.АналитикаУчетаПартийДокументаПоступления,
	|	ДД.АналитикаУчетаНоменклатурыНЗП,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДД.ПериодРегистрации) > 1
	|	И МАКСИМУМ(ДД.ПериодРегистрации) <= &КонецПериода
	|";
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 				НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Партия",						НСтр("ru='Партия'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаУчетаПартий",		НСтр("ru='Аналитика учета партий'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ВидЗапасов",					НСтр("ru='Вид запасов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Номенклатура",				НСтр("ru='Номенклатура'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Характеристика",				НСтр("ru='Характеристика'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ДокументПоступления",			НСтр("ru = 'Документ поступления'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаУчетаПартийДокументаПоступления", НСтр("ru = 'Аналитика документа поступления'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"РазныеПериодыРегистрации",
		НСтр("ru='Обнаружены записи с разными периодами регистрации для одной партии по организации ""%1"" в периоде %2'", 
		ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартииТоваров.ПолноеИмя());
		
	ЗакрытиеМесяцаСервер.ДополнитьПараметрыРегистрацииПроблемПроверки(ПараметрыРегистрации,
		"РазныеПериодыРегистрацииПостатейныеЗатраты",
		НСтр("ru='Обнаружены записи с разными периодами регистрации для одной партии постатейных затрат по организации ""%1"" в периоде %2'", 
		ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты.ПолноеИмя());
		
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
		ПараметрыПроверки,
		ПараметрыРегистрации,
		ТекстЗапроса);
	
КонецПроцедуры

// Процедура-обработчик проверки состояния системы "СоответствиеРегистровПрочиеРасходыИПартийПрочихРасходов".
//
// Параметры:
//	ПараметрыПроверки - Структура - параметры проверки, см. АудитСостоянияСистемы.ИнициализироватьПараметрыПроверки().
//
Процедура ПроверкаСоответствияРегистровПрочиеРасходыИПартийПрочихРасходов(ПараметрыПроверки) Экспорт
	
	Если ПараметрыПроверки.ДополнительныеПараметры.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметров = РасчетСебестоимостиПовтИсп.ЗначенияТехнологическихПараметров();
	
	// Проверка выполняется если явно включен соответствующий технологический параметр.
	Если НЕ ЗначенияПараметров.ПроверятьСоответствиеПрочихРасходовИПартийПрочихРасходов Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаСоответствияПрочиеРасходыИПартийПрочихРасходов();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("УчитыватьКорректировки", Ложь);
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 			НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение",			НСтр("ru='Подразделение'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("НаправлениеДеятельности",	НСтр("ru='Направление деятельности'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтатьяРасходов",			НСтр("ru='Статья расходов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаРасходов",		НСтр("ru='Аналитика расходов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТОстаткиПартийПрочихРасходов",
		НСтр("ru='Обнаружены остатки в регистре партий прочих расходов по организации ""%1"" на конец периода %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыНакопления.ПартииПрочихРасходов.ПолноеИмя());
		
	// Регистрация проблем.
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
		ПараметрыПроверки,
		ПараметрыРегистрации,
		ТекстЗапроса,
		ДополнительныеПараметры);
	
КонецПроцедуры

// Возвращает текст запроса соответствия прочие расходы и партий прочих расходов.
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаСоответствияПрочиеРасходыИПартийПрочихРасходов() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовРегл В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА Т.СтоимостьРеглОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьРегл,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовРегл В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА Т.НДСРеглОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК НДСРегл,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовУпр В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА Т.НДСУпрОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК НДСУпр
	|ПОМЕСТИТЬ ВТПартииПрочихРасходов
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов.Остатки(
	|		&ГраницаКонецПериода,
	|		Организация В (&МассивОрганизаций)
	|		И &ПартионныйУчетВерсии22
	|		И (СтатьяРасходов.ВариантРаспределенияРасходовУпр В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			 И СтатьяРасходов.ВариантРаздельногоУчетаНДС <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|			ИЛИ СтатьяРасходов.ВариантРаспределенияРасходовРегл В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			 И СтатьяРасходов.ВариантРаздельногоУчетаНДС <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|		)
	|	) КАК Т
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовРегл В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА -Т.СтоимостьРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьРегл,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовРегл В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА -Т.НДСРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК НДСРегл,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовУпр В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА -Т.НДСУпр
	|		ИНАЧЕ 0 КОНЕЦ) КАК НДСУпр
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК Т
	|ГДЕ
	|	Т.Период = ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1)
	|	И Организация В (&МассивОрганизаций)
	|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеКорректировкаОстатковПартийПрочихРасходов)
	|	И &УчитыватьКорректировки
	|	И &ПартионныйУчетВерсии22
	|	И (СтатьяРасходов.ВариантРаспределенияРасходовУпр В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|		 И СтатьяРасходов.ВариантРаздельногоУчетаНДС <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|		ИЛИ СтатьяРасходов.ВариантРаспределенияРасходовРегл В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|		 И СтатьяРасходов.ВариантРаздельногоУчетаНДС <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|		)
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	Подразделение,
	|	Организация,
	|	НаправлениеДеятельности
	|;
	|//////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовРегл В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА Т.СуммаРеглОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	(ВЫБОР 
	|		КОГДА СтатьяРасходов.ВариантРаспределенияРасходовУпр В (
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|			ТОГДА Т.СуммаУпрОстаток
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр
	|
	|ПОМЕСТИТЬ ВТПрочиеРасходы
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|		&ГраницаКонецПериода,
	|		Организация В (&МассивОрганизаций)
	|		И &ПартионныйУчетВерсии22
	|		И (Организация, Подразделение, НаправлениеДеятельности, СтатьяРасходов, АналитикаРасходов) В (
	|			ВЫБРАТЬ
	|				Организация,
	|				Подразделение,
	|				НаправлениеДеятельности,
	|				СтатьяРасходов,
	|				АналитикаРасходов
	|			ИЗ
	|				ВТПартииПрочихРасходов)
	|	) КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	Подразделение,
	|	Организация,
	|	НаправлениеДеятельности
	|;
	|//////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС,
	|	Т.СтоимостьРегл,
	|	Т.НДСРегл,
	|	Т.НДСУпр
	|ПОМЕСТИТЬ ВТОстаткиПартийПрочихРасходовДетальные
	|ИЗ
	|	ВТПартииПрочихРасходов КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПрочиеРасходы КАК Отбор
	|		ПО Т.СтатьяРасходов = Отбор.СтатьяРасходов
	|		 И Т.АналитикаРасходов = Отбор.АналитикаРасходов
	|		 И Т.Подразделение = Отбор.Подразделение
	|		 И Т.Организация = Отбор.Организация
	|		 И Т.НаправлениеДеятельности = Отбор.НаправлениеДеятельности
	|ГДЕ
	|	(Т.СтоимостьРегл <> 0 ИЛИ Т.НДСРегл <> 0) И ЕСТЬNULL(Отбор.СуммаРегл, 0) = 0
	|	ИЛИ Т.НДСУпр <> 0 И ЕСТЬNULL(Отбор.СуммаУпр, 0) = 0
	|;
	|//////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Подразделение КАК Подразделение,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.СтатьяРасходов КАК СтатьяРасходов,
	|	Т.АналитикаРасходов КАК АналитикаРасходов,
	|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.НДСРегл) КАК НДСРегл,
	|	СУММА(Т.НДСУпр) КАК НДСУпр
	|
	|ПОМЕСТИТЬ ВТОстаткиПартийПрочихРасходов
	|ИЗ
	|	ВТОстаткиПартийПрочихРасходовДетальные КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.НаправлениеДеятельности,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//++ Локализация

// Проверка необходимости пересчета себестоимости из-за незаполненного измерения АналитикаУчетаПартий регистра ДетализацияПартийТоваровДляНДСиУСН2_4.
// Вызывается в процедуре определения состояния этапа расчета партий и себестоимости.
//
// Возвращаемое значение:
//	Дата, Неопределено -
//
Функция ПроверкаНеобходимостьПересчетаРегистраПартийНДС(ПараметрыРасчета) Экспорт
	
	Если НЕ РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоМесяца(ПараметрыРасчета.ПериодРегистрации)) Тогда
		Возврат Неопределено; // проверка нужна только при ПУ22
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("КонецПериода", 				  КонецМесяца(ПараметрыРасчета.ПериодРегистрации));
	Запрос.УстановитьПараметр("МассивОрганизаций",  		  ПараметрыРасчета.МассивОрганизаций);
	Запрос.УстановитьПараметр("ТипыЗаписейКонвертацииДанных", РасчетСебестоимостиПрикладныеАлгоритмы.ТипыЗаписейКонвертацииДанных());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА Т.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|				ТОГДА ДОБАВИТЬКДАТЕ(Т.Период, МЕСЯЦ, 1)
	|			ИНАЧЕ Т.Период
	|		КОНЕЦ) КАК Период
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Т
	|ГДЕ
	|	Т.Организация В(&МассивОрганизаций)
	|	И Т.ДокументПоступления = Т.Партия
	|	И Т.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|	И Т.АналитикаУчетаДокументаПоступления <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|	И НЕ Т.АналитикаУчетаДокументаПоступления.Контрагент В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|	И ВЫБОР
	|			КОГДА Т.ТипЗаписи В (&ТипыЗаписейКонвертацииДанных)
	|				ТОГДА ДОБАВИТЬКДАТЕ(Т.Период, МЕСЯЦ, 1)
	|			ИНАЧЕ Т.Период
	|		КОНЕЦ <= &КонецПериода
	|	И Т.Активность";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Период) Тогда
		Возврат Выборка.Период;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//-- Локализация

#КонецОбласти

#Область Тестирование

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСРаспределениемПартий(СписокЭтапов) Экспорт
	
	СписокЭтапов.Добавить("РаспределениеПартийНДСФИФОСкользящая");
	СписокЭтапов.Добавить("РаспределениеПартийНДСФИФОСкользящаяПоДопРасходам");
	//++ Локализация
	СписокЭтапов.Добавить("ПодготовкаДанныхДляУчетаНДСиУСН");
	//-- Локализация
	
КонецПроцедуры

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСТрансляциейПартий(СписокЭтапов) Экспорт
	
	//++ Локализация
	СписокЭтапов.Добавить("ПодготовкаДанныхДляВключенияИсключенияНДСДопРасходовВСтоимость24");
	СписокЭтапов.Добавить("ПодготовкаДанныхДляПартийПрочихРасходов");
	СписокЭтапов.Добавить("ПодготовкаДанныхДляПрочихРасходов");
	СписокЭтапов.Добавить("ПодготовкаДанныхДляПартийНДСКРаспределению");
	СписокЭтапов.Добавить("РаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов");
	//-- Локализация
	
КонецПроцедуры

Процедура ТекстЗапросаДляРасчетаЭтапа(ИмяЭтапа, ПараметрыРасчета, ТекстЗапроса) Экспорт
	
	Если ИмяЭтапа = "ПодготовкаДанныхДляПартийПрочихРасходов" Тогда
		ТекстЗапроса = ТекстЗапросаДляПартийПрочихРасходов(ПараметрыРасчета);
		
	ИначеЕсли ИмяЭтапа = "РаспределениеПартийНДСФИФОСкользящаяПоДопРасходам" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределениеПартийНДСФИФОСкользящаяПоДопРасходам(ПараметрыРасчета);
		
	//++ Локализация
	ИначеЕсли ИмяЭтапа = "ПодготовкаДанныхДляВключенияИсключенияНДСДопРасходовВСтоимость24" Тогда
		ТекстЗапроса = ТекстЗапросаДляВключенияИсключенияНДСДопРасходов(ПараметрыРасчета);
		
	ИначеЕсли ИмяЭтапа = "ПодготовкаДанныхДляПрочихРасходов" Тогда
		ТекстЗапроса = ТекстЗапросаДляПрочихРасходов(ПараметрыРасчета);
	
	ИначеЕсли ИмяЭтапа = "ПодготовкаДанныхДляУчетаНДСиУСН" Тогда
		ТекстЗапроса = ТекстЗапросаДляПартийНДС(ПараметрыРасчета);
	
	ИначеЕсли ИмяЭтапа = "РаспределениеПартийНДСФИФОСкользящаяПоПартиямПрочихРасходов" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределениеПартийНДСФИФОСкользящая(ПараметрыРасчета);
		
	ИначеЕсли ИмяЭтапа = "ПодготовкаДанныхДляПартийНДСКРаспределению" Тогда
		ТекстЗапроса =  ТекстЗапросаДляПартийНДСКРаспределению(ПараметрыРасчета);
	//-- Локализация
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
