////////////////////////////////////////////////////
//// Модуль набора записей регистра сведений "КР_РеестрДокументовКОтражениюПродажИнтернетМагазина"
//// Создан: 25.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-725   
//// Разработка по ФДР С71.003 Интеграция УТ10 Торговля - УТ11. Цены и ОРП


#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСостояние(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьСостояниеЗавершение", ЭтотОбъект); 
	ПоказатьВводЗначения(ОписаниеОповещения, , 
		НСтр("ru = 'Выберите новое состояние'"), Тип("ПеречислениеСсылка.КР_СостоянияОтраженияПродажИнтернетМагазина"));
	
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьСостояниеЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, Результат);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ИзменитьСостояниеНаСервере(Знач ВыделенныеСтроки, Состояние)
	
	Менеджер = РегистрыСведений.КР_РеестрДокументовКОтражениюПродажИнтернетМагазина;
	Для Каждого СтрокаЗаписи Из ВыделенныеСтроки Цикл 
		
		Запись = Менеджер.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаЗаписи, "Объект,НомерЗаказаИнтернетМагазина,ВидОперации"); 
    	Запись.Прочитать();
		Если Не Запись.Выбран() Тогда   
			Возврат;
		КонецЕсли;	
		Запись.Состояние = Состояние;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
