
////////////////////////////////////////////////////
//// Модуль менеджера справочника "КР_Цвета"
//// Создан: 23.08.2022, Маскаев П.Ю., КРОК, JIRA№ A2105505-324
//// Разработка по ФДР С51.002 Доработка справочника Номенклатура и сопутствующих ему объектов

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
