
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// << 16.12.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-868
	КР_ПриСозданииНаСервереДополнительно(Отказ, СтандартнаяОбработка);
	// >> 16.12.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-868

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область КР_ОбработчикиСобытийФормы

// << 16.12.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-868
&НаСервере
Процедура КР_ПриСозданииНаСервереДополнительно(Отказ, СтандартнаяОбработка)
	
	// << 02.05.2023, Федоров Д.Е., КРОК, Jira№ A2105505-775
	//КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
	//	ЭтотОбъект, "Список.КР_ТоварнаяГруппа", , Элементы.ФорматМагазина);
	// >> 02.05.2023, Федоров Д.Е., КРОК, Jira№ A2105505-775
	
	// << 07.04.2023, Федоров Д.Е., КРОК, Jira№ A2105505-775
	КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект, "Список.КР_ФорматМагазинаАксессуары", 
		Элементы.Список, Элементы.КонтролироватьАссортимент);
	// >> 07.04.2023, Федоров Д.Е., КРОК, Jira№ A2105505-775
	
КонецПроцедуры // >> 16.12.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-868

#КонецОбласти
