#Область СлужебныйПрограммныйИнтерфейс

//++ Локализация

Функция РегистрацииВНалоговыхОрганахВХранилище(ОбъектСсылка, УникальныйИдентификатор) Экспорт
	
	Возврат ОрганизацииЛокализация.РегистрацииВНалоговыхОрганахВХранилище(ОбъектСсылка, УникальныйИдентификатор);
	
КонецФункции

Функция НаименованиеКодаКлассификатора(ИмяКлассификатора, Знач Код) Экспорт

	СоответствиеКодаНаименованию = ОрганизацииЛокализация.СоответствиеКодовКНаименованиюИзМакета(ИмяКлассификатора);
	
	Возврат СоответствиеКодаНаименованию.Получить(Код);

КонецФункции

Функция ИзменитьИНН(СсылкаНаОбъект) Экспорт
	Возврат ОрганизацииЛокализация.ИзменитьИНН(СсылкаНаОбъект);
КонецФункции

Функция ПолучитьФИОФизическогоЛица(ИндивидуальныйПредприниматель) Экспорт
	
	Возврат ФизическиеЛицаУТ.ФамилияИмяОтчество(ИндивидуальныйПредприниматель);
	
КонецФункции

//-- Локализация

#КонецОбласти
