
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ВЫБОР КОГДА ТипЗначения(Владелец) = Тип(Справочник.Проекты)         ИЛИ ТипЗначения(Владелец) = Тип(Справочник.МаркетинговыеМероприятия)
	|	ТОГДА ЧтениеСпискаРазрешено(Владелец)
	|	КОГДА ТипЗначения(Владелец) = Тип(Справочник.Претензии)
	|	ТОГДА ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Претензии).Партнер)
	|	ИНАЧЕ ЧтениеОбъектаРазрешено(Владелец)
	|	КОНЕЦ 
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ВЫБОР КОГДА ТипЗначения(Владелец) = Тип(Справочник.Проекты)         ИЛИ ТипЗначения(Владелец) = Тип(Справочник.МаркетинговыеМероприятия)
	|	ТОГДА ЧтениеСпискаРазрешено(Владелец)
	|	КОГДА ТипЗначения(Владелец) = Тип(Справочник.Претензии)
	|	ТОГДА ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Претензии).Партнер)
	|	ИНАЧЕ ИзменениеОбъектаРазрешено(Владелец)
	|	КОНЕЦ ";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
