///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм расчета себестоимости: подготовка и решение системы линейных уравнений
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Расчет стоимости в части резервов под обесценение.
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РасчетСебестоимости_РезервыПодОбесценениеЗапасов(ПараметрыРасчета) Экспорт
	
	// Формирует временные таблицы:
	// - ВтУзлыКорректировки
	ПодготовкаДанныхДляРешенияСЛУ_РезервыПодОбесценениеЗапасов(ПараметрыРасчета);
	
	
	// Формирует временную таблицу:
	// - ВТСтоимостьПартийТоваров
	СформироватьСтоимостьПартийТоваров_РезервыПодОбесценениеЗапасов(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
			
		// Возврат в механизм расчета партий из расчета себестоимости
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Ложь);
			
		// Восстановим все расчетные кэши остатков и оборотов по всем организациям
		РасчетСебестоимостиПрикладныеАлгоритмы.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
		
	КонецЕсли;
	
КонецПроцедуры

// Расчет стоимости в части стоимости товаров и трудозатрат.
// Рассчитываются ресурсы регистра "Себестоимость товаров":
//	- Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Трудозатраты
//	- СтоимостьРегл, СтоимостьЗабалансоваяРегл, ТрудозатратыРегл
//	- СтоимостьУпр, ТрудозатратыУпр
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РасчетСебестоимости_МатериальныеИТрудозатраты(ПараметрыРасчета) Экспорт
	
	// Формирует временные таблицы:
	// - ВтПеремещенияСписания
	ПодготовкаДанныхДляРешенияСЛУ(ПараметрыРасчета);
	
	Если ПараметрыРасчета.УчетныеПолитики.ФИФОВзвешенная.Количество() > 0 Тогда
		ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета); // корректировка ВтУзлыКорректировки
	КонецЕсли;
	
	// Формирует временную таблицу:
	// - ВтТаблицаРешений_СебестоимостьПредприятия
	РешитьСЛУПлатформой_СебестоимостьПредприятия(ПараметрыРасчета);
	
	// Формирует временную таблицу:
	// - ВтТаблицаРешений_СебестоимостьОрганизаций
	РешитьСЛУПлатформой_СебестоимостьОрганизаций(ПараметрыРасчета);
	
	// Обновляет временную таблицу:
	// - ВТСтоимостьПартийТоваров
	ОбновитьСтоимостьПартийТоваров_МатериальныеИТрудозатраты(ПараметрыРасчета);
	
	СохранитьСЛУ(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
			
		// Возврат в механизм расчета партий из расчета себестоимости
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Ложь);
			
		// Восстановим все расчетные кэши остатков и оборотов по всем организациям
		РасчетСебестоимостиПрикладныеАлгоритмы.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
		
	КонецЕсли;
	
КонецПроцедуры

// Расчет стоимости в части дополнительных расходов по товарам и в части включения/исключения НДС.
// Рассчитываются ресурсы регистра "Себестоимость товаров":
//	- ДопРасходы, ДопРасходыБезНДС
//	- СтоимостьРегл, ДопРасходыРегл
//	- СтоимостьУпр, ДопРасходыУпр
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РасчетСебестоимости_ДополнительныеРасходы(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие
	 И НЕ ПараметрыРасчета.РаспределениеДопРасходовМеждуПартиямиИТоварами Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовкаДанныхДляРешенияСЛУ_ДополнительныеРасходы(ПараметрыРасчета);
	
	// Формирует временную таблицу:
	// - ТаблицаРешений
	РешитьСЛУПлатформой_ДополнительныеРасходы(ПараметрыРасчета);
		
	// Формирует временную таблицу:
	// - ВТСтоимостьПартийТоваров
	ОбновитьСтоимостьПартийТоваров_ДополнительныеРасходы(ПараметрыРасчета);
	ЗарегистрироватьСтоимость_ДополнительныеРасходы(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
		
		// Возврат в механизм расчета партий из расчета себестоимости
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Ложь);
		
		// Восстановим все расчетные кэши остатков и оборотов по всем организациям
		РасчетСебестоимостиПрикладныеАлгоритмы.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
		
	КонецЕсли;
	
КонецПроцедуры

// Расчет стоимости в части дополнительных расходов по товарам и в части включения/исключения НДС.
// Рассчитываются ресурсы регистра "Себестоимость товаров":
//	- ДопРасходы, ДопРасходыБезНДС
//	- СтоимостьРегл, ДопРасходыРегл
//	- СтоимостьУпр, ДопРасходыУпр
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РасчетСебестоимости_ВключениеИсключениеНДС(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	УзлыКорректировкиВключениеИсключениеНДС(ПараметрыРасчета);
	
	// Формирует временную таблицу:
	// - ВтТаблицаРешений_СебестоимостьОрганизаций
	РешитьСЛУПлатформой_ВключениеИсключениеНДСОрганизаций(ПараметрыРасчета);
	
	// Формирует временную таблицу:
	// - ВТСтоимостьПартийТоваров
	ОбновитьСтоимостьПартийТоваров_ВключениеИсключениеНДС(ПараметрыРасчета);
	
	Если ПараметрыРасчета.ЗапущенРасчетПартий Тогда
			
		// Возврат в механизм расчета партий из расчета себестоимости
		РасчетСебестоимостиПрикладныеАлгоритмы.ВыполняетсяМеханизмРасчетаСебестоимости(ПараметрыРасчета, Ложь);
			
		// Восстановим все расчетные кэши остатков и оборотов по всем организациям
		РасчетСебестоимостиПрикладныеАлгоритмы.ОбновитьРасчетныеКэшиРегистров(ПараметрыРасчета);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляРешенияСЛУ

// Этап "ПодготовкаДанныхДляРешенияСЛУ"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляРешенияСЛУ(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляРешенияСЛУ");
	
	// 1. Инициализация структуры данных этапа подготовки данных.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПодготовкуДанныхДляСледующихЭтапов(
		ПараметрыРасчета,
		"ВтПеремещенияСписания");
		
	// 2. Формирование временных таблиц.
	РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьДанныеДляСледующихЭтапов(
		ПараметрыРасчета,
		ТекстЗапросаДляРешенияСЛУ(ПараметрыРасчета));
		
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, "ЕстьВозвратныеОтходы");
	
	// 3. Завершаем этап подготовки данных. 
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьПодготовкуДанныхДляСледующихЭтапов(ПараметрыРасчета);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляРешенияСЛУ(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстВтПеремещенияСписания());
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());	
	Если ПараметрыРасчета <> Неопределено Тогда
		ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... формирования временные таблиц

Функция ТекстВтЕстьВозвратныеОтходы() Экспорт
	Возврат "
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	ДД.Организация КАК Организация,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета
		|ПОМЕСТИТЬ ЕстьВозвратныеОтходы
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Организация
		|";
КонецФункции

Функция ТекстВтУзлыКорректировки_МатериальныеИТрудозатраты() // вт ВтУзлыКорректировки
	Возврат "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.Организация,
		|	Т.Партия
		|ПОМЕСТИТЬ ВТОтборДляОстатковСебестоимости
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|ГДЕ
		// Это условие должно совпадать с условием выбора значений суммовых полей в ВтУзлыКорректировки
		|	Т.Сторно
		|	И Т.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Организация,
		|	Партия
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Остатки.Организация,
		|	Остатки.АналитикаУчетаНоменклатуры,
		|	Остатки.РазделУчета,
		|	Остатки.ВидЗапасов,
		|	Остатки.Партия,
		|	Остатки.АналитикаУчетаПартий,
		|	Остатки.АналитикаФинансовогоУчета,
		|	Остатки.ВидДеятельностиНДС,
		|	Остатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ ВТНачальныеОстаткиСебестоимостиПоКорректировкам
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(&НачалоПериода,
		|		(АналитикаУчетаНоменклатуры, Организация, Партия) В
		|		(ВЫБРАТЬ Отбор.АналитикаУчетаНоменклатуры, Отбор.Организация, Отбор.Партия
		|			ИЗ ВТОтборДляОстатковСебестоимости КАК Отбор)
		|	) КАК Остатки
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Организация,
		|	Партия
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ()                        КАК НомерУзла,
		|	Себестоимость.Организация                КАК Организация,
		|	Себестоимость.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Себестоимость.РазделУчета                КАК РазделУчета,
		|	Себестоимость.ВидЗапасов                 КАК ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание
		|		 И Себестоимость.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ Себестоимость.Партия КОНЕЦ)    КАК Партия,
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|		ИНАЧЕ Себестоимость.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ Себестоимость.АналитикаФинансовогоУчета КОНЕЦ) КАК АналитикаФинансовогоУчета,
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание
		|		 И Себестоимость.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ИНАЧЕ Себестоимость.ВидДеятельностиНДС КОНЕЦ) КАК ВидДеятельностиНДС,
		|
		// Ресурсы для расчета себестоимости товаров предприятия.
		|	СУММА(Себестоимость.Количество)                  КАК Количество,
		|	СУММА(Себестоимость.Стоимость)                   КАК Стоимость,
		|	СУММА(Себестоимость.СтоимостьБезНДС)             КАК СтоимостьБезНДС,
		|	СУММА(Себестоимость.ДопРасходы)                  КАК ДопРасходы,
		|	СУММА(Себестоимость.ДопРасходыБезНДС)            КАК ДопРасходыБезНДС,
		|	СУММА(Себестоимость.СтоимостьЗабалансовая)       КАК СтоимостьЗабалансовая,
		|	СУММА(Себестоимость.Трудозатраты)                КАК Трудозатраты,
		|	СУММА(Себестоимость.ПостатейныеПостоянныеСНДС)   КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(Себестоимость.ПостатейныеПеременныеСНДС)   КАК ПостатейныеПеременныеСНДС,
		|	СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(Себестоимость.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
		// Ресурсы для расчета себестоимости товаров организаций.
		|	СУММА(Себестоимость.СтоимостьРегл)               КАК СтоимостьРегл,
		|	СУММА(Себестоимость.ДопРасходыРегл)              КАК ДопРасходыРегл,
		|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)   КАК СтоимостьЗабалансоваяРегл,
		|	СУММА(Себестоимость.ТрудозатратыРегл)            КАК ТрудозатратыРегл,
		|	СУММА(Себестоимость.ПостатейныеПостоянныеРегл)   КАК ПостатейныеПостоянныеРегл,
		|	СУММА(Себестоимость.ПостатейныеПеременныеРегл)   КАК ПостатейныеПеременныеРегл,
		|	СУММА(Себестоимость.РезервПодОбесценениеРегл)    КАК РезервПодОбесценениеРегл,
		|	СУММА(Себестоимость.СтоимостьУпр)                КАК СтоимостьУпр,
		|	СУММА(Себестоимость.ДопРасходыУпр)               КАК ДопРасходыУпр,
		|	СУММА(Себестоимость.ТрудозатратыУпр)             КАК ТрудозатратыУпр,
		|	СУММА(Себестоимость.ПостатейныеПостоянныеУпр)    КАК ПостатейныеПостоянныеУпр,
		|	СУММА(Себестоимость.ПостатейныеПеременныеУпр)    КАК ПостатейныеПеременныеУпр,
		|	СУММА(Себестоимость.РезервПодОбесценениеУпр)     КАК РезервПодОбесценениеУпр
		|ПОМЕСТИТЬ ВтУзлыКорректировки
		|ИЗ (
		|	ВЫБРАТЬ
		|		Себестоимость.Организация,
		|		Себестоимость.АналитикаУчетаНоменклатуры,
		|		(ВЫБОР
		|			КОГДА Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|			 И Себестоимость.Количество < 0
		|			 И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка) // возвратные отходы учитываем по пустому разделу учета
		|			ИНАЧЕ Себестоимость.РазделУчета КОНЕЦ) КАК РазделУчета,
		|		Себестоимость.ВидЗапасов,
		|		Себестоимость.Партия,
		|		Себестоимость.АналитикаУчетаПартий,
		|		Себестоимость.АналитикаФинансовогоУчета,
		|		Себестоимость.ВидДеятельностиНДС,
		// Количество товаров одно общее для всех видов учета. 
		|		(ВЫБОР
		// Движения с типом записи "Корректировка приобретения" исключаются из начальной стоимости узлов расчета,
		// т.к. по этим записям выполняется расчет отклонений в стоимости в процедуре СкорректироватьСтоимостьСписанияЗапасов().
		|			КОГДА Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.Количество
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|			 И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость)
		|				ТОГДА Себестоимость.Количество
		|			КОГДА НЕ Себестоимость.СлужебноеВидДвиженияПриход
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|				ТОГДА -Себестоимость.Количество
		|		 	КОГДА Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
		|			 И Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
		|			 И Себестоимость.ВидДеятельностиНДС <> Себестоимость.ВидДеятельностиНДСОтгрузки
		|			 И Себестоимость.ВидДеятельностиНДСОтгрузки <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|				ТОГДА -Себестоимость.Количество 
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.Количество
		// Добавляются движения отчета комиссионера на возврат, если продажа была отражена в прошлом периоде.
		// Условия выборки должны соответствовать запросу формирования ВтРеализацииПрошлыхПериодов в общем модуле РасчетСебестоимостиКорректировкаСтоимости
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.Количество
		|			ИНАЧЕ 0 
		|		КОНЕЦ) КАК Количество,
		// Данные о суммах внешних поступлений.
		// Условия формирования суммовых показателей должны соответствовать функции ТекстСебестоимостьНалоговыйУчет().
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.Стоимость
		|					КОНЕЦ
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
		|		 	 И Себестоимость.СлужебноеВидДвиженияПриход
		|		 	 И (Себестоимость.Количество = 0
		|				ИЛИ &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие))
		|		 	 И (НЕ &ПредварительныйРасчет ИЛИ Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия))
		|				ТОГДА Себестоимость.Стоимость
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступление)
		|			 И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.Стоимость
		|			КОГДА НЕ Себестоимость.СлужебноеВидДвиженияПриход
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|				ТОГДА -Себестоимость.Стоимость
		|			КОГДА Себестоимость.Сторно И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.Стоимость
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.Стоимость
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.Стоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Стоимость,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.СтоимостьБезНДС
		|					КОНЕЦ
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
		|		 	 И Себестоимость.СлужебноеВидДвиженияПриход
		|		 	 И (Себестоимость.Количество = 0
		|				ИЛИ &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие))
		|		 	 И (НЕ &ПредварительныйРасчет ИЛИ Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия))
		|				ТОГДА Себестоимость.СтоимостьБезНДС
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступление)
		|			 И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьБезНДС
		|			КОГДА НЕ Себестоимость.СлужебноеВидДвиженияПриход
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|				ТОГДА -Себестоимость.СтоимостьБезНДС
		|			КОГДА Себестоимость.Сторно И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьБезНДС
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.СтоимостьБезНДС
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.СтоимостьБезНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьБезНДС,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ДопРасходы
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ДопРасходы
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ДопРасходы
		|			КОГДА Себестоимость.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|			ТОГДА
		|				-Себестоимость.ДопРасходы
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ДопРасходы
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДопРасходы,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ДопРасходыБезНДС
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ДопРасходыБезНДС
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ДопРасходыБезНДС
		|			КОГДА Себестоимость.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|			ТОГДА
		|				-Себестоимость.ДопРасходыБезНДС
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ДопРасходыБезНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДопРасходыБезНДС,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.СтоимостьЗабалансовая
		|					КОНЕЦ
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступление)
		|			 И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьЗабалансовая
		|			КОГДА Себестоимость.Сторно И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьЗабалансовая
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.СтоимостьЗабалансовая
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.СтоимостьЗабалансовая
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЗабалансовая,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.Трудозатраты
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.Трудозатраты
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.Трудозатраты
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.Трудозатраты
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Трудозатраты,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПостоянныеСНДС
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПостоянныеСНДС
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеСНДС
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПостоянныеСНДС,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПеременныеСНДС
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПеременныеСНДС
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеСНДС
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеСНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПеременныеСНДС,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПостоянныеБезНДС
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПостоянныеБезНДС
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеБезНДС
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеБезНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПостоянныеБезНДС,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПеременныеБезНДС
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПеременныеБезНДС
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеБезНДС
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеБезНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПеременныеБезНДС,
		|
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.СтоимостьРегл
		|					КОНЕЦ
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
		|		 	 И Себестоимость.СлужебноеВидДвиженияПриход
		|		 	 И (Себестоимость.Количество = 0
		|				ИЛИ &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие))
		|		 	 И (НЕ &ПредварительныйРасчет ИЛИ Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия))
		|				ТОГДА Себестоимость.СтоимостьРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступление)
		|			 И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьРегл
		|			КОГДА НЕ Себестоимость.СлужебноеВидДвиженияПриход
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|				ТОГДА -Себестоимость.СтоимостьРегл
		|			КОГДА Себестоимость.Сторно И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьРегл
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.СтоимостьРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.СтоимостьРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ДопРасходыРегл
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ДопРасходыРегл
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ДопРасходыРегл
		|			КОГДА Себестоимость.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|			ТОГДА
		|				-Себестоимость.ДопРасходыРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ДопРасходыРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДопРасходыРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.СтоимостьЗабалансоваяРегл
		|					КОНЕЦ
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступление)
		|			 И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьЗабалансоваяРегл
		|			КОГДА Себестоимость.Сторно И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьЗабалансоваяРегл
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.СтоимостьЗабалансоваяРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.СтоимостьЗабалансоваяРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ТрудозатратыРегл
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ТрудозатратыРегл
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ТрудозатратыРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ТрудозатратыРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ТрудозатратыРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПостоянныеРегл
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПостоянныеРегл
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПостоянныеРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПеременныеРегл
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПеременныеРегл
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПеременныеРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.РезервПодОбесценениеРегл
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.РезервПодОбесценениеРегл
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.РезервПодОбесценениеРегл
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.РезервПодОбесценениеРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РезервПодОбесценениеРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.СтоимостьУпр
		|					КОНЕЦ
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
		|		 	 И Себестоимость.СлужебноеВидДвиженияПриход
		|		 	 И (Себестоимость.Количество = 0
		|				ИЛИ &РежимЗакрытияМесяца = ЗНАЧЕНИЕ(Перечисление.РежимыЗакрытияМесяца.ПредварительноеЗакрытие))
		|		 	 И (НЕ &ПредварительныйРасчет ИЛИ Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия))
		|				ТОГДА Себестоимость.СтоимостьУпр
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступление)
		|			 И Себестоимость.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|			 И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьУпр
		|			КОГДА НЕ Себестоимость.СлужебноеВидДвиженияПриход
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
		|				ТОГДА -Себестоимость.СтоимостьУпр
		|			КОГДА Себестоимость.Сторно И Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.СтоимостьУпр
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.СтоимостьУпр
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.СтоимостьУпр
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СтоимостьУпр,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ДопРасходыУпр
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ДопРасходыУпр
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ДопРасходыУпр
		|			КОГДА Себестоимость.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|			ТОГДА
		|				-Себестоимость.ДопРасходыУпр
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ДопРасходыУпр
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДопРасходыУпр,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ТрудозатратыУпр
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ТрудозатратыУпр
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ТрудозатратыУпр
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ТрудозатратыУпр
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ТрудозатратыУпр,
		|
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПостоянныеУпр
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПостоянныеУпр
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеУпр
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПостоянныеУпр
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПостоянныеУпр,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.ПостатейныеПеременныеУпр
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.ПостатейныеПеременныеУпр
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеУпр
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.ПостатейныеПеременныеУпр
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПостатейныеПеременныеУпр,
		|		(ВЫБОР
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода))
		|				ТОГДА
		|					ВЫБОР КОГДА Остатки.Организация ЕСТЬ NULL
		|					 И ЕСТЬNULL(Реестр.ДатаДокументаИБ, &НачалоПериода) < &НачалоПериода
		|						ТОГДА 0
		|						ИНАЧЕ Себестоимость.РезервПодОбесценениеУпр
		|					КОНЕЦ
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход
		|				ТОГДА Себестоимость.РезервПодОбесценениеУпр
		|			КОГДА Себестоимость.Сторно
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода)
		|				ТОГДА -Себестоимость.РезервПодОбесценениеУпр
		|			КОГДА Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера)
		|			 И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
		|			 И Себестоимость.ДокументИсточник <> НЕОПРЕДЕЛЕНО
		|			 И Реестр.ДатаДокументаИБ < &НачалоПериода
		|				ТОГДА -Себестоимость.РезервПодОбесценениеУпр
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РезервПодОбесценениеУпр
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстаткиСебестоимостиПоКорректировкам КАК Остатки
		|		ПО Себестоимость.АналитикаУчетаНоменклатуры   = Остатки.АналитикаУчетаНоменклатуры
		|			И Себестоимость.Организация               = Остатки.Организация
		|			И Себестоимость.Партия                    = Остатки.Партия
		|			И Себестоимость.РазделУчета               = Остатки.РазделУчета
		|			И Себестоимость.ВидЗапасов                = Остатки.ВидЗапасов
		|			И Себестоимость.АналитикаУчетаПартий      = Остатки.АналитикаУчетаПартий
		|			И Себестоимость.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
		|			И Себестоимость.ВидДеятельностиНДС        = Остатки.ВидДеятельностиНДС
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыДокументовИсточников КАК Реестр
		|		ПО Реестр.Ссылка = Себестоимость.ДокументИсточник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
		|		ПО ЕстьВозвратныеОтходы.Организация = Себестоимость.Организация
		|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
		|			И ЕстьВозвратныеОтходы.ВидЗапасов = Себестоимость.ВидЗапасов
		|			И ЕстьВозвратныеОтходы.РазделУчета = Себестоимость.РазделУчета
		|
		// Уменьшение количества в узле при встречных перемещениях в один и тот же узел.
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		Себестоимость.Организация                   КАК Организация,
		|		Себестоимость.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|		Себестоимость.КорРазделУчета                КАК РазделУчета,
		|		Себестоимость.КорВидЗапасов                 КАК ВидЗапасов,
		|		Себестоимость.КорПартия                     КАК Партия,
		|		Себестоимость.КорАналитикаУчетаПартий       КАК АналитикаУчетаПартий,
		|		Себестоимость.КорАналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
		|		Себестоимость.КорВидДеятельностиНДС         КАК ВидДеятельностиНДС,
		|
		|		-Себестоимость.Количество                   КАК Количество,
		|		0 КАК Стоимость,
		|		0 КАК СтоимостьБезНДС,
		|		0 КАК ДопРасходы,
		|		0 КАК ДопРасходыБезНДС,
		|		0 КАК СтоимостьЗабалансовая,
		|		0 КАК Трудозатраты,
		|		0 КАК ПостатейныеПостоянныеСНДС,
		|		0 КАК ПостатейныеПеременныеСНДС,
		|		0 КАК ПостатейныеПостоянныеБезНДС,
		|		0 КАК ПостатейныеПеременныеБезНДС,
		|		0 КАК СтоимостьРегл,
		|		0 КАК ДопРасходыРегл,
		|		0 КАК СтоимостьЗабалансоваяРегл,
		|		0 КАК ТрудозатратыРегл,
		|		0 КАК ПостатейныеПостоянныеРегл,
		|		0 КАК ПостатейныеПеременныеРегл,
		|		0 КАК РезервПодОбесценениеРегл,
		|		0 КАК СтоимостьУпр,
		|		0 КАК ДопРасходыУпр,
		|		0 КАК ТрудозатратыУпр,
		|		0 КАК ПостатейныеПостоянныеУпр,
		|		0 КАК ПостатейныеПеременныеУпр,
		|		0 КАК РезервПодОбесценениеУпр
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
		|	ГДЕ
		|		 Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
		|		 И Себестоимость.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		 И Себестоимость.КорАналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
		|		 И Себестоимость.КорРазделУчета                = Себестоимость.РазделУчета
		|		 И Себестоимость.КорВидЗапасов                 = Себестоимость.ВидЗапасов
		|		 И Себестоимость.КорПартия                     = Себестоимость.Партия
		|		 И Себестоимость.КорАналитикаУчетаПартий       = Себестоимость.АналитикаУчетаПартий
		|		 И Себестоимость.КорАналитикаФинансовогоУчета  = Себестоимость.АналитикаФинансовогоУчета
		|		 И Себестоимость.КорВидДеятельностиНДС         = Себестоимость.ВидДеятельностиНДС
		|
		// Остатки на начало расчетного периода.
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		Остатки.Организация,
		|		Остатки.АналитикаУчетаНоменклатуры,
		|		Остатки.РазделУчета,
		|		Остатки.ВидЗапасов,
		|		Остатки.Партия,
		|		Остатки.АналитикаУчетаПартий,
		|		Остатки.АналитикаФинансовогоУчета,
		|		Остатки.ВидДеятельностиНДС,
		|
		|		Остатки.КоличествоОстаток                  КАК Количество,
		|		Остатки.СтоимостьОстаток                   КАК Стоимость,
		|		Остатки.СтоимостьБезНДСОстаток             КАК СтоимостьБезНДС,
		|		Остатки.ДопРасходыОстаток                  КАК ДопРасходы,
		|		Остатки.ДопРасходыБезНДСОстаток            КАК ДопРасходыБезНДС,
		|		Остатки.СтоимостьЗабалансоваяОстаток       КАК СтоимостьЗабалансовая,
		|		Остатки.ТрудозатратыОстаток                КАК Трудозатраты,
		|		Остатки.ПостатейныеПостоянныеСНДСОстаток   КАК ПостатейныеПостоянныеСНДС,
		|		Остатки.ПостатейныеПеременныеСНДСОстаток   КАК ПостатейныеПеременныеСНДС,
		|		Остатки.ПостатейныеПостоянныеБезНДСОстаток КАК ПостатейныеПостоянныеБезНДС,
		|		Остатки.ПостатейныеПеременныеБезНДСОстаток КАК ПостатейныеПеременныеБезНДС,
		|		Остатки.СтоимостьРеглОстаток               КАК СтоимостьРегл,
		|		Остатки.ДопРасходыРеглОстаток              КАК ДопРасходыРегл,
		|		Остатки.СтоимостьЗабалансоваяРеглОстаток   КАК СтоимостьЗабалансоваяРегл,
		|		Остатки.ТрудозатратыРеглОстаток            КАК ТрудозатратыРегл,
		|		Остатки.ПостатейныеПостоянныеРеглОстаток   КАК ПостатейныеПостоянныеРегл,
		|		Остатки.ПостатейныеПеременныеРеглОстаток   КАК ПостатейныеПеременныеРегл,
		|		Остатки.РезервПодОбесценениеРеглОстаток    КАК РезервПодОбесценениеРегл,
		|		Остатки.СтоимостьУпрОстаток                КАК СтоимостьУпр,
		|		Остатки.ДопРасходыУпрОстаток               КАК ДопРасходыУпр,
		|		Остатки.ТрудозатратыУпрОстаток             КАК ТрудозатратыУпр,
		|		Остатки.ПостатейныеПостоянныеУпрОстаток    КАК ПостатейныеПостоянныеУпр,
		|		Остатки.ПостатейныеПеременныеУпрОстаток    КАК ПостатейныеПеременныеУпр,
		|		Остатки.РезервПодОбесценениеУпрОстаток     КАК РезервПодОбесценениеУпр
		|	ИЗ
		|		РегистрНакопления.СебестоимостьТоваров.Остатки(
		|			&ГраницаНачалоПериода,
		|			Организация В (&МассивОрганизаций)
		|		) КАК Остатки
		|	) КАК Себестоимость
		|
		|СГРУППИРОВАТЬ ПО
		|	Себестоимость.Организация,
		|	Себестоимость.АналитикаУчетаНоменклатуры,
		|	Себестоимость.РазделУчета,
		|	Себестоимость.ВидЗапасов,
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание
		|		 И Себестоимость.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ Себестоимость.Партия КОНЕЦ), // Партия
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
		|		ИНАЧЕ Себестоимость.АналитикаУчетаПартий КОНЕЦ), // АналитикаУчетаПартий
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ Себестоимость.АналитикаФинансовогоУчета КОНЕЦ), // АналитикаФинансовогоУчета
		|	(ВЫБОР
		|		КОГДА &РегламентноеЗадание
		|		 И Себестоимость.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
		|		ИНАЧЕ Себестоимость.ВидДеятельностиНДС КОНЕЦ) // ВидДеятельностиНДС
		|
		|ИМЕЮЩИЕ
		|	СУММА(Себестоимость.Количество) <> 0
		|	ИЛИ СУММА(Себестоимость.Стоимость) <> 0
		|	ИЛИ СУММА(Себестоимость.СтоимостьБезНДС) <> 0
		|	ИЛИ СУММА(Себестоимость.ДопРасходы) <> 0
		|	ИЛИ СУММА(Себестоимость.ДопРасходыБезНДС) <> 0
		|	ИЛИ СУММА(Себестоимость.СтоимостьЗабалансовая) <> 0
		|	ИЛИ СУММА(Себестоимость.Трудозатраты) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПостоянныеСНДС) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПеременныеСНДС) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПостоянныеБезНДС) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПеременныеБезНДС) <> 0
		|	ИЛИ СУММА(Себестоимость.СтоимостьРегл) <> 0
		|	ИЛИ СУММА(Себестоимость.ДопРасходыРегл) <> 0
		|	ИЛИ СУММА(Себестоимость.СтоимостьЗабалансоваяРегл) <> 0
		|	ИЛИ СУММА(Себестоимость.ТрудозатратыРегл) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПостоянныеРегл) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПеременныеРегл) <> 0
		|	ИЛИ СУММА(Себестоимость.РезервПодОбесценениеРегл) <> 0
		|	ИЛИ СУММА(Себестоимость.СтоимостьУпр) <> 0
		|	ИЛИ СУММА(Себестоимость.ДопРасходыУпр) <> 0
		|	ИЛИ СУММА(Себестоимость.ТрудозатратыУпр) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПостоянныеУпр) <> 0
		|	ИЛИ СУММА(Себестоимость.ПостатейныеПеременныеУпр) <> 0
		|	ИЛИ СУММА(Себестоимость.РезервПодОбесценениеУпр) <> 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	АналитикаУчетаНоменклатуры,
		|	РазделУчета,
		|	ВидЗапасов,
		|	Партия,
		|	АналитикаУчетаПартий,
		|	АналитикаФинансовогоУчета,
		|	ВидДеятельностиНДС
		|";
КонецФункции


Функция ТекстВтПеремещенияСписания() // вт ВтПеремещенияСписания, использует ВтРаботыДляДавальца

	Возврат "
		|ВЫБРАТЬ
		|	Себестоимость.НомерУзлаИсточник            КАК НомерУзлаИсточник,
		|	Себестоимость.НомерУзлаПриемник            КАК НомерУзлаПриемник,
		|	Себестоимость.РеализацияВДругуюОрганизацию КАК РеализацияВДругуюОрганизацию,
		|	СУММА(Себестоимость.Количество)	           КАК ВесДуги,
		|	МАКСИМУМ(Себестоимость.РаботаДляДавальца)  КАК РаботаДляДавальца,
		|	МАКСИМУМ(Себестоимость.ПродукцияДавальца)  КАК ПродукцияДавальца
		|
		|ПОМЕСТИТЬ ВтПеремещенияСписания
		|ИЗ (
		|	ВЫБРАТЬ
		|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (
		|			 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
		|			 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет))
		|				ТОГДА УзлыКорректировкиПриемникРеглУчет.НомерУзла
		|			КОГДА НЕ УзлыКорректировкиПриемникПередачи.НомерУзла ЕСТЬ NULL
		|				ТОГДА УзлыКорректировкиПриемникПередачи.НомерУзла
		|			ИНАЧЕ УзлыКорректировкиПриемник.НомерУзла КОНЕЦ) КАК НомерУзлаПриемник,
		|		(ВЫБОР
		|			КОГДА Себестоимость.ХозяйственнаяОперация В (
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РеализацияВДругуюОрганизацию,
		|		Себестоимость.Количество,
		|		ЛОЖЬ КАК РаботаДляДавальца,
		|		(ВЫБОР
		|			КОГДА (ЛОЖЬ
		|				) ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК ПродукцияДавальца
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
		|		ПО УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
		|			И УзлыКорректировкиИсточник.РазделУчета                 = Себестоимость.РазделУчета
		|			И УзлыКорректировкиИсточник.ВидЗапасов                  = Себестоимость.ВидЗапасов
		|			И УзлыКорректировкиИсточник.Организация                 = Себестоимость.Организация
		|			И (УзлыКорректировкиИсточник.Партия              	    = Себестоимость.Партия
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиИсточник.АналитикаУчетаПартий        = Себестоимость.АналитикаУчетаПартий
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиИсточник.АналитикаФинансовогоУчета   = Себестоимость.АналитикаФинансовогоУчета
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиИсточник.ВидДеятельностиНДС          = Себестоимость.ВидДеятельностиНДС
		|				ИЛИ &РегламентноеЗадание)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
		|		ПО УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры   = Себестоимость.КорАналитикаУчетаНоменклатуры
		|			И УзлыКорректировкиПриемник.РазделУчета               = Себестоимость.КорРазделУчета
		|			И УзлыКорректировкиПриемник.ВидЗапасов                = Себестоимость.КорВидЗапасов
		|			И УзлыКорректировкиПриемник.Организация               = Себестоимость.Организация
		|			И (УзлыКорректировкиПриемник.Партия                    = Себестоимость.КорПартия
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиПриемник.АналитикаУчетаПартий      = Себестоимость.КорАналитикаУчетаПартий
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиПриемник.АналитикаФинансовогоУчета = Себестоимость.КорАналитикаФинансовогоУчета
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиПриемник.ВидДеятельностиНДС        = Себестоимость.КорВидДеятельностиНДС
		|				ИЛИ &РегламентноеЗадание)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемникПередачи
		|		ПО
		|			УзлыКорректировкиПриемникПередачи.АналитикаУчетаНоменклатуры  = Себестоимость.КорАналитикаУчетаНоменклатуры
		|			И УзлыКорректировкиПриемникПередачи.РазделУчета               = Себестоимость.КорРазделУчета
		|			И УзлыКорректировкиПриемникПередачи.ВидЗапасов                = Себестоимость.КорВидЗапасов
		|			И УзлыКорректировкиПриемникПередачи.Организация               = Себестоимость.КорОрганизация
		|			И (УзлыКорректировкиПриемникПередачи.Партия                   = Себестоимость.КорПартия
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиПриемникПередачи.АналитикаУчетаПартий     = Себестоимость.КорАналитикаУчетаПартий
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиПриемникПередачи.АналитикаФинансовогоУчета = Себестоимость.КорАналитикаФинансовогоУчета
		|				ИЛИ &РегламентноеЗадание)
		|			И (УзлыКорректировкиПриемникПередачи.ВидДеятельностиНДС        = Себестоимость.КорВидДеятельностиНДС
		|				ИЛИ &РегламентноеЗадание)
		|			И Себестоимость.РазделУчета    <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
		|			И Себестоимость.КорОрганизация <> Себестоимость.Организация
		|			И Себестоимость.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			ВтУзлыКорректировки КАК УзлыКорректировкиПриемникРеглУчет
		|		ПО
		|			УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаНоменклатуры 	= Себестоимость.КорАналитикаУчетаНоменклатуры
		|			И УзлыКорректировкиПриемникРеглУчет.РазделУчета 				= Себестоимость.РазделУчета
		|			И УзлыКорректировкиПриемникРеглУчет.ВидЗапасов 					= Себестоимость.КорВидЗапасов
		|			И УзлыКорректировкиПриемникРеглУчет.Организация 				= Себестоимость.КорОрганизация
		|			И УзлыКорректировкиПриемникРеглУчет.Партия 						= Себестоимость.КорПартия
		|			И УзлыКорректировкиПриемникРеглУчет.АналитикаУчетаПартий 		= Себестоимость.КорАналитикаУчетаПартий
		|			И УзлыКорректировкиПриемникРеглУчет.АналитикаФинансовогоУчета 	= Себестоимость.КорАналитикаФинансовогоУчета
		|			И УзлыКорректировкиПриемникРеглУчет.ВидДеятельностиНДС 			= Себестоимость.КорВидДеятельностиНДС
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЕстьВозвратныеОтходы КАК ЕстьВозвратныеОтходы
		|			ПО ЕстьВозвратныеОтходы.Организация = Себестоимость.Организация
		|			И ЕстьВозвратныеОтходы.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
		|			И ЕстьВозвратныеОтходы.ВидЗапасов = Себестоимость.ВидЗапасов
		|			И ЕстьВозвратныеОтходы.РазделУчета = Себестоимость.РазделУчета
		|	ГДЕ
		|		НЕ Себестоимость.СлужебноеВидДвиженияПриход
		|		И Себестоимость.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		И НЕ (Себестоимость.Сторно
		|			И Себестоимость.ТипЗаписи В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДополнениеПрошлыйПериод),
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписанияНаВыпускСторноПрошлогоПериода)))
		|		И (НЕ УзлыКорректировкиПриемник.НомерУзла ЕСТЬ NULL
		|			ИЛИ НЕ УзлыКорректировкиПриемникПередачи.НомерУзла ЕСТЬ NULL
		|			ИЛИ НЕ УзлыКорректировкиПриемникРеглУчет.НомерУзла ЕСТЬ NULL)
		// Исключим перемещения в тот же самый узел, кроме выпуска продукции
		|		И (УзлыКорректировкиИсточник.НомерУзла <>
		|			(ВЫБОР
		|				КОГДА Себестоимость.ХозяйственнаяОперация В (
		|				 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
		|				 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет))
		|					ТОГДА УзлыКорректировкиПриемникРеглУчет.НомерУзла
		|				КОГДА НЕ УзлыКорректировкиПриемникПередачи.НомерУзла ЕСТЬ NULL
		|					ТОГДА УзлыКорректировкиПриемникПередачи.НомерУзла
		|				ИНАЧЕ УзлыКорректировкиПриемник.НомерУзла КОНЕЦ)
		|			ИЛИ Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции))
		// Исключаем возвратные отходы (дуга для возвратных отходов формируется отдельным запросом).
		|		И НЕ(Себестоимость.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|			И Себестоимость.Количество < 0
		|			И НЕ ЕстьВозвратныеОтходы.Организация ЕСТЬ NULL)
		|
		// Уменьшение веса дуг при возврате товаров от клиента или при корректировке реализации в минус,
		// если при возврате не меняется вид деятельности НДС.
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
		|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
		|		ЛОЖЬ КАК РеализацияВДругуюОрганизацию,
		|		-Себестоимость.Количество КАК Количество,
		|		ЛОЖЬ КАК РаботаДляДавальца,
		|		ЛОЖЬ КАК ПродукцияДавальца
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
		|		ПО УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры   = Себестоимость.КорАналитикаУчетаНоменклатуры
		|			И УзлыКорректировкиИсточник.РазделУчета               = Себестоимость.РазделУчета
		|			И УзлыКорректировкиИсточник.ВидЗапасов                = Себестоимость.КорВидЗапасов
		|			И УзлыКорректировкиИсточник.Организация               = Себестоимость.Организация
		|			И УзлыКорректировкиИсточник.Партия                    = Себестоимость.Партия
		|			И УзлыКорректировкиИсточник.АналитикаУчетаПартий      = Себестоимость.АналитикаУчетаПартий
		|			И УзлыКорректировкиИсточник.АналитикаФинансовогоУчета = Себестоимость.АналитикаФинансовогоУчета
		|			И УзлыКорректировкиИсточник.ВидДеятельностиНДС        = Себестоимость.ВидДеятельностиНДСОтгрузки
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
		|		ПО УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры   = Себестоимость.АналитикаУчетаНоменклатуры
		|			И УзлыКорректировкиПриемник.РазделУчета               = Себестоимость.РазделУчета
		|			И УзлыКорректировкиПриемник.ВидЗапасов                = Себестоимость.ВидЗапасов
		|			И УзлыКорректировкиПриемник.Организация               = Себестоимость.Организация
		|			И УзлыКорректировкиПриемник.Партия                    = Себестоимость.Партия
		|			И УзлыКорректировкиПриемник.АналитикаУчетаПартий      = Себестоимость.АналитикаУчетаПартий
		|			И УзлыКорректировкиПриемник.АналитикаФинансовогоУчета = Себестоимость.АналитикаФинансовогоУчета
		|			И УзлыКорректировкиПриемник.ВидДеятельностиНДС        = Себестоимость.ВидДеятельностиНДС
		|	ГДЕ
		|		НЕ Себестоимость.СлужебноеВидДвиженияПриход
		|		И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
		|		И Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
		|		И УзлыКорректировкиИсточник.НомерУзла <> УзлыКорректировкиПриемник.НомерУзла
		|
		|	) КАК Себестоимость
		|СГРУППИРОВАТЬ ПО
		|	Себестоимость.НомерУзлаИсточник,
		|	Себестоимость.НомерУзлаПриемник,
		|	Себестоимость.РеализацияВДругуюОрганизацию
		|";
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляРешенияСЛУПоФИФОВзвешенная

Процедура ПодготовитьДанныеДляРасчетаСтоимостиПоФИФО(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);

	// Формирование таблицы узлов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	Себестоимость.КоличествоОстаток
	|ПОМЕСТИТЬ ВТНачальныеОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|			Организация В (&ОрганизацииСФИФОВзвешенная)
	|		) КАК Себестоимость
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	Себестоимость.Количество                    КАК КоличествоОстаток,
	|	Себестоимость.ДопРасходы                    КАК ДопРасходыОстаток,
	|	Себестоимость.ДопРасходыБезНДС              КАК ДопРасходыБезНДСОстаток,
	|	Себестоимость.Трудозатраты                  КАК ТрудозатратыОстаток,
	|	Себестоимость.ПостатейныеПостоянныеСНДС     КАК ПостатейныеПостоянныеСНДСОстаток,
	|	Себестоимость.ПостатейныеПостоянныеБезНДС   КАК ПостатейныеПостоянныеБезНДСОстаток,
	|	Себестоимость.ПостатейныеПеременныеСНДС     КАК ПостатейныеПеременныеСНДСОстаток,
	|	Себестоимость.ПостатейныеПеременныеБезНДС   КАК ПостатейныеПеременныеБезНДСОстаток,
	|
	|	Себестоимость.ДопРасходыРегл                КАК ДопРасходыРеглОстаток,
	|	Себестоимость.ТрудозатратыРегл              КАК ТрудозатратыРеглОстаток,
	|	Себестоимость.ПостатейныеПостоянныеРегл     КАК ПостатейныеПостоянныеРеглОстаток,
	|	Себестоимость.ПостатейныеПеременныеРегл     КАК ПостатейныеПеременныеРеглОстаток,
	|	Себестоимость.ДопРасходыУпр                 КАК ДопРасходыУпрОстаток,
	|	Себестоимость.ТрудозатратыУпр               КАК ТрудозатратыУпрОстаток,
	|	Себестоимость.ПостатейныеПостоянныеУпр      КАК ПостатейныеПостоянныеУпрОстаток,
	|	Себестоимость.ПостатейныеПеременныеУпр      КАК ПостатейныеПеременныеУпрОстаток
	|
	|ПОМЕСТИТЬ ВТКонечныеОстатки
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.Организация В (&ОрганизацииСФИФОВзвешенная)
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|
	|	СУММА(Себестоимость.Количество) КАК КоличествоПриход
	|ПОМЕСТИТЬ ВТПриходы
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.СлужебноеВидДвиженияПриход
	|	И Себестоимость.Организация В (&ОрганизацииСФИФОВзвешенная)
	|	И (Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		ИЛИ НЕ &ПартионныйУчетВерсии22)
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1) КАК Период,
	|	КонечныеОстатки.Организация,
	|	КонечныеОстатки.АналитикаУчетаНоменклатуры,
	|	КонечныеОстатки.РазделУчета,
	|	КонечныеОстатки.ВидЗапасов,
	|	КонечныеОстатки.Партия,
	|	КонечныеОстатки.АналитикаУчетаПартий,
	|	КонечныеОстатки.АналитикаФинансовогоУчета,
	|	КонечныеОстатки.ВидДеятельностиНДС,
	|
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстаток,
	|	(ВЫБОР
	|		КОГДА КонечныеОстатки.КоличествоОстаток > 0 ТОГДА КонечныеОстатки.КоличествоОстаток
	|		ИНАЧЕ 0 КОНЕЦ) 																		КАК КоличествоОстатокНаКонецПериода,
	|	ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) КАК КоличествоПриход,
	|
	|	0 КАК СтоимостьОстаток,
	|	0 КАК СтоимостьБезНДСОстаток,
	|	0 КАК СтоимостьЗабалансоваяОстаток,
	|	0 КАК СтоимостьРеглОстаток,
	|	0 КАК СтоимостьЗабалансоваяРеглОстаток,
	|	0 КАК СтоимостьУпрОстаток,
	|
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК СтоимостьДопРасходыБезНДСОстаток,
	|
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеСНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеСНДСОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеБезНДСОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеСНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеСНДСОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		  И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеБезНДСОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеБезНДСОстаток,
	|
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ДопРасходыУпрОстаток /
	|					(ЕСТЬNULL(Приходы.КоличествоПриход, 0) + ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДопРасходыУпрОстаток,
	|
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеРеглОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеРеглОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ТрудозатратыУпрОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ТрудозатратыУпрОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПостоянныеУпрОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПостоянныеУпрОстаток,
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > КонечныеОстатки.КоличествоОстаток
	|		 И ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0) > 0
	|			ТОГДА КонечныеОстатки.КоличествоОстаток * КонечныеОстатки.ПостатейныеПеременныеУпрОстаток /
	|					(ЕСТЬNULL(НачальныеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(Приходы.КоличествоПриход, 0))
	|		ИНАЧЕ 0 КОНЕЦ) КАК ПостатейныеПеременныеУпрОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ВТКонечныеОстатки КАК КонечныеОстатки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК НачальныеОстатки
	|		ПО КонечныеОстатки.Организация = НачальныеОстатки.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = НачальныеОстатки.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = НачальныеОстатки.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = НачальныеОстатки.ВидЗапасов
	|		И КонечныеОстатки.Партия = НачальныеОстатки.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий = НачальныеОстатки.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета = НачальныеОстатки.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС = НачальныеОстатки.ВидДеятельностиНДС
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПриходы КАК Приходы
	|		ПО КонечныеОстатки.Организация = Приходы.Организация
	|		И КонечныеОстатки.АналитикаУчетаНоменклатуры = Приходы.АналитикаУчетаНоменклатуры
	|		И КонечныеОстатки.РазделУчета = Приходы.РазделУчета
	|		И КонечныеОстатки.ВидЗапасов = Приходы.ВидЗапасов
	|		И КонечныеОстатки.Партия = Приходы.Партия
	|		И КонечныеОстатки.АналитикаУчетаПартий = Приходы.АналитикаУчетаПартий
	|		И КонечныеОстатки.АналитикаФинансовогоУчета = Приходы.АналитикаФинансовогоУчета
	|		И КонечныеОстатки.ВидДеятельностиНДС = Приходы.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТНачальныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТКонечныеОстатки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВТПриходы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	1 
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);

	Запрос.Текст =
	"
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация                           КАК Организация,
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.РазделУчета                           КАК РазделУчета,
	|	СебестоимостьТоваров.ВидЗапасов                            КАК ВидЗапасов,
	|	СебестоимостьТоваров.Партия                                КАК Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий                  КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета             КАК АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС                    КАК ВидДеятельностиНДС,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, День)) КАК Период
	|ПОМЕСТИТЬ ТаблицаПериодыПартий
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|			ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|				И СебестоимостьТоваров.РазделУчета 				 = ТаблицаОстатков.РазделУчета
	|				И СебестоимостьТоваров.ВидЗапасов  				 = ТаблицаОстатков.ВидЗапасов
	|				И СебестоимостьТоваров.Организация 				 = ТаблицаОстатков.Организация
	|				И СебестоимостьТоваров.Партия 					 = ТаблицаОстатков.Партия
	|				И СебестоимостьТоваров.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|				И СебестоимостьТоваров.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|				И СебестоимостьТоваров.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|				И ТаблицаОстатков.КоличествоОстаток <> 0
	|ГДЕ
	|	СебестоимостьТоваров.СлужебноеВидДвиженияПриход
	|	И СебестоимостьТоваров.Стоимость <> 0
	|	И СебестоимостьТоваров.Период < ТаблицаОстатков.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.АналитикаФинансовогоУчета,
	|	СебестоимостьТоваров.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Себестоимость.Период                                КАК Период,
	|	Себестоимость.Организация                           КАК Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                           КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                            КАК ВидЗапасов,
	|	Себестоимость.Партия                                КАК Партия,
	|	Себестоимость.АналитикаУчетаПартий                  КАК АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета             КАК АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС                    КАК ВидДеятельностиНДС,
	|	СУММА(Себестоимость.Количество)                     КАК Количество,
	|	СУММА(Себестоимость.Стоимость)                      КАК Стоимость,
	|	СУММА(Себестоимость.СтоимостьБезНДС)                КАК СтоимостьБезНДС,
	|	СУММА(Себестоимость.СтоимостьЗабалансовая)          КАК СтоимостьЗабалансовая,
	|	СУММА(Себестоимость.СтоимостьРегл)                  КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьЗабалансоваяРегл)      КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(Себестоимость.СтоимостьУпр)                   КАК СтоимостьУпр
	|ПОМЕСТИТЬ ТаблицаВнешнихПоступлений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПериодыПартий.Период                                КАК Период,
	|		ПериодыПартий.Организация                           КАК Организация,
	|		ПериодыПартий.АналитикаУчетаНоменклатуры            КАК АналитикаУчетаНоменклатуры,
	|		ПериодыПартий.РазделУчета                           КАК РазделУчета,
	|		ПериодыПартий.ВидЗапасов                            КАК ВидЗапасов,
	|		ПериодыПартий.Партия                                КАК Партия,
	|		ПериодыПартий.АналитикаУчетаПартий                  КАК АналитикаУчетаПартий,
	|		ПериодыПартий.АналитикаФинансовогоУчета             КАК АналитикаФинансовогоУчета,
	|		ПериодыПартий.ВидДеятельностиНДС                    КАК ВидДеятельностиНДС,
	|		ЕСТЬNULL(Себестоимость.Количество, 0)               КАК Количество,
	|		ЕСТЬNULL(Себестоимость.Стоимость, 0)                КАК Стоимость,
	|		ЕСТЬNULL(Себестоимость.СтоимостьБезНДС, 0)          КАК СтоимостьБезНДС,
	|		ЕСТЬNULL(Себестоимость.СтоимостьЗабалансовая, 0)    КАК СтоимостьЗабалансовая,
	|		ЕСТЬNULL(Себестоимость.СтоимостьРегл, 0)            КАК СтоимостьРегл,
	|		ЕСТЬNULL(Себестоимость.СтоимостьЗабалансоваяРегл, 0) КАК СтоимостьЗабалансоваяРегл,
	|		ЕСТЬNULL(Себестоимость.СтоимостьУпр, 0)             КАК СтоимостьУпр
	|	ИЗ
	|		ТаблицаПериодыПартий КАК ПериодыПартий
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|			ПО ПериодыПартий.АналитикаУчетаНоменклатуры   = Себестоимость.АналитикаУчетаНоменклатуры
	|				И ПериодыПартий.РазделУчета               = Себестоимость.РазделУчета
	|				И ПериодыПартий.ВидЗапасов                = Себестоимость.ВидЗапасов
	|				И ПериодыПартий.Организация               = Себестоимость.Организация
	|				И ПериодыПартий.Партия                    = Себестоимость.Партия
	|				И ПериодыПартий.АналитикаУчетаПартий      = Себестоимость.АналитикаУчетаПартий
	|				И ПериодыПартий.АналитикаФинансовогоУчета = Себестоимость.АналитикаФинансовогоУчета
	|				И ПериодыПартий.ВидДеятельностиНДС        = Себестоимость.ВидДеятельностиНДС
	|				И Себестоимость.СлужебноеВидДвиженияПриход
	|				И (Себестоимость.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|				И (Себестоимость.ХозяйственнаяОперация В (&МассивОперацийПоступлениеВнешнее))
	|				И Себестоимость.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	) КАК Себестоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Период,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Организация,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаВнешнихПоступлений.Период КАК Период,
	|	ТаблицаОстатков.Организация,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.РазделУчета,
	|	ТаблицаОстатков.ВидЗапасов,
	|	ТаблицаОстатков.Партия,
	|	ТаблицаОстатков.АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаОстатков.ВидДеятельностиНДС,
	|	(ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток > ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ТаблицаОстатков.КоличествоОстаток - ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|		ИНАЧЕ 0 КОНЕЦ) КАК НовыйКоличествоОстаток,
	|	ТаблицаОстатков.КоличествоОстатокНаКонецПериода,
	|	ТаблицаОстатков.КоличествоПриход,
	|
	|	ТаблицаОстатков.СтоимостьОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.Стоимость, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьОстаток,
	|
	|	ТаблицаОстатков.СтоимостьБезНДСОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьБезНДС, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьБезНДСОстаток,
	|
	|	ТаблицаОстатков.СтоимостьЗабалансоваяОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансовая, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьЗабалансоваяОстаток,
	|
	|	ТаблицаОстатков.СтоимостьРеглОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьРеглОстаток,
	|
	|	ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьЗабалансоваяРегл, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьЗабалансоваяРеглОстаток,
	|
	|	ТаблицаОстатков.СтоимостьУпрОстаток
	|	+ ВЫБОР
	|		КОГДА ТаблицаОстатков.КоличествоОстаток >= ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьУпр, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаВнешнихПоступлений.СтоимостьУпр, 0) * ТаблицаОстатков.КоличествоОстаток / ЕСТЬNULL(ТаблицаВнешнихПоступлений.Количество, 1)
	|	КОНЕЦ                                      КАК НоваяСтоимостьУпрОстаток,
	|
	|	ТаблицаОстатков.СтоимостьДопРасходыОстаток          КАК НоваяСтоимостьДопРасходыОстаток,
	|	ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток    КАК НоваяСтоимостьДопРасходыБезНДСОстаток,
	|	ТаблицаОстатков.ТрудозатратыОстаток                 КАК НоваяТрудозатратыОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеСНДСОстаток    КАК НоваяПостатейныеПостоянныеСНДСОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеБезНДСОстаток  КАК НоваяПостатейныеПостоянныеБезНДСОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеСНДСОстаток    КАК НоваяПостатейныеПеременныеСНДСОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеБезНДСОстаток  КАК НоваяПостатейныеПеременныеБезНДСОстаток,
	|
	|	ТаблицаОстатков.ДопРасходыРеглОстаток               КАК НоваяДопРасходыРеглОстаток,
	|	ТаблицаОстатков.ТрудозатратыРеглОстаток             КАК НоваяТрудозатратыРеглОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеРеглОстаток    КАК НоваяПостатейныеПостоянныеРеглОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеРеглОстаток    КАК НоваяПостатейныеПеременныеРеглОстаток,
	|
	|	ТаблицаОстатков.ДопРасходыУпрОстаток                КАК НоваяДопРасходыУпрОстаток,
	|	ТаблицаОстатков.ТрудозатратыУпрОстаток              КАК НоваяТрудозатратыУпрОстаток,
	|	ТаблицаОстатков.ПостатейныеПостоянныеУпрОстаток     КАК НоваяПостатейныеПостоянныеУпрОстаток,
	|	ТаблицаОстатков.ПостатейныеПеременныеУпрОстаток     КАК НоваяПостатейныеПеременныеУпрОстаток
	|
	|ПОМЕСТИТЬ ТаблицаНовыхОстатков
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВнешнихПоступлений КАК ТаблицаВнешнихПоступлений
	|		ПО ТаблицаОстатков.АналитикаУчетаНоменклатуры 	= ТаблицаВнешнихПоступлений.АналитикаУчетаНоменклатуры
	|			И ТаблицаОстатков.Организация 				= ТаблицаВнешнихПоступлений.Организация
	|			И ТаблицаОстатков.РазделУчета 				= ТаблицаВнешнихПоступлений.РазделУчета
	|			И ТаблицаОстатков.ВидЗапасов  				= ТаблицаВнешнихПоступлений.ВидЗапасов
	|			И ТаблицаОстатков.Партия                    = ТаблицаВнешнихПоступлений.Партия
	|			И ТаблицаОстатков.АналитикаУчетаПартий      = ТаблицаВнешнихПоступлений.АналитикаУчетаПартий
	|			И ТаблицаОстатков.АналитикаФинансовогоУчета = ТаблицаВнешнихПоступлений.АналитикаФинансовогоУчета
	|			И ТаблицаОстатков.ВидДеятельностиНДС        = ТаблицаВнешнихПоступлений.ВидДеятельностиНДС
	|			И ТаблицаОстатков.КоличествоОстаток <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаВнешнихПоступлений
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаНовыхОстатков.Период,
	|	ТаблицаНовыхОстатков.Организация,
	|	ТаблицаНовыхОстатков.АналитикаУчетаНоменклатуры,
	|	ТаблицаНовыхОстатков.РазделУчета,
	|	ТаблицаНовыхОстатков.ВидЗапасов,
	|	ТаблицаНовыхОстатков.Партия,
	|	ТаблицаНовыхОстатков.АналитикаУчетаПартий,
	|	ТаблицаНовыхОстатков.АналитикаФинансовогоУчета,
	|	ТаблицаНовыхОстатков.ВидДеятельностиНДС,
	|
	|	ТаблицаНовыхОстатков.НовыйКоличествоОстаток КАК КоличествоОстаток,
	|	ТаблицаНовыхОстатков.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаНовыхОстатков.КоличествоПриход,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьОстаток                   КАК СтоимостьОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьБезНДСОстаток             КАК СтоимостьБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяОстаток       КАК СтоимостьЗабалансоваяОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьРеглОстаток               КАК СтоимостьРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьЗабалансоваяРеглОстаток   КАК СтоимостьЗабалансоваяРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьУпрОстаток                КАК СтоимостьУпрОстаток,
	|
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыОстаток         КАК СтоимостьДопРасходыОстаток,
	|	ТаблицаНовыхОстатков.НоваяСтоимостьДопРасходыБезНДСОстаток   КАК СтоимостьДопРасходыБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыОстаток                КАК ТрудозатратыОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеСНДСОстаток   КАК ПостатейныеПостоянныеСНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеБезНДСОстаток КАК ПостатейныеПостоянныеБезНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеСНДСОстаток   КАК ПостатейныеПеременныеСНДСОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеБезНДСОстаток КАК ПостатейныеПеременныеБезНДСОстаток,
	|
	|	ТаблицаНовыхОстатков.НоваяДопРасходыРеглОстаток              КАК ДопРасходыРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыРеглОстаток            КАК ТрудозатратыРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеРеглОстаток   КАК ПостатейныеПостоянныеРеглОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеРеглОстаток   КАК ПостатейныеПеременныеРеглОстаток,
	|
	|	ТаблицаНовыхОстатков.НоваяДопРасходыУпрОстаток               КАК ДопРасходыУпрОстаток,
	|	ТаблицаНовыхОстатков.НоваяТрудозатратыУпрОстаток             КАК ТрудозатратыУпрОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПостоянныеУпрОстаток    КАК ПостатейныеПостоянныеУпрОстаток,
	|	ТаблицаНовыхОстатков.НоваяПостатейныеПеременныеУпрОстаток    КАК ПостатейныеПеременныеУпрОстаток
	|
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ТаблицаНовыхОстатков КАК ТаблицаНовыхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаНовыхОстатков
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ТаблицаПериодыПартий КАК ТаблицаПериодыПартий
	|";
	
	Пока Истина Цикл 
		
		// Максимальное количество выполнений запроса = максимальному количеству поступлений товара на склад.
		РезультатЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина);
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		РасчетСебестоимостиПротоколРасчета.УвеличитьКоличествоОбработанныхДанныхДляЗамера(
			ПараметрыРасчета,
			РасчетСебестоимостиПрикладныеАлгоритмы.РазмерВременнойТаблицы(ПараметрыРасчета, "ТаблицаОстатков"));
		
	КонецЦикла;

	// Выполняется корректировка количества и стоимости внешних приходов в узел.
	Запрос.Текст = "
	|УНИЧТОЖИТЬ ТаблицаПериодыПартий
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ТаблицаУзлыКорректировки.НомерУзла                  КАК НомерУзла,
	|	ТаблицаУзлыКорректировки.Организация                КАК Организация,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаУзлыКорректировки.РазделУчета                КАК РазделУчета,
	|	ТаблицаУзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
	|	ТаблицаУзлыКорректировки.Партия                     КАК Партия,
	|	ТаблицаУзлыКорректировки.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|	ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	ТаблицаУзлыКорректировки.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	|
	|	(ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.Количество
	|		ИНАЧЕ ТаблицаУзлыКорректировки.Количество
	|		 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|		 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) КОНЕЦ) КАК Количество,
	|
	// Ресурсы для расчета себестоимости товаров предприятия.
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.Стоимость
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.Стоимость - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0) 
	|	КОНЕЦ                                 КАК Стоимость,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.СтоимостьБезНДС
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.СтоимостьБезНДС - ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0) 
	|	КОНЕЦ                                 КАК СтоимостьБезНДС,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.СтоимостьЗабалансовая
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.СтоимостьЗабалансовая - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяОстаток, 0) 
	|	КОНЕЦ                                 КАК СтоимостьЗабалансовая,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ДопРасходы
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.Стоимость - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ДопРасходы - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыОстаток, 0) 
	|	КОНЕЦ                                 КАК ДопРасходы,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ДопРасходыБезНДС
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьБезНДС - ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ДопРасходыБезНДС - ЕСТЬNULL(ТаблицаОстатков.СтоимостьДопРасходыБезНДСОстаток, 0)
	|	КОНЕЦ                                 КАК ДопРасходыБезНДС,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.Трудозатраты
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.Стоимость - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.Трудозатраты - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыОстаток, 0) 
	|	КОНЕЦ                                 КАК Трудозатраты,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПостоянныеСНДС
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.Стоимость - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПостоянныеСНДС - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеСНДСОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеСНДС,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПостоянныеБезНДС
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьБезНДС - ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПостоянныеБезНДС - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеБезНДСОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеБезНДС,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПеременныеСНДС
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.Стоимость - ЕСТЬNULL(ТаблицаОстатков.СтоимостьОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПеременныеСНДС - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеСНДСОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеСНДС,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПеременныеБезНДС
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьБезНДС - ЕСТЬNULL(ТаблицаОстатков.СтоимостьБезНДСОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПеременныеБезНДС - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеБезНДСОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеБезНДС,
	|
	// Ресурсы для расчета себестоимости товаров организаций (регламентированный учет).
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.СтоимостьРегл
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.СтоимостьРегл - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)
	|	КОНЕЦ                                 КАК СтоимостьРегл,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.СтоимостьЗабалансоваяРегл
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.СтоимостьЗабалансоваяРегл - ЕСТЬNULL(ТаблицаОстатков.СтоимостьЗабалансоваяРеглОстаток, 0) 
	|	КОНЕЦ                                 КАК СтоимостьЗабалансоваяРегл,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ДопРасходыРегл
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьРегл - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ДопРасходыРегл - ЕСТЬNULL(ТаблицаОстатков.ДопРасходыРеглОстаток, 0)
	|	КОНЕЦ                                 КАК ДопРасходыРегл,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ТрудозатратыРегл
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьРегл - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ТрудозатратыРегл - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыРеглОстаток, 0)
	|	КОНЕЦ                                 КАК ТрудозатратыРегл,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПостоянныеРегл
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьРегл - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПостоянныеРегл - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеРеглОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеРегл,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПеременныеРегл
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьРегл - ЕСТЬNULL(ТаблицаОстатков.СтоимостьРеглОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПеременныеРегл - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеРеглОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеРегл,
	|
	// Ресурсы для расчета себестоимости товаров организаций (управленческий учет).
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.СтоимостьУпр
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0)
	|			 + ЕСТЬNULL(ТаблицаОстатков.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.СтоимостьУпр - ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0)
	|	КОНЕЦ                                 КАК СтоимостьУпр,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ДопРасходыУпр
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьУпр - ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ДопРасходыУпр - ЕСТЬNULL(ТаблицаОстатков.ДопРасходыУпрОстаток, 0)
	|	КОНЕЦ                                              КАК ДопРасходыУпр,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ТрудозатратыУпр
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьУпр - ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ТрудозатратыУпр - ЕСТЬNULL(ТаблицаОстатков.ТрудозатратыУпрОстаток, 0)
	|	КОНЕЦ                                 КАК ТрудозатратыУпр,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПостоянныеУпр
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьУпр - ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПостоянныеУпр - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПостоянныеУпрОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПостоянныеУпр,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = ЕСТЬNULL(ТаблицаОстатков.КоличествоПриход, 0)
	|			ТОГДА ТаблицаУзлыКорректировки.ПостатейныеПеременныеУпр
	|		КОГДА ТаблицаУзлыКорректировки.Количество
	|			 - ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) = 0
	|			ТОГДА 0
	|		КОГДА (ТаблицаУзлыКорректировки.СтоимостьУпр - ЕСТЬNULL(ТаблицаОстатков.СтоимостьУпрОстаток, 0)) = 0
	|			И ЕСТЬNULL(ТаблицаОстатков.КоличествоОстатокНаКонецПериода, 0) <> 0
	|			ТОГДА 0	
	|		ИНАЧЕ
	|			ТаблицаУзлыКорректировки.ПостатейныеПеременныеУпр - ЕСТЬNULL(ТаблицаОстатков.ПостатейныеПеременныеУпрОстаток, 0)
	|	КОНЕЦ                                 КАК ПостатейныеПеременныеУпр
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировкиВременная
	|ИЗ
	|	ВтУзлыКорректировки КАК ТаблицаУзлыКорректировки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаУзлыКорректировки.АналитикаУчетаНоменклатуры   = ТаблицаОстатков.АналитикаУчетаНоменклатуры
	|			И ТаблицаУзлыКорректировки.РазделУчета               = ТаблицаОстатков.РазделУчета
	|			И ТаблицаУзлыКорректировки.ВидЗапасов                = ТаблицаОстатков.ВидЗапасов
	|			И ТаблицаУзлыКорректировки.Организация               = ТаблицаОстатков.Организация
	|			И ТаблицаУзлыКорректировки.Партия 					 = ТаблицаОстатков.Партия
	|			И ТаблицаУзлыКорректировки.АналитикаУчетаПартий 	 = ТаблицаОстатков.АналитикаУчетаПартий
	|			И ТаблицаУзлыКорректировки.АналитикаФинансовогоУчета = ТаблицаОстатков.АналитикаФинансовогоУчета
	|			И ТаблицаУзлыКорректировки.ВидДеятельностиНДС 		 = ТаблицаОстатков.ВидДеятельностиНДС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.НомерУзла КАК НомерУзла,
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.РазделУчета КАК РазделУчета,
	|	Т.ВидЗапасов КАК ВидЗапасов,
	|	Т.Партия КАК Партия,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	// Ресурсы для расчета себестоимости товаров предприятия.
	|	Т.Количество                  КАК Количество,
	|	Т.Стоимость                   КАК Стоимость,
	|	Т.СтоимостьБезНДС             КАК СтоимостьБезНДС,
	|	Т.СтоимостьЗабалансовая       КАК СтоимостьЗабалансовая,
	|	Т.ДопРасходы                  КАК ДопРасходы,
	|	Т.ДопРасходыБезНДС            КАК ДопРасходыБезНДС,
	|	Т.Трудозатраты                КАК Трудозатраты,
	|	Т.ПостатейныеПостоянныеСНДС   КАК ПостатейныеПостоянныеСНДС,
	|	Т.ПостатейныеПеременныеСНДС   КАК ПостатейныеПеременныеСНДС,
	|	Т.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|	Т.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	// Ресурсы для расчета себестоимости товаров организаций.
	|	Т.СтоимостьРегл               КАК СтоимостьРегл,
	|	Т.ДопРасходыРегл              КАК ДопРасходыРегл,
	|	Т.СтоимостьЗабалансоваяРегл   КАК СтоимостьЗабалансоваяРегл,
	|	Т.ТрудозатратыРегл            КАК ТрудозатратыРегл,
	|	Т.СтоимостьУпр                КАК СтоимостьУпр,
	|	Т.ДопРасходыУпр               КАК ДопРасходыУпр,
	|	Т.ТрудозатратыУпр             КАК ТрудозатратыУпр,
	|	Т.ПостатейныеПостоянныеРегл   КАК ПостатейныеПостоянныеРегл,
	|	Т.ПостатейныеПеременныеРегл   КАК ПостатейныеПеременныеРегл,
	|	Т.ПостатейныеПостоянныеУпр    КАК ПостатейныеПостоянныеУпр,
	|	Т.ПостатейныеПеременныеУпр    КАК ПостатейныеПеременныеУпр
	|
	|ПОМЕСТИТЬ ВтУзлыКорректировки
	|ИЗ
	|	ВтУзлыКорректировкиВременная КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ВтУзлыКорректировкиВременная
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляРешенияСЛУДополнительныеРасходы

// Этап "ПодготовкаДанныхДляРешенияСЛУ_ДополнительныеРасходы"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляРешенияСЛУ_ДополнительныеРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляРешенияСЛУ_ДополнительныеРасходы");
	
	// 1. Инициализация структуры данных этапа подготовки данных.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПодготовкуДанныхДляСледующихЭтапов(
		ПараметрыРасчета,
		"УзлыКорректировкиДополнительныхРасходов,
		|СвязиУзловДополнительныхРасходов,
		|СвязиУзловПроизводственныхРасходовПрошлыхПериодов");
		
	// 2. Формирование временных таблиц.
	РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьДанныеДляСледующихЭтапов(
		ПараметрыРасчета,
		ТекстДляРешенияСЛУ_ДополнительныеРасходы(ПараметрыРасчета));
	
	// 3. Завершаем этап подготовки данных. 
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьПодготовкуДанныхДляСледующихЭтапов(ПараметрыРасчета);
	
КонецПроцедуры

Функция ТекстДляРешенияСЛУ_ДополнительныеРасходы(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(РасчетСебестоимостиКорректировкаСтоимости.ТекстСуммыПрочихРасходов());
	ТекстыЗапросов.Добавить(ТекстУзлыКорректировкиДополнительныхРасходов());
	ТекстыЗапросов.Добавить(ТекстСвязиУзловДополнительныхРасходов());
	ТекстыЗапросов.Добавить(ТекстСвязиУзловПроизводственныхРасходовПрошлыхПериодов());
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());	
	Если ПараметрыРасчета <> Неопределено Тогда
		ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстУзлыКорректировкиДополнительныхРасходов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Т.НомерУзла) КАК НомерУзла
		|ПОМЕСТИТЬ МаксимальныеНомераУзловТоваров
		|ИЗ
		|	ВтУзлыКорректировки КАК Т
		|;
		|
		|ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерУзла,
		|	Источник.Организация,
		|	Источник.Подразделение,
		|	Источник.СтатьяРасходов,
		|	Источник.АналитикаРасходов,
		|	Источник.НаправлениеДеятельности,
		|	Источник.ВесСНДС,
		|	Источник.ВесБезНДС,
		|	Источник.ВесРегл,
		|	Источник.ВесУпр
		|ПОМЕСТИТЬ УзлыКорректировкиДополнительныхРасходовПредварительная
		|ИЗ
		|	(ВЫБРАТЬ
		|		Реквизиты.Организация,
		|		Реквизиты.Подразделение,
		|		Реквизиты.СтатьяРасходов,
		|		Реквизиты.АналитикаРасходов,
		|		Реквизиты.НаправлениеДеятельности,
		|		СУММА(Источник.ДоляСтоимости) КАК ВесСНДС,
		|		СУММА(Источник.ДоляСтоимостиБезНДС) КАК ВесБезНДС,
		|		СУММА(Источник.ДоляСтоимостиРегл) КАК ВесРегл,
		|		СУММА(Источник.ДоляСтоимостиУпр) КАК ВесУпр
		|	ИЗ
		|		ДолиДополнительныхРасходов КАК Источник
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|			ПО Источник.Регистратор = Реквизиты.Ссылка
		|
		|	СГРУППИРОВАТЬ ПО
		|		Реквизиты.Организация,
		|		Реквизиты.Подразделение,
		|		Реквизиты.СтатьяРасходов,
		|		Реквизиты.АналитикаРасходов,
		|		Реквизиты.НаправлениеДеятельности) КАК Источник
		|;
		|
		|ВЫБРАТЬ
		|	Источник.НомерУзла + ЕСТЬNULL(НомераУзлов.НомерУзла, 0) КАК НомерУзла,
		|	Источник.Организация,
		|	Источник.Подразделение,
		|	Источник.СтатьяРасходов,
		|	Источник.АналитикаРасходов,
		|	Источник.НаправлениеДеятельности,
		|	Источник.ВесСНДС,
		|	Источник.ВесБезНДС,
		|	Источник.ВесРегл,
		|	Источник.ВесУпр,
		|	ЕСТЬNULL(СуммыРасходовУпр.Сумма, 0)              КАК СтоимостьСНДС,
		|	ЕСТЬNULL(СуммыРасходовУпр.СуммаБезНДС, 0)        КАК СтоимостьБезНДС,
		|	ЕСТЬNULL(СуммыРасходовУпр.СуммаУпр, 0)           КАК СтоимостьУпр,
		|	ЕСТЬNULL(СуммыРасходовРегл.СуммаРегл, 0)         КАК СтоимостьРегл,
		|	ЕСТЬNULL(СуммыРасходовРегл.ПостояннаяРазница, 0) КАК ПостояннаяРазница,
		|	ЕСТЬNULL(СуммыРасходовРегл.ВременнаяРазница, 0)  КАК ВременнаяРазница
		|ПОМЕСТИТЬ УзлыКорректировкиДополнительныхРасходов
		|ИЗ
		|	УзлыКорректировкиДополнительныхРасходовПредварительная КАК Источник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
		|		ПО Статьи.Ссылка = Источник.СтатьяРасходов
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеНомераУзловТоваров КАК НомераУзлов
		|		ПО ИСТИНА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыРасходов КАК СуммыРасходовУпр
		|		ПО СуммыРасходовУпр.Организация = Источник.Организация
		|			И СуммыРасходовУпр.СтатьяРасходов = Источник.СтатьяРасходов
		|			И СуммыРасходовУпр.АналитикаРасходов = Источник.АналитикаРасходов
		|			И СуммыРасходовУпр.Подразделение = Источник.Подразделение
		|			И СуммыРасходовУпр.НаправлениеДеятельности = Источник.НаправлениеДеятельности
		|			И Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыРасходов КАК СуммыРасходовРегл
		|		ПО СуммыРасходовРегл.Организация = Источник.Организация
		|			И СуммыРасходовРегл.СтатьяРасходов = Источник.СтатьяРасходов
		|			И СуммыРасходовРегл.АналитикаРасходов = Источник.АналитикаРасходов
		|			И СуммыРасходовРегл.Подразделение = Источник.Подразделение
		|			И СуммыРасходовРегл.НаправлениеДеятельности = Источник.НаправлениеДеятельности
		|			И (Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|				ИЛИ Статьи.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстСвязиУзловДополнительныхРасходов()
	Возврат 
		"ВЫБРАТЬ
		|	Себестоимость.НомерУзлаИсточник    КАК НомерУзлаИсточник,
		|	Себестоимость.НомерУзлаПриемник    КАК НомерУзлаПриемник,
		|	СУММА(Себестоимость.ВесДугиСНДС)   КАК ВесДугиСНДС,
		|	СУММА(Себестоимость.ВесДугиБезНДС) КАК ВесДугиБезНДС,
		|	СУММА(Себестоимость.ВесДугиРегл)   КАК ВесДугиРегл,
		|	СУММА(Себестоимость.ВесДугиУпр)    КАК ВесДугиУпр,
		|	МАКСИМУМ(Себестоимость.ПринимаемыеВНУ)            КАК ПринимаемыеВНУ,
		|	МАКСИМУМ(Себестоимость.НеРаспределяетсяВБухУчете) КАК НеРаспределяетсяВБухУчете,
		|	МАКСИМУМ(Себестоимость.НеРаспределяетсяВНалУчете) КАК НеРаспределяетсяВНалУчете
		|ПОМЕСТИТЬ СвязиУзловДополнительныхРасходов
		|ИЗ (
		// Списание материалов на дополнительные расходы
		|	ВЫБРАТЬ
		|		УзлыКорректировкиИсточник.НомерУзла  КАК НомерУзлаИсточник,
		|		УзлыКорректировкиПриемник.НомерУзла  КАК НомерУзлаПриемник,
		|		(ВЫБОР
		|			КОГДА Себестоимость.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр
		|			 <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|				ТОГДА 0
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход ТОГДА -Себестоимость.Количество
		|			ИНАЧЕ Себестоимость.Количество КОНЕЦ) КАК ВесДугиСНДС,
		|		(ВЫБОР
		|			КОГДА Себестоимость.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр
		|			 <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|				ТОГДА 0
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход ТОГДА -Себестоимость.Количество
		|			ИНАЧЕ Себестоимость.Количество КОНЕЦ) КАК ВесДугиБезНДС,
		|		(ВЫБОР
		|			КОГДА Себестоимость.СтатьяРасходовСписания.ВариантРаспределенияРасходовРегл
		|			 <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|			И Себестоимость.СтатьяРасходовСписания.ВариантРаспределенияРасходовНУ
		|			 <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|			ИЛИ Себестоимость.ХозяйственнаяОперация = 
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
		|				ТОГДА 0
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход ТОГДА -Себестоимость.Количество
		|			ИНАЧЕ Себестоимость.Количество КОНЕЦ) КАК ВесДугиРегл,
		|		(ВЫБОР
		|			КОГДА Себестоимость.СтатьяРасходовСписания.ВариантРаспределенияРасходовУпр
		|			 <> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|			ИЛИ Себестоимость.ХозяйственнаяОперация = 
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
		|				ТОГДА 0
		|			КОГДА Себестоимость.СлужебноеВидДвиженияПриход ТОГДА -Себестоимость.Количество
		|			ИНАЧЕ Себестоимость.Количество КОНЕЦ) КАК ВесДугиУпр,
		|	ЕСТЬNULL(Себестоимость.СтатьяРасходовСписания.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринимаемыеВНУ,
		|	ЛОЖЬ КАК НеРаспределяетсяВБухУчете,
		|	ЛОЖЬ КАК НеРаспределяетсяВНалУчете
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиИсточник
		|		ПО УзлыКорректировкиИсточник.АналитикаУчетаНоменклатуры   = Себестоимость.АналитикаУчетаНоменклатуры
		|			И УзлыКорректировкиИсточник.РазделУчета               = Себестоимость.РазделУчета
		|			И УзлыКорректировкиИсточник.ВидЗапасов                = Себестоимость.ВидЗапасов
		|			И УзлыКорректировкиИсточник.Организация               = Себестоимость.Организация
		|			И УзлыКорректировкиИсточник.Партия                    = Себестоимость.Партия
		|			И УзлыКорректировкиИсточник.АналитикаУчетаПартий      = Себестоимость.АналитикаУчетаПартий
		|			И УзлыКорректировкиИсточник.АналитикаФинансовогоУчета = Себестоимость.АналитикаФинансовогоУчета
		|			И УзлыКорректировкиИсточник.ВидДеятельностиНДС        = Себестоимость.ВидДеятельностиНДС
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК КорОрганизации
		|		ПО КорОрганизации.Ссылка = Себестоимость.КорОрганизация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировкиПриемник
		|		ПО УзлыКорректировкиПриемник.СтатьяРасходов               = Себестоимость.СтатьяРасходовСписания
		|			И УзлыКорректировкиПриемник.АналитикаРасходов         = Себестоимость.АналитикаРасходов
		|			И УзлыКорректировкиПриемник.НаправлениеДеятельности   = Себестоимость.КорНаправлениеДеятельности
		|			И УзлыКорректировкиПриемник.Подразделение             = Себестоимость.Подразделение
		|			И УзлыКорректировкиПриемник.Организация               = ЕСТЬNULL(КорОрганизации.Ссылка, Себестоимость.Организация)
		|	ГДЕ
		|		Себестоимость.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставОС),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставНМА),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатациюБУНУ),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаПрочиеЦели),
		|													 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
		// Исключение сторно списания расходов с возвратом прошлого периода, т.к. стоимость рассчитывается на шаге СкорректироватьСтоимостьВозвратовПрошлыхПериодов
		|		И НЕ (Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы) 
		|			И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов))
		|		И НЕ (Себестоимость.Сторно И Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ИсправлениеПрошлогоПериода))
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// Распределение дополнительных расходов на товары
		|	ВЫБРАТЬ
		|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
		|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
		|		(ВЫБОР
		|			КОГДА Реквизиты.УправленческийУчет ТОГДА Доли.ДоляСтоимости
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиСНДС,
		|		(ВЫБОР
		|			КОГДА Реквизиты.УправленческийУчет ТОГДА Доли.ДоляСтоимостиБезНДС
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиБезНДС,
		|		(ВЫБОР
		|			КОГДА Реквизиты.РегламентированныйУчет ТОГДА Доли.ДоляСтоимостиРегл
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиРегл,
		|		(ВЫБОР
		|			КОГДА Реквизиты.УправленческийУчет ТОГДА Доли.ДоляСтоимостиУпр
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиУпр,
		|		ЕСТЬNULL(Реквизиты.СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринимаемыеВНУ,
		|		Реквизиты.НалоговыйУчет
		|			И НЕ Реквизиты.РегламентированныйУчет КАК НеРаспределяетсяВБухУчете,
		|		Реквизиты.РегламентированныйУчет
		|			И НЕ Реквизиты.НалоговыйУчет КАК НеРаспределяетсяВНалУчете
		|	ИЗ
		|		ДолиДополнительныхРасходов КАК Доли
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|			ПО Доли.Регистратор = Реквизиты.Ссылка
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировкиИсточник
		|			ПО Реквизиты.СтатьяРасходов = УзлыКорректировкиИсточник.СтатьяРасходов
		|				И Реквизиты.АналитикаРасходов = УзлыКорректировкиИсточник.АналитикаРасходов
		|				И Реквизиты.НаправлениеДеятельности = УзлыКорректировкиИсточник.НаправлениеДеятельности
		|				И Реквизиты.Подразделение = УзлыКорректировкиИсточник.Подразделение
		|				И Реквизиты.Организация = УзлыКорректировкиИсточник.Организация
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтУзлыКорректировки КАК УзлыКорректировкиПриемник
		|			ПО УзлыКорректировкиПриемник.АналитикаУчетаНоменклатуры
		|					= Доли.КорАналитикаУчетаНоменклатуры
		|				И УзлыКорректировкиПриемник.РазделУчета               = Доли.КорРазделУчета
		|				И УзлыКорректировкиПриемник.Организация               = Доли.КорОрганизация
		|				И УзлыКорректировкиПриемник.ВидЗапасов                = Доли.КорВидЗапасов
		|				И УзлыКорректировкиПриемник.Партия                    = Доли.КорПартия
		|				И УзлыКорректировкиПриемник.АналитикаУчетаПартий      = Доли.КорАналитикаУчетаПартий
		|				И УзлыКорректировкиПриемник.АналитикаФинансовогоУчета = Доли.КорАналитикаФинансовогоУчета
		|				И УзлыКорректировкиПриемник.ВидДеятельностиНДС        = Доли.КорВидДеятельностиНДС
		|	ГДЕ
		|		Доли.ХозяйственнаяОперация = НЕОПРЕДЕЛЕНО
		|		И Доли.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|		ИЛИ Доли.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// Распределение дополнительных расходов на другие статьи дополнительных расходов.
		|	ВЫБРАТЬ
		|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
		|		УзлыКорректировкиПриемник.НомерУзла КАК НомерУзлаПриемник,
		|		(ВЫБОР
		|			КОГДА Реквизиты.УправленческийУчет ТОГДА Доли.ДоляСтоимости
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиСНДС,
		|		(ВЫБОР
		|			КОГДА Реквизиты.УправленческийУчет ТОГДА Доли.ДоляСтоимостиБезНДС
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиБезНДС,
		|		(ВЫБОР
		|			КОГДА Реквизиты.РегламентированныйУчет ТОГДА Доли.ДоляСтоимостиРегл
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиРегл,
		|		(ВЫБОР
		|			КОГДА Реквизиты.УправленческийУчет ТОГДА Доли.ДоляСтоимостиУпр
		|			ИНАЧЕ 0 КОНЕЦ) КАК ВесДугиУпр,
		|		ЕСТЬNULL(Реквизиты.СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринимаемыеВНУ,
		|		Реквизиты.НалоговыйУчет
		|			И НЕ Реквизиты.РегламентированныйУчет КАК НеРаспределяетсяВБухУчете,
		|		Реквизиты.РегламентированныйУчет
		|			И НЕ Реквизиты.НалоговыйУчет КАК НеРаспределяетсяВНалУчете
		|	ИЗ
		|		ДолиДополнительныхРасходов КАК Доли
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|		ПО Доли.Регистратор = Реквизиты.Ссылка
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировкиИсточник
		|		ПО Реквизиты.СтатьяРасходов = УзлыКорректировкиИсточник.СтатьяРасходов
		|			И Реквизиты.АналитикаРасходов = УзлыКорректировкиИсточник.АналитикаРасходов
		|			И Реквизиты.НаправлениеДеятельности = УзлыКорректировкиИсточник.НаправлениеДеятельности
		|			И Реквизиты.Подразделение = УзлыКорректировкиИсточник.Подразделение
		|			И Реквизиты.Организация = УзлыКорректировкиИсточник.Организация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировкиПриемник
		|		ПО УзлыКорректировкиПриемник.СтатьяРасходов = Доли.КорСтатьяРасходов
		|			И УзлыКорректировкиПриемник.АналитикаРасходов = Доли.КорАналитикаРасходов
		|			И УзлыКорректировкиПриемник.НаправлениеДеятельности = Доли.КорНаправлениеДеятельности
		|			И УзлыКорректировкиПриемник.Подразделение = Доли.КорПодразделение
		|			И УзлыКорректировкиПриемник.Организация = Доли.КорОрганизация
		|	ГДЕ
		|		Доли.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеНДСНалоговымАгентом)
		|
		|	) КАК Себестоимость
		|СГРУППИРОВАТЬ ПО
		|	Себестоимость.НомерУзлаИсточник,
		|	Себестоимость.НомерУзлаПриемник
		|";
КонецФункции

Функция ТекстСвязиУзловПроизводственныхРасходовПрошлыхПериодов()
	Возврат 
		"ВЫБРАТЬ
		|		УзлыКорректировкиИсточник.НомерУзла КАК НомерУзлаИсточник,
		|		Доли.КорОрганизация					КАК Организация,
		|		Доли.КорПодразделение				КАК Подразделение,
		|		Доли.КорСтатьяРасходов				КАК СтатьяРасходов,
		|		Доли.КорАналитикаРасходов			КАК АналитикаРасходов,
		|		Доли.КорНаправлениеДеятельности		КАК НаправлениеДеятельности,
		|		Доли.ДоляСтоимости                  КАК ВесДугиСНДС,
		|		Доли.ДоляСтоимостиБезНДС            КАК ВесДугиБезНДС,
		|		Доли.ДоляСтоимостиРегл              КАК ВесДугиРегл,
		|		Доли.ДоляСтоимостиУпр               КАК ВесДугиУпр
		|ПОМЕСТИТЬ СвязиУзловПроизводственныхРасходовПрошлыхПериодов
		|	ИЗ
		|		ДолиДополнительныхРасходов КАК Доли
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|			ПО Доли.Регистратор = Реквизиты.Ссылка
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировкиИсточник
		|			ПО Реквизиты.СтатьяРасходов = УзлыКорректировкиИсточник.СтатьяРасходов
		|				И Реквизиты.АналитикаРасходов = УзлыКорректировкиИсточник.АналитикаРасходов
		|				И Реквизиты.НаправлениеДеятельности = УзлыКорректировкиИсточник.НаправлениеДеятельности
		|				И Реквизиты.Подразделение = УзлыКорректировкиИсточник.Подразделение
		|				И Реквизиты.Организация = УзлыКорректировкиИсточник.Организация
		|
		|	ГДЕ
		|		Доли.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|		И Доли.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам)";
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляРешенияСЛУВключениеИсключениеНДС

Процедура УзлыКорректировкиВключениеИсключениеНДС(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "УзлыКорректировкиВключениеИсключениеНДС");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ВыборкаДанных

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС,
	|	СУММА(Себестоимость.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Себестоимость.СтоимостьУпр) КАК СтоимостьУпр
	|ПОМЕСТИТЬ СтоимостьНДС
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости)
	|	И Себестоимость.РасчетПартий
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета,
	|	Себестоимость.ВидЗапасов,
	|	Себестоимость.Партия,
	|	Себестоимость.АналитикаУчетаПартий,
	|	Себестоимость.АналитикаФинансовогоУчета,
	|	Себестоимость.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|//////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла,           
	|
	|	СтоимостьНДС.СтоимостьРегл КАК СтоимостьРегл,
	|	СтоимостьНДС.СтоимостьУпр  КАК СтоимостьУпр
	|ПОМЕСТИТЬ УзлыКорректировкиВключениеИсключениеНДС
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтоимостьНДС КАК СтоимостьНДС
	|	ПО СтоимостьНДС.Организация                   = УзлыКорректировки.Организация
	|		И СтоимостьНДС.АналитикаУчетаНоменклатуры = УзлыКорректировки.АналитикаУчетаНоменклатуры
	|		И СтоимостьНДС.РазделУчета                = УзлыКорректировки.РазделУчета
	|		И СтоимостьНДС.ВидЗапасов                 = УзлыКорректировки.ВидЗапасов
	|		И СтоимостьНДС.Партия                     = УзлыКорректировки.Партия
	|		И СтоимостьНДС.АналитикаУчетаПартий       = УзлыКорректировки.АналитикаУчетаПартий
	|		И СтоимостьНДС.АналитикаФинансовогоУчета  = УзлыКорректировки.АналитикаФинансовогоУчета
	|		И СтоимостьНДС.ВидДеятельностиНДС         = УзлыКорректировки.ВидДеятельностиНДС
	|";
	#КонецОбласти
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтУзлыКорректировки");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЭтапа_ПодготовкаДанныхДляРешенияСЛУРезервыПодОбесценениеЗапасов

// Этап "ПодготовкаДанныхДляРешенияСЛУ_РезервыПодОбесценениеЗапасов"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляРешенияСЛУ_РезервыПодОбесценениеЗапасов(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета,
		"ПодготовкаДанныхДляРешенияСЛУ_РезервыПодОбесценениеЗапасов");
	
	ТаблицыКСохранению = Новый Массив;
	ТаблицыКСохранению.Добавить("ЕстьВозвратныеОтходы");
	ТаблицыКСохранению.Добавить("ВтУзлыКорректировки");
	// 1. Инициализация структуры данных этапа подготовки данных.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПодготовкуДанныхДляСледующихЭтапов(
		ПараметрыРасчета,
		СтрСоединить(ТаблицыКСохранению, ","));
		
	// 2. Формирование временных таблиц.
	РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьДанныеДляСледующихЭтапов(
		ПараметрыРасчета,
		ТекстДляРешенияСЛУ_РезервыПодОбесценениеЗапасов(ПараметрыРасчета));
	
	// 3. Завершаем этап подготовки данных. 
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьПодготовкуДанныхДляСледующихЭтапов(ПараметрыРасчета);
	
КонецПроцедуры

Функция ТекстДляРешенияСЛУ_РезервыПодОбесценениеЗапасов(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстВтЕстьВозвратныеОтходы());
	ТекстыЗапросов.Добавить(ТекстВтУзлыКорректировки_МатериальныеИТрудозатраты());

	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	Если ПараметрыРасчета <> Неопределено Тогда
		ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти


// Расчет системы линейных уравнений
#Область ПроцедурыРешенияСЛУПлатформой

// Для совместимости с платформой ниже 8.3.14
//
// Возвращаемое значение:
//	РасчетСистемЛинейныхУравнений - компонента решения системы линейных уравнений
//
Функция ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета) Экспорт
	
	РасчетСистемЛинейныхУравнений = ОбщегоНазначения.ВычислитьВБезопасномРежиме("Новый РасчетСистемЛинейныхУравнений");
	
	РасчетСистемЛинейныхУравнений.КоличествоИтераций				  = ПараметрыРасчета.РешениеСЛУ.МаксимальноеКоличествоИтераций;
	РасчетСистемЛинейныхУравнений.ТребуемаяТочность					  = ПараметрыРасчета.РешениеСЛУ.ТребуемаяТочность;
	РасчетСистемЛинейныхУравнений.ИспользованиеВычислительныхРесурсов = ПараметрыРасчета.РешениеСЛУ.ИспользованиеВычислительныхРесурсов;
	
	Возврат РасчетСистемЛинейныхУравнений;
	
КонецФункции

// Выполняет расчет систем уравнений для показателей:
//	Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Трудозатраты
//		
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешений_СебестоимостьПредприятия"
//
Процедура РешитьСЛУПлатформой_СебестоимостьПредприятия(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РешитьСЛУПлатформой_СебестоимостьПредприятия");
	
	ПояснениеДляЗамера = НСтр("ru = 'Решение для себестоимости предприятия'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ЗапросУзлы = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла				    КАК НомерУзла,
	|	УзлыКорректировки.Стоимость                 КАК Стоимость,
	|	УзлыКорректировки.СтоимостьБезНДС           КАК СтоимостьБезНДС,
	|	УзлыКорректировки.СтоимостьЗабалансовая     КАК СтоимостьЗабалансовая,
	|	УзлыКорректировки.Трудозатраты              КАК Трудозатраты
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	                                          
	ЗапросСвязи = Новый Запрос();
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимость,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.РаботаДляДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансовая,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатраты
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимость,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьБезНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатраты
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	ЗапросСвязи.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ЗапросСвязи.Текст);
	
	// источники данных
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "Стоимость";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимость";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьБезНДС";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьБезНДС";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьЗабалансовая";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьЗабалансовая";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "Трудозатраты";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиТрудозатраты";
	
	// решение
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"Стоимость, СтоимостьБезНДС, СтоимостьЗабалансовая, Трудозатраты");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	Запрос = Новый Запрос();
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.Стоимость, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК Стоимость,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьБезНДС, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансовая, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансовая,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.Трудозатраты, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК Трудозатраты
	|
	|ПОМЕСТИТЬ ВтТаблицаРешений_СебестоимостьПредприятия
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаРешений 
	|";
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	СохранитьСЛУВФайл(ПараметрыРасчета);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//	СтоимостьРегл, СтоимостьЗабалансоваяРегл, ТрудозатратыРегл, СтоимостьУпр, ТрудозатратыУпр
//		
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешений_СебестоимостьОрганизаций"
//
Процедура РешитьСЛУПлатформой_СебестоимостьОрганизаций(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РешитьСЛУПлатформой_СебестоимостьОрганизаций");
	
	ПояснениеДляЗамера = НСтр("ru = 'Решение для себестоимости организаций'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ЗапросУзлы = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст =
		"ВЫБРАТЬ
		|	НачальнаяСтоимостьУзлов.НомерУзла КАК НомерУзла,
		|	СУММА(НачальнаяСтоимостьУзлов.СтоимостьРегл) КАК СтоимостьРегл,
		|	СУММА(НачальнаяСтоимостьУзлов.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
		|	СУММА(НачальнаяСтоимостьУзлов.ТрудозатратыРегл) КАК ТрудозатратыРегл,
		|	СУММА(НачальнаяСтоимостьУзлов.СтоимостьУпр) КАК СтоимостьУпр,
		|	СУММА(НачальнаяСтоимостьУзлов.ТрудозатратыУпр) КАК ТрудозатратыУпр
		|ИЗ
		|	(ВЫБРАТЬ
		|		УзлыКорректировки.НомерУзла КАК НомерУзла,
		|		УзлыКорректировки.СтоимостьРегл КАК СтоимостьРегл,
		|		УзлыКорректировки.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
		|		УзлыКорректировки.ТрудозатратыРегл КАК ТрудозатратыРегл,
		|		УзлыКорректировки.СтоимостьУпр КАК СтоимостьУпр,
		|		УзлыКорректировки.ТрудозатратыУпр КАК ТрудозатратыУпр
		|	ИЗ
		|		ВтУзлыКорректировки КАК УзлыКорректировки
		|	
		|	) КАК НачальнаяСтоимостьУзлов
		|
		|СГРУППИРОВАТЬ ПО
		|	НачальнаяСтоимостьУзлов.НомерУзла";
	                                          
	ЗапросСвязи = Новый Запрос();
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьРегл,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.РаботаДляДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансоваяРегл,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыРегл,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьУпр,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыУпр
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.РеализацияВДругуюОрганизацию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьРегл,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыРегл,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьУпр,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиТрудозатратыУпр
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|";
	ЗапросСвязи.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ЗапросСвязи.Текст);
	
	// источники данных
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьРегл";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьРегл";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьЗабалансоваяРегл";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьЗабалансоваяРегл";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ТрудозатратыРегл";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиТрудозатратыРегл";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьУпр";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьУпр";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "ТрудозатратыУпр";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиТрудозатратыУпр";
	
	// решение
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"СтоимостьРегл, СтоимостьЗабалансоваяРегл, ТрудозатратыРегл, СтоимостьУпр, ТрудозатратыУпр");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	Запрос = Новый Запрос();
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьРегл, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьРегл,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьЗабалансоваяРегл, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансоваяРегл,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ТрудозатратыРегл, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ТрудозатратыРегл,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьУпр, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьУпр,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.ТрудозатратыУпр, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК ТрудозатратыУпр
	|
	|ПОМЕСТИТЬ ВтТаблицаРешений_СебестоимостьОрганизаций
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|УНИЧТОЖИТЬ ТаблицаРешений 
	|";
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//	ДопРасходы, ДопРасходыБезНДС
//		
// Результатом работы данной процедуры будет временная таблица "ТаблицаРешений".
//
Процедура РешитьСЛУПлатформой_ДополнительныеРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РешитьСЛУПлатформой_ДопРасходыПредприятия");
	
	ПояснениеДляЗамера = НСтр("ru = 'Решение для себестоимости предприятия'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(
	|		СУММА((ЕСТЬNULL(СтоимостьПартийТоваров.Стоимость, 0)
	|				+ ЕСТЬNULL(СтоимостьПартийТоваров.Трудозатраты, 0))
	|		* ЕСТЬNULL(Связи.ВесДугиСНДС, 0)) КАК ЧИСЛО(28,10)) КАК ДопРасходыСНДС,
	|
	|	ВЫРАЗИТЬ(
	|		СУММА((ЕСТЬNULL(СтоимостьПартийТоваров.СтоимостьБезНДС, 0)
	|				+ ЕСТЬNULL(СтоимостьПартийТоваров.Трудозатраты, 0))
	|		* ЕСТЬNULL(Связи.ВесДугиБезНДС, 0)) КАК ЧИСЛО(28,10)) КАК ДопРасходыБезНДС,
	|
	|	ВЫРАЗИТЬ(
	|		СУММА((ЕСТЬNULL(СтоимостьПартийТоваров.СтоимостьРегл, 0)
	|				+ ЕСТЬNULL(СтоимостьПартийТоваров.ТрудозатратыРегл, 0)
	|				- ЕСТЬNULL(СтоимостьПартийТоваров.РезервПодОбесценениеРегл, 0))
	|		* ЕСТЬNULL(Связи.ВесДугиРегл, 0)) КАК ЧИСЛО(28,10)) КАК ДопРасходыРегл,
	|
	|	ВЫРАЗИТЬ(
	|		СУММА((ЕСТЬNULL(СтоимостьПартийТоваров.СтоимостьУпр, 0)
	|				+ ЕСТЬNULL(СтоимостьПартийТоваров.ТрудозатратыУпр, 0)
	|				- ЕСТЬNULL(СтоимостьПартийТоваров.РезервПодОбесценениеУпр, 0))
	|		* ЕСТЬNULL(Связи.ВесДугиУпр, 0)) КАК ЧИСЛО(28,10)) КАК ДопРасходыУпр
	|
	|ПОМЕСТИТЬ НачальнаяСтоимостьДополнительныхРасходов
	|ИЗ
	|	УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиУзловДополнительныхРасходов КАК Связи
	|		ПО УзлыКорректировки.НомерУзла = Связи.НомерУзлаПриемник
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК СтоимостьПартийТоваров
	|		ПО СтоимостьПартийТоваров.НомерУзла = Связи.НомерУзлаИсточник
	|
	|ГДЕ
	|	НЕ Связи.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ Связи.НомерУзлаИсточник ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	// Узлы
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|
	|	УзлыКорректировки.СтоимостьСНДС
	|		+ ЕСТЬNULL(СтоимостьУзлов.ДопРасходыСНДС, 0)   КАК СтоимостьСНДС,
	|	УзлыКорректировки.СтоимостьБезНДС
	|		+ ЕСТЬNULL(СтоимостьУзлов.ДопРасходыБезНДС, 0) КАК СтоимостьБезНДС,
	|	УзлыКорректировки.СтоимостьРегл
	|		+ ЕСТЬNULL(СтоимостьУзлов.ДопРасходыРегл, 0)   КАК СтоимостьРегл,
	|	УзлыКорректировки.СтоимостьУпр
	|		+ ЕСТЬNULL(СтоимостьУзлов.ДопРасходыУпр, 0)    КАК СтоимостьУпр
	|ИЗ
	|	УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачальнаяСтоимостьДополнительныхРасходов КАК СтоимостьУзлов
	|		ПО УзлыКорректировки.НомерУзла = СтоимостьУзлов.НомерУзла
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла            КАК НомерУзла,
	|	УзлыКорректировки.ДопРасходы           КАК СтоимостьСНДС,
	|	УзлыКорректировки.ДопРасходыБезНДС     КАК СтоимостьБезНДС,
	|	УзлыКорректировки.ДопРасходыРегл       КАК СтоимостьРегл,
	|	УзлыКорректировки.ДопРасходыУпр        КАК СтоимостьУпр
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки";
	
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	//Связи
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиБезНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ПеремещенияСписания.РеализацияВДругуюОрганизацию ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиРегл,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ПеремещенияСписания.РеализацияВДругуюОрганизацию ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиУпр
	|
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Связи.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	Связи.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(-Связи.ВесДугиСНДС КАК ЧИСЛО(28,10))   КАК ВесДугиСНДС,
	|	ВЫРАЗИТЬ(-Связи.ВесДугиБезНДС КАК ЧИСЛО(28,10)) КАК ВесДугиБезНДС,
	|	ВЫРАЗИТЬ(-Связи.ВесДугиРегл КАК ЧИСЛО(28,10))   КАК ВесДугиРегл,
	|	ВЫРАЗИТЬ(-Связи.ВесДугиУпр КАК ЧИСЛО(28,10))    КАК ВесДугиУпр
	|ИЗ
	|	СвязиУзловДополнительныхРасходов КАК Связи
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиБезНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиРегл,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиУпр
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесСНДС КАК ЧИСЛО(28,10)) КАК ВесДугиСНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесБезНДС КАК ЧИСЛО(28,10)) КАК ВесДугиБезНДС,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесРегл КАК ЧИСЛО(28,10)) КАК ВесДугиРегл,
	|	ВЫРАЗИТЬ(УзлыКорректировки.ВесУпр КАК ЧИСЛО(28,10)) КАК ВесДугиУпр
	|ИЗ
	|	УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировки
	|";
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(
		ПараметрыРасчета, Запрос.Текст);
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(
		ПараметрыРасчета, Запрос,,, Истина, 
		ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	#Область РешениеСЛУ
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета,
		"РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьСНДС";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСНДС";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьБезНДС";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиБезНДС";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьРегл";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиРегл";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьУпр";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиУпр";
	// решение
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	#КонецОбласти
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"СтоимостьСНДС, СтоимостьБезНДС, СтоимостьРегл, СтоимостьУпр",
		,
		"РезультатРасчета");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	Запрос = Новый Запрос();
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесСНДС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьСНДС, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьСНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесБезНДС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьБезНДС, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесРегл = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьРегл, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.ВесУпр = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьУпр, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьУпр
	|
	|ПОМЕСТИТЬ ТаблицаРешений
	|ИЗ
	|	УзлыКорректировкиДополнительныхРасходов КАК УзлыКорректировки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РезультатРасчета КАК РезультатРасчета
	|	ПО РезультатРасчета.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьСНДС, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьСНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьБезНДС, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьБезНДС,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьРегл, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РезультатРасчета.СтоимостьУпр, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьУпр
	|
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РезультатРасчета КАК РезультатРасчета
	|	ПО РезультатРасчета.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РезультатРасчета";
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ТаблицаРешений.Очистить();
	
КонецПроцедуры

// Выполняет расчет систем уравнений для показателей:
//	СтоимостьРегл, СтоимостьУпр
//		
// Результатом работы данной процедуры будет временная таблица "ВтТаблицаРешений_СебестоимостьОрганизаций"
//
Процедура РешитьСЛУПлатформой_ВключениеИсключениеНДСОрганизаций(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РешитьСЛУПлатформой_ВключениеИсключениеНДСОрганизаций");
	
	ПояснениеДляЗамера = НСтр("ru = 'Решение для себестоимости организаций'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	#Область Узлы
	
	ЗапросУзлы = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(ЗапросУзлы, ПараметрыРасчета);
	
	ЗапросУзлы.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла        КАК НомерУзла,
	|	УзлыКорректировки.СтоимостьРегл    КАК СтоимостьРегл,
	|	УзлыКорректировки.СтоимостьУпр     КАК СтоимостьУпр
	|ИЗ
	|	УзлыКорректировкиВключениеИсключениеНДС КАК УзлыКорректировки";
	
	#КонецОбласти
	
	#Область Связи
	
	ЗапросСвязи = Новый Запрос();
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(ЗапросСвязи, ПараметрыРасчета);
	
	ЗапросСвязи.Текст = "
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьРегл,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ПеремещенияСписания.ПродукцияДавальца, ЛОЖЬ) ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(-ПеремещенияСписания.ВесДуги, 0)
	|	КОНЕЦ КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьУпр
	|ИЗ
	|	ВтПеремещенияСписания КАК ПеремещенияСписания
	|ГДЕ
	|	НЕ ПеремещенияСписания.НомерУзлаПриемник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.НомерУзлаИсточник ЕСТЬ NULL
	|	И НЕ ПеремещенияСписания.РеализацияВДругуюОрганизацию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаИсточник,
	|	УзлыКорректировки.НомерУзла КАК НомерУзлаПриемник,
	|
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьРегл,
	|	ВЫРАЗИТЬ(УзлыКорректировки.Количество КАК ЧИСЛО(28,10)) КАК ВесДугиСтоимостьУпр
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки";
	ЗапросСвязи.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ЗапросСвязи.Текст);
	
	#КонецОбласти
	
	МатрицаУзлов  = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросУзлы,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'узлы'", ОбщегоНазначения.КодОсновногоЯзыка()));
	МатрицаСвязей = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, ЗапросСвязи,,, Истина, ПояснениеДляЗамера + ", " + НСтр("ru = 'связи'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	#Область РешениеСЛУ
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "РассчитатьСистемыЛинейныхУравнений", ПояснениеДляЗамера);
	РасчетСистемЛинейныхУравнений = ПолучитьКомпонентуДляРешенияСЛУ(ПараметрыРасчета);
	
	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = МатрицаУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = МатрицаСвязей;
	
	// описание ключевых колонок
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУзла";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУзлаПриемник";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерУзлаИсточник";
	
	// описание систем
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьРегл";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьРегл";
	
	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = "СтоимостьУпр";
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "ВесДугиСтоимостьУпр";
	
	// решение
	ТаблицаРешений = РасчетСебестоимостиПрикладныеАлгоритмы.РассчитатьСистемыЛинейныхУравнений(ПараметрыРасчета, РасчетСистемЛинейныхУравнений);
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
	#КонецОбласти
	
	// Загрузка решений во временную таблицу.
	ПараметрыЗагрузкиСЛУ = РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыЗагрузкиРешенияСЛУ(
		"СтоимостьРегл, СтоимостьУпр");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗагрузитьРешениеСЛУВоВременнуюТаблицу(
		ПараметрыРасчета,
		ПараметрыЗагрузкиСЛУ,
		ТаблицаРешений,
		ПояснениеДляЗамера);
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла КАК НомерУзла,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьРегл, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьРегл,
	|
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА УзлыКорректировки.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТаблицаРешений.СтоимостьУпр, 0) КОНЕЦ КАК ЧИСЛО(28,10)) КАК СтоимостьУпр
	|ПОМЕСТИТЬ ВтТаблицаРешений_СебестоимостьОрганизаций
	|ИЗ
	|	ВтУзлыКорректировки КАК УзлыКорректировки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|	ПО ТаблицаРешений.НомерУзла = УзлыКорректировки.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаРешений
	|";
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	ТаблицаРешений.Очистить();
	
КонецПроцедуры


Процедура СохранитьСЛУ(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоВыполненияФрагментаКода(ПараметрыРасчета, "СохранитьСЛУ", "");
		
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Т.НомерУзла), -1) + 1 КАК НомерУзла
	|ИЗ
	|	ВтУзлыКорректировкиСебестоимости КАК Т";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ПервыйНомерУзла = Выборка.НомерУзла;
	
	Запрос.УстановитьПараметр("ПервыйНомерУзла", ПервыйНомерУзла);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УзлыКорректировки.НомерУзла + &ПервыйНомерУзла 	КАК НомерУзла,
	|	УзлыКорректировки.Организация                	КАК Организация,
	|	УзлыКорректировки.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
	|	УзлыКорректировки.РазделУчета                	КАК РазделУчета,
	|	УзлыКорректировки.ВидЗапасов                 	КАК ВидЗапасов,
	|	УзлыКорректировки.Партия					 	КАК Партия,
	|	УзлыКорректировки.АналитикаУчетаПартий		 	КАК АналитикаУчетаПартий,
	|	УзлыКорректировки.АналитикаФинансовогоУчета	 	КАК АналитикаФинансовогоУчета,
	|	УзлыКорректировки.ВидДеятельностиНДС		 	КАК ВидДеятельностиНДС,
	|
	|	УзлыКорректировки.Количество          		 	КАК Вес
	|ПОМЕСТИТЬ ВТТекущиеУзлы
	|ИЗ
	|	ВТУзлыКорректировки КАК УзлыКорректировки
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПеремещенияСписания.НомерУзлаИсточник + &ПервыйНомерУзла КАК НомерУзлаИсточник,
	|	ПеремещенияСписания.НомерУзлаПриемник + &ПервыйНомерУзла КАК НомерУзлаПриемник,
	|	ПеремещенияСписания.ВесДуги                              КАК Вес
	|ПОМЕСТИТЬ ВТТекущиеСвязи
	|ИЗ
	|	ВТПеремещенияСписания КАК ПеремещенияСписания
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУзлыКорректировки КАК УзлыПриемник
	|		ПО УзлыПриемник.НомерУзла = ПеремещенияСписания.НомерУзлаПриемник
	|ГДЕ
	|	НЕ ПеремещенияСписания.РеализацияВДругуюОрганизацию
	|	И НЕ ЕСТЬNULL(УзлыПриемник.РазделУчета, НЕОПРЕДЕЛЕНО) В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение))
	|";
	
	Запрос.Выполнить();
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ОбъединитьВременныеТаблицы(
		ПараметрыРасчета,
		"ВТТекущиеУзлы",
		"ВтУзлыКорректировкиСебестоимости",
		"НомерУзла, Организация, АналитикаУчетаНоменклатуры, РазделУчета, ВидЗапасов,
			|Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, Вес",
		"",
		"НомерУзла",
		Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ОбъединитьВременныеТаблицы(
		ПараметрыРасчета,
		"ВТТекущиеСвязи",
		"ВтСвязиУзловКорректировкиСебестоимости",
		"НомерУзлаИсточник, НомерУзлаПриемник, Вес",
		"",
		"НомерУзлаИсточник",
		Истина);
	
	РасчетСебестоимостиПротоколРасчета.ОкончаниеВыполненияФрагментаКода(ПараметрыРасчета);
	
КонецПроцедуры
//
// Сохраняет временные таблицы, используемые для решения СЛУ, в файлы на диск.
//
Процедура СохранитьСЛУВФайл(ПараметрыРасчета, РасчетСтоимостиРегл = Ложь)
	
	ИмяКаталога = СокрЛП(ПараметрыРасчета.ВыгрузкаДанныхРасчета.КаталогДляСохраненияДанныхСЛУ);
	
	Если НЕ ЗначениеЗаполнено(ИмяКаталога) Тогда
		Возврат; // выгрузка СЛУ не требуется
	КонецЕсли;
	
	Попытка
		ТекстОшибки = "";
		СоздатьКаталог(ИмяКаталога);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ИмяКаталога = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяКаталога);
	Каталог     = Новый Файл(ИмяКаталога);
	
	Если НЕ Каталог.Существует() ИЛИ НЕ Каталог.ЭтоКаталог() Тогда
		
		ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден каталог для сохранения данных СЛУ: ""%1""
				|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
			РасчетСебестоимостиПротоколРасчета.ПредставлениеЗначения(ИмяКаталога),
			ТекстОшибки);
		
		РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
			ТекстДляПротокола);
		
		Возврат; // каталог для выгрузки не найден
		
	КонецЕсли;
	
	ФорматВыгрузки = СокрЛП(НРег(ПараметрыРасчета.ВыгрузкаДанныхРасчета.ФорматСохраненияДанныхСЛУ));
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если ФорматВыгрузки = "mxl" Тогда
		
		// ВтУзлыКорректировки и ВтТаблицаРешений выгружаем в один файл "...Узлы".
		//	- одноименным колонкам этих таблиц присвоим префиксы "Узел" и "Решение" соответственно
		// ВтПеремещенияСписания выгружаем в файл "...Дуги".
		
		ШаблонИмениФайла =
			Формат(ТекущаяДатаСеанса() - Дата(1,1,1), "ЧЦ=12; ЧВН=; ЧГ=")      // дата-время выгрузки
			+ "_" + ?(ПараметрыРасчета.ПредварительныйРасчет, "Предварительный", "Фактический") // какой вид расчета
			+ "_" + ?(РасчетСтоимостиРегл, "Регл", "Упр")					   // какую себестоимость рассчитываем
			+ "_%1.mxl";													   // какую временную таблицу выгружаем
		
		// Получим данные из временных таблиц
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УзлыКорректировки.НомерУзла					 	КАК НомерУзла,
		|	УзлыКорректировки.Организация                	КАК Организация,
		|	УзлыКорректировки.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
		|	УзлыКорректировки.РазделУчета                	КАК РазделУчета,
		|	УзлыКорректировки.ВидЗапасов                 	КАК ВидЗапасов,
		|	УзлыКорректировки.Партия					 	КАК Партия,
		|	УзлыКорректировки.АналитикаУчетаПартий		 	КАК АналитикаУчетаПартий,
		|	УзлыКорректировки.АналитикаФинансовогоУчета	 	КАК АналитикаФинансовогоУчета,
		|	УзлыКорректировки.ВидДеятельностиНДС		 	КАК ВидДеятельностиНДС,
		|
		|	УзлыКорректировки.Количество          		 	КАК Количество,
		|	УзлыКорректировки.Стоимость                     КАК УзелСтоимость,
		|	УзлыКорректировки.СтоимостьБезНДС               КАК УзелСтоимостьБезНДС,
		|	УзлыКорректировки.Трудозатраты                  КАК ТрудозатратыГраф_1,
		|	УзлыКорректировки.СтоимостьЗабалансовая 		КАК УзелСтоимостьЗабалансовая,
		|
		|	СебестоимостьПредприятия.Стоимость              КАК РешениеСтоимость,
		|	СебестоимостьПредприятия.СтоимостьБезНДС        КАК РешениеСтоимостьБезНДС,
		|	СебестоимостьПредприятия.Трудозатраты           КАК РешениеТрудозатраты,
		|	СебестоимостьПредприятия.СтоимостьЗабалансовая 	КАК РешениеСтоимостьЗабалансовая
		|ИЗ
		|	ВТУзлыКорректировки КАК УзлыКорректировки
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений_СебестоимостьПредприятия КАК СебестоимостьПредприятия
		|		ПО СебестоимостьПредприятия.НомерУзла = УзлыКорректировки.НомерУзла
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерУзла
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ПеремещенияСписания.НомерУзлаИсточник 		     КАК НомерУзлаИсточник,
		|	ПеремещенияСписания.НомерУзлаПриемник 		     КАК НомерУзлаПриемник,
		|	ПеремещенияСписания.РеализацияВДругуюОрганизацию КАК РеализацияВДругуюОрганизацию,
		|	ПеремещенияСписания.ВесДуги                      КАК ВесДуги,
		|	ПеремещенияСписания.РаботаДляДавальца            КАК РаботаДляДавальца,
		|	ПеремещенияСписания.ПродукцияДавальца		     КАК ПродукцияДавальца
		|ИЗ
		|	ВТПеремещенияСписания КАК ПеремещенияСписания
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерУзлаПриемник,
		|	НомерУзлаИсточник
		|";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		// Сохраним первый файл
		ТекстДляПротокола = ОбщегоНазначенияУТ.СохранитьТаблицуЗначенийВФайл(
			РезультатЗапроса[0].Выгрузить(),
			ИмяКаталога + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла, "Узлы"));
		
		Если ЗначениеЗаполнено(ТекстДляПротокола) Тогда  // ошибка записи файла
			
			РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
				ПараметрыРасчета,
				Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
				ТекстДляПротокола);
			
		КонецЕсли;
		
		// Сохраним второй файл
		ТекстДляПротокола = ОбщегоНазначенияУТ.СохранитьТаблицуЗначенийВФайл(
			РезультатЗапроса[1].Выгрузить(),
			ИмяКаталога + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла, "Дуги"));
		
		Если ЗначениеЗаполнено(ТекстДляПротокола) Тогда
			
			РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
				ПараметрыРасчета,
				Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
				ТекстДляПротокола);
			
		КонецЕсли;
		
	ИначеЕсли ФорматВыгрузки = "csv" Тогда
		// ВтУзлыКорректировки - свободные члены
		// ВтПеремещенияСписания - коэффициенты; НомерУзлаИсточник - № уравнения, НомерУзлаПриемник - № элемента
		//
		// СЛУ из n неизвестных:
		// А(1,1)*Х1 + А(1,2)*Х2 + ... А(1,n)*Xn = B1
		// А(2,1)*Х1 + А(2,2)*Х2 + ... А(2,n)*Xn = B2
		// ...
		// А(n,1)*Х1 + А(n,2)*Х2 + ... А(n,n)*Xn = Bn
		//
		// Формат строки файла CSV:
		// <Свободный коэффициент В>[,(<Номер неизвестного X>, <Коэффициент А>)]
		// Для каждого уравнения обязательно есть строка, при этом порядковый номер строки = номеру уравнения
		
		ФайлСЛУ = Новый ТекстовыйДокумент;
		
		ШаблонИмениФайла =
			Формат(ТекущаяДатаСеанса() - Дата(1,1,1), "ЧЦ=12; ЧВН=; ЧГ=")      // дата-время выгрузки
			+ "_" + ?(ПараметрыРасчета.ПредварительныйРасчет, "Предв", "Факт") // какой вид расчета
			+ "_" + ?(РасчетСтоимостиРегл, "Регл", "Упр")					   // какую себестоимость рассчитываем
			+ "_СЛУ.csv";													   // какую временную таблицу выгружаем
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НомераУравнения.НомерУзла КАК НомерУравнения,
		|	ЕСТЬNULL(Коэффициенты.НомерУзлаПриемник, 0) КАК НомерНеизвестного,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(Коэффициенты.ВесДуги, 0) КАК ЧИСЛО(28,10)) КАК КоэффициентНеизвестного,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА НомераУравнения.Количество = 0
		|				ТОГДА 0
		|			КОГДА ЕСТЬNULL(Коэффициенты.ПродукцияДавальца, ЛОЖЬ)
		|				ТОГДА 0
		|			ИНАЧЕ НомераУравнения.Стоимость
		|		КОНЕЦ КАК ЧИСЛО(28,10)) КАК СвободныйКоэффициент
		|ИЗ
		|	ВтУзлыКорректировки КАК НомераУравнения
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтПеремещенияСписания КАК Коэффициенты
		|		ПО НомераУравнения.НомерУзла = Коэффициенты.НомерУзлаИсточник
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерУравнения,
		|	НомерНеизвестного
		|ИТОГИ
		|	МИНИМУМ(СвободныйКоэффициент)
		|ПО
		|	НомерУравнения";
		
		Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
		
		ВыборкаУравнений = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУравнений.Следующий() Цикл
			
			СтрокаФайла = СокрЛП(Формат(ВыборкаУравнений.СвободныйКоэффициент, "ЧРД=.; ЧН=0; ЧГ=0"));
			
			ВыборкаНеизвестных = ВыборкаУравнений.Выбрать();
			
			Пока ВыборкаНеизвестных.Следующий() Цикл
				
				Если ВыборкаНеизвестных.НомерНеизвестного = NULL Тогда
					Прервать; // в этом уравнении нет ненулевых коэффициентов
				КонецЕсли;
				
				// <Свободный коэффициент В>[,(<Номер неизвестного X>, <Коэффициент А>)]
				СтрокаФайла = СтрокаФайла
					+ ",("
					+ СокрЛП(Формат(ВыборкаНеизвестных.НомерНеизвестного, "ЧДЦ=; ЧН=0; ЧГ=0"))
					+ ","
					+ СокрЛП(Формат(ВыборкаНеизвестных.КоэффициентНеизвестного, "ЧРД=.; ЧН=0; ЧГ=0"))
					+ ")";
				
			КонецЦикла;
			
			ФайлСЛУ.ДобавитьСтроку(СтрокаФайла);
			
		КонецЦикла;
		
		Попытка
			ФайлСЛУ.Записать(ИмяКаталога + ШаблонИмениФайла);
		Исключение
			
			ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать файл ""%1""
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				ИмяКаталога + ШаблонИмениФайла,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
				ПараметрыРасчета,
				Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
				ТекстДляПротокола);
			
		КонецПопытки;
		
	Иначе
		
		ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный формат выгрузки СЛУ: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ФорматВыгрузки);
		
		РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
			ТекстДляПротокола);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Формирование таблицы ВтСтоимостьПартийТоваров

#Область ПроцедурыЭтапов_ЗарегистрироватьСтоимость

Процедура ОбновитьСтоимостьПартийТоваров_МатериальныеИТрудозатраты(ПараметрыРасчета)

	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ОбновитьСтоимостьПартийТоваров_МатериальныеИТрудозатраты");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО                                 КАК ДокументДвижения,
		|	&НачалоПериода                               КАК Период,
		|	СтоимостьПартийТоваров.НомерУзла                  КАК НомерУзла,
		// Измерения
		|	СтоимостьПартийТоваров.Организация                КАК Организация,
		|	СтоимостьПартийТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	СтоимостьПартийТоваров.ВидЗапасов                 КАК ВидЗапасов,
		|	СтоимостьПартийТоваров.РазделУчета                КАК РазделУчета,
		|	СтоимостьПартийТоваров.Партия                     КАК Партия,
		|	СтоимостьПартийТоваров.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
		|	СтоимостьПартийТоваров.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
		|	СтоимостьПартийТоваров.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
		// Ресурсы
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьПредприятия.Стоимость, 0) КАК ЧИСЛО(28,10))                 КАК Стоимость,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьПредприятия.СтоимостьБезНДС, 0) КАК ЧИСЛО(28,10))           КАК СтоимостьБезНДС,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьПредприятия.СтоимостьЗабалансовая, 0) КАК ЧИСЛО(28,10))     КАК СтоимостьЗабалансовая,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК СтоимостьДопРасходы,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК СтоимостьДопРасходыБезНДС,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьПредприятия.Трудозатраты, 0) КАК ЧИСЛО(28,10))              КАК Трудозатраты,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеСНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеСНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеБезНДС,
		|
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьОрганизаций.СтоимостьРегл, 0) КАК ЧИСЛО(28,10))             КАК СтоимостьРегл,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьОрганизаций.СтоимостьЗабалансоваяРегл, 0) КАК ЧИСЛО(28,10)) КАК СтоимостьЗабалансоваяРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ДопРасходыРегл,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьОрганизаций.ТрудозатратыРегл, 0) КАК ЧИСЛО(28,10))          КАК ТрудозатратыРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостояннаяРазница,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ВременнаяРазница,
		|	СтоимостьПартийТоваров.РезервПодОбесценениеРегл                                            КАК РезервПодОбесценениеРегл,
		|
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьОрганизаций.СтоимостьУпр, 0) КАК ЧИСЛО(28,10))              КАК СтоимостьУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ДопРасходыУпр,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьОрганизаций.ТрудозатратыУпр, 0) КАК ЧИСЛО(28,10))           КАК ТрудозатратыУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеУпр,
		|	СтоимостьПартийТоваров.РезервПодОбесценениеУпр                                             КАК РезервПодОбесценениеУпр
		|
		|ПОМЕСТИТЬ СтоимостьПартийТоваровПредварительная
		|ИЗ
		|	ВТСтоимостьПартийТоваров КАК СтоимостьПартийТоваров
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений_СебестоимостьПредприятия КАК СебестоимостьПредприятия
		|		ПО СебестоимостьПредприятия.НомерУзла = СтоимостьПартийТоваров.НомерУзла
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений_СебестоимостьОрганизаций КАК СебестоимостьОрганизаций
		|		ПО СебестоимостьОрганизаций.НомерУзла = СтоимостьПартийТоваров.НомерУзла
		|;
		|/////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
		|ИЗ
		|	СтоимостьПартийТоваровПредварительная КАК СтоимостьПартийТоваров
		|;
		|";
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, 
		"СтоимостьПартийТоваровПредварительная");
		
	// Добавим в протокол информацию об узлах с переполнением поля
	СтрокаПротокола = "";
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Организация,
	|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Т.Партия КАК Партия,
	|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС
	|ИЗ
	|	ВТСтоимостьПартийТоваров КАК Т
	|ГДЕ
	|	Т.НомерУзла В (&УзлыСПереполнениемПоля)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	Партия,
	|	ВидДеятельностиНДС
	|";
	
	Запрос.УстановитьПараметр("УзлыСПереполнениемПоля", ПараметрыРасчета.УзлыСПереполнениемПоля);
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаПротокола = СтрокаПротокола + ?(СтрокаПротокола = "", "", Символы.ПС)
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Организация: ""%1"", Аналитика номенклатуры: ""%2"", Партия: ""%3"", Вид деятельности НДС: ""%4"",'"),
				Выборка.Организация,
				Выборка.АналитикаУчетаНоменклатуры,
				Выборка.Партия,
				Выборка.ВидДеятельностиНДС);
				
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПротокола) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПротокола =
		НСтр("ru='Стоимость некоторых аналитик номенклатуры не может быть рассчитана при решении СЛУ.
			|Возможные причины: превышение расходов над приходами и начальными остатками или зацикливание движений.'")
		+ Символы.ПС + СтрокаПротокола;
	
	РасчетСебестоимостиПротоколРасчета.ДополнительнаяИнформация(ПараметрыРасчета, СтрокаПротокола);
		
КонецПроцедуры

Процедура ОбновитьСтоимостьПартийТоваров_ДополнительныеРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ОбновитьСтоимостьПартийТоваров_ДополнительныеРасходы");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО                                     КАК ДокументДвижения,
	|	&НачалоПериода                                   КАК Период,
	|	СтоимостьПартийТоваров.НомерУзла                 КАК НомерУзла,
	// Измерения
	|	СтоимостьПартийТоваров.Организация                КАК Организация,
	|	СтоимостьПартийТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьПартийТоваров.ВидЗапасов                 КАК ВидЗапасов,
	|	СтоимостьПартийТоваров.РазделУчета                КАК РазделУчета,
	|	СтоимостьПартийТоваров.Партия                     КАК Партия,
	|	СтоимостьПартийТоваров.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|	СтоимостьПартийТоваров.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	СтоимостьПартийТоваров.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	// Ресурсы
	|	СтоимостьПартийТоваров.Стоимость                                        КАК Стоимость,
	|	СтоимостьПартийТоваров.СтоимостьБезНДС                                  КАК СтоимостьБезНДС,
	|	СтоимостьПартийТоваров.СтоимостьЗабалансовая                            КАК СтоимостьЗабалансовая,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьСНДС, 0) КАК ЧИСЛО(28,10))    КАК СтоимостьДопРасходы,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьБезНДС, 0) КАК ЧИСЛО(28,10))  КАК СтоимостьДопРасходыБезНДС,
	|	СтоимостьПартийТоваров.Трудозатраты                                     КАК Трудозатраты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПостоянныеСНДС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПеременныеСНДС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПеременныеБезНДС,
	|
	|	СтоимостьПартийТоваров.СтоимостьРегл                                    КАК СтоимостьРегл,
	|	СтоимостьПартийТоваров.СтоимостьЗабалансоваяРегл                        КАК СтоимостьЗабалансоваяРегл,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьРегл, 0) КАК ЧИСЛО(28,10))    КАК ДопРасходыРегл,
	|	СтоимостьПартийТоваров.ТрудозатратыРегл                                 КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПостоянныеРегл,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПеременныеРегл,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ВременнаяРазница,
	|	СтоимостьПартийТоваров.РезервПодОбесценениеРегл                         КАК РезервПодОбесценениеРегл,
	|
	|	СтоимостьПартийТоваров.СтоимостьУпр                                     КАК СтоимостьУпр,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьУпр, 0) КАК ЧИСЛО(28,10))     КАК ДопРасходыУпр,
	|	СтоимостьПартийТоваров.ТрудозатратыУпр                                  КАК ТрудозатратыУпр,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПостоянныеУпр,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                           КАК ПостатейныеПеременныеУпр,
	|	СтоимостьПартийТоваров.РезервПодОбесценениеУпр                          КАК РезервПодОбесценениеУпр
	|
	|ПОМЕСТИТЬ СтоимостьПартийТоваровПредварительная
	|ИЗ
	|	ВТСтоимостьПартийТоваров КАК СтоимостьПартийТоваров
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|		ПО ТаблицаРешений.НомерУзла = СтоимостьПартийТоваров.НомерУзла
	|;
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
	|ИЗ
	|	СтоимостьПартийТоваровПредварительная КАК СтоимостьПартийТоваров
	|;
	|";
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, 
		"СуммыРасходов, СтоимостьПартийТоваровПредварительная");
	
КонецПроцедуры

Процедура ЗарегистрироватьСтоимость_ДополнительныеРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимость_ДополнительныеРасходы");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Узлы.НомерУзла,
	// Измерения
	|	Узлы.Организация,
	|	Узлы.Подразделение,
	|	Узлы.НаправлениеДеятельности,
	|	Узлы.СтатьяРасходов,
	|	Узлы.АналитикаРасходов,
	// Ресурсы
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьСНДС, 0) КАК ЧИСЛО(28,10))    КАК СтоимостьСНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьБезНДС, 0) КАК ЧИСЛО(28,10))  КАК СтоимостьБезНДС,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьРегл, 0) КАК ЧИСЛО(28,10))    КАК СтоимостьРегл,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаРешений.СтоимостьУпр, 0) КАК ЧИСЛО(28,10))     КАК СтоимостьУпр
	|ПОМЕСТИТЬ СтоимостьДополнительныхРасходов
	|ИЗ
	|	УзлыКорректировкиДополнительныхРасходов КАК Узлы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|		ПО ТаблицаРешений.НомерУзла = Узлы.НомерУзла
	|";
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

Процедура ОбновитьСтоимостьПартийТоваров_ВключениеИсключениеНДС(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ЗарегистрироватьСтоимость_ВключениеИсключениеНДС");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО                                     КАК ДокументДвижения,
	|	&НачалоПериода                                   КАК Период,
	|	СтоимостьПартийТоваров.НомерУзла                 КАК НомерУзла,
	// Измерения
	|	СтоимостьПартийТоваров.Организация                КАК Организация,
	|	СтоимостьПартийТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СтоимостьПартийТоваров.ВидЗапасов                 КАК ВидЗапасов,
	|	СтоимостьПартийТоваров.РазделУчета                КАК РазделУчета,
	|	СтоимостьПартийТоваров.Партия                     КАК Партия,
	|	СтоимостьПартийТоваров.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
	|	СтоимостьПартийТоваров.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
	|	СтоимостьПартийТоваров.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
	// Ресурсы
	|	СтоимостьПартийТоваров.Стоимость                                                  КАК Стоимость,
	|	СтоимостьПартийТоваров.СтоимостьБезНДС                                            КАК СтоимостьБезНДС,
	|	СтоимостьПартийТоваров.СтоимостьЗабалансовая                                      КАК СтоимостьЗабалансовая,
	|	СтоимостьПартийТоваров.СтоимостьДопРасходы                                        КАК СтоимостьДопРасходы,
	|	СтоимостьПартийТоваров.СтоимостьДопРасходыБезНДС                                  КАК СтоимостьДопРасходыБезНДС,
	|	СтоимостьПартийТоваров.Трудозатраты                                               КАК Трудозатраты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПостоянныеСНДС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПостоянныеБезНДС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПеременныеСНДС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПеременныеБезНДС,
	|
	|	ВЫРАЗИТЬ(СтоимостьПартийТоваров.СтоимостьРегл
	|		+ ЕСТЬNULL(СебестоимостьОрганизаций.СтоимостьРегл, 0) КАК ЧИСЛО(28,10))       КАК СтоимостьРегл,
	|	СтоимостьПартийТоваров.СтоимостьЗабалансоваяРегл                                  КАК СтоимостьЗабалансоваяРегл,
	|	СтоимостьПартийТоваров.ДопРасходыРегл                                             КАК ДопРасходыРегл,
	|	СтоимостьПартийТоваров.ТрудозатратыРегл                                           КАК ТрудозатратыРегл,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПостоянныеРегл,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПеременныеРегл,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостояннаяРазница,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ВременнаяРазница,
	|	СтоимостьПартийТоваров.РезервПодОбесценениеРегл                                   КАК РезервПодОбесценениеРегл,
	|
	|	ВЫРАЗИТЬ(СтоимостьПартийТоваров.СтоимостьУпр
	|		+ ЕСТЬNULL(СебестоимостьОрганизаций.СтоимостьУпр, 0) КАК ЧИСЛО(28,10))        КАК СтоимостьУпр,
	|	СтоимостьПартийТоваров.ДопРасходыУпр                                              КАК ДопРасходыУпр,
	|	СтоимостьПартийТоваров.ТрудозатратыУпр                                            КАК ТрудозатратыУпр,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПостоянныеУпр,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                     КАК ПостатейныеПеременныеУпр,
	|	СтоимостьПартийТоваров.РезервПодОбесценениеУпр                                    КАК РезервПодОбесценениеУпр
	|
	|ПОМЕСТИТЬ СтоимостьПартийТоваровПредварительная
	|ИЗ
	|	ВТСтоимостьПартийТоваров КАК СтоимостьПартийТоваров
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаРешений_СебестоимостьОрганизаций КАК СебестоимостьОрганизаций
	|		ПО СебестоимостьОрганизаций.НомерУзла = СтоимостьПартийТоваров.НомерУзла
	|;
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
	|ИЗ
	|	СтоимостьПартийТоваровПредварительная КАК СтоимостьПартийТоваров";
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, 
		"УзлыКорректировкиВключениеИсключениеНДС, ВтТаблицаРешений_СебестоимостьОрганизаций,
		|СтоимостьПартийТоваровПредварительная");
	
КонецПроцедуры

Процедура СформироватьСтоимостьПартийТоваров_РезервыПодОбесценениеЗапасов(ПараметрыРасчета)
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "СформироватьСтоимостьПартийТоваров_РезервыПодОбесценениеЗапасов");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиКорректировкаСтоимости.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО                                 КАК ДокументДвижения,
		|	&НачалоПериода                               КАК Период,
		|	УзлыКорректировки.НомерУзла                  КАК НомерУзла,
		// Измерения
		|	УзлыКорректировки.Организация                КАК Организация,
		|	УзлыКорректировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	УзлыКорректировки.ВидЗапасов                 КАК ВидЗапасов,
		|	УзлыКорректировки.РазделУчета                КАК РазделУчета,
		|	УзлыКорректировки.Партия                     КАК Партия,
		|	УзлыКорректировки.АналитикаУчетаПартий       КАК АналитикаУчетаПартий,
		|	УзлыКорректировки.АналитикаФинансовогоУчета  КАК АналитикаФинансовогоУчета,
		|	УзлыКорректировки.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
		// Ресурсы
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))                                                               КАК Стоимость,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))                                                               КАК СтоимостьБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))                                                               КАК СтоимостьЗабалансовая,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК СтоимостьДопРасходы,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК СтоимостьДопРасходыБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))                                                               КАК Трудозатраты,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеСНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеБезНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеСНДС,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеБезНДС,
		|
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК СтоимостьРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))                                                               КАК СтоимостьЗабалансоваяРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ДопРасходыРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))                                                               КАК ТрудозатратыРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеРегл,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостояннаяРазница,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ВременнаяРазница,
		|	ВЫРАЗИТЬ(&РезервПодОбесценениеРегл КАК ЧИСЛО(28,10))                                       КАК РезервПодОбесценениеРегл,
		|
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК СтоимостьУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ДопРасходыУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(28,10))                                                               КАК ТрудозатратыУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПостоянныеУпр,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО (28,10))                                                              КАК ПостатейныеПеременныеУпр,
		|	ВЫРАЗИТЬ(&РезервПодОбесценениеУпр КАК ЧИСЛО(28,10))                                        КАК РезервПодОбесценениеУпр
		|ПОМЕСТИТЬ ВТСтоимостьПартийТоваров
		|ИЗ
		|	ВтУзлыКорректировки КАК УзлыКорректировки
		|";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РезервПодОбесценениеРегл", "0");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РезервПодОбесценениеУпр", "0");
	
	Запрос.Текст = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, Запрос.Текст);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос);
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыЭтапа_ПодготовкаДанныхДляСтоимостиТоваров

// Этап "ПодготовкаДанныхДляСтоимостиТоваров"
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура ПодготовкаДанныхДляСтоимостиТоваров(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ПодготовкаДанныхДляСтоимостиТоваров");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыСведений.СтоимостьТоваров.Имя);
		
	ПараметрыРасчета.Вставить("ИдетРасчетСебестоимости", Истина);
		
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляСтоимостиТоваров(ПараметрыРасчета));
		
	ПараметрыРасчета.Вставить("ИдетРасчетСебестоимости", Ложь);
		
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру сведений СтоимостьТоваров.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстЗапросаДляСтоимостиТоваров(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// подготовка временных таблиц
		+ ТекстВТОборотыКоличествоСПартиями()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете() + ТекстВТОборотыКоличествоБезПартий()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
		// выборка данных
		+ ТекстОписаниеДанныхДляСтоимостиТоваров() 
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстСтоимостьТоваров()
		+ "";
	
	Если ПараметрыРасчета <> Неопределено Тогда
		ТекстЗапроса = РасчетСебестоимостиКорректировкаСтоимости.УстановитьРазрядностьЧиселВТекстеЗапроса(ПараметрыРасчета, ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... формирования временные таблиц

Функция ТекстВТОборотыКоличествоСПартиями()
	Возврат "
		|ВЫБРАТЬ
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС,
		|	ВЫБОР
		|		КОГДА Т.КоличествоРасход <> 0 ТОГДА Т.КоличествоРасход
		|		ИНАЧЕ Т.КоличествоОстаток
		|	КОНЕЦ КАК Количество
		|ПОМЕСТИТЬ ВТОборотыКоличествоСПартиями
		|ИЗ
		|(ВЫБРАТЬ
		|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
		|	ДанныеПоКоличеству.РазделУчета,
		|	ДанныеПоКоличеству.ВидЗапасов,
		|	ДанныеПоКоличеству.Организация,
		|	ДанныеПоКоличеству.Партия,
		|	ДанныеПоКоличеству.АналитикаУчетаПартий,
		|	ДанныеПоКоличеству.АналитикаФинансовогоУчета,
		|	ДанныеПоКоличеству.ВидДеятельностиНДС,
		|	СУММА(ДанныеПоКоличеству.КоличествоРасход)  КАК КоличествоРасход,
		|	СУММА(ДанныеПоКоличеству.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		Обороты.АналитикаУчетаНоменклатуры,
		|		Обороты.РазделУчета КАК РазделУчета,
		|		Обороты.ВидЗапасов,
		|		Обороты.Организация,
		|		Обороты.Партия,
		|		Обороты.АналитикаУчетаПартий,
		|		Обороты.АналитикаФинансовогоУчета,
		|		Обороты.ВидДеятельностиНДС,
		|		Обороты.Количество 	КАК КоличествоРасход,
		|		0 					КАК КоличествоОстаток
		|	ИЗ
		|		ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Обороты
		|	ГДЕ
		|		НЕ Обороты.СлужебноеВидДвиженияПриход
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Остатки.АналитикаУчетаНоменклатуры,
		|		Остатки.РазделУчета,
		|		Остатки.ВидЗапасов,
		|		Остатки.Организация,
		|		Остатки.Партия,
		|		Остатки.АналитикаУчетаПартий,
		|		Остатки.АналитикаФинансовогоУчета,
		|		Остатки.ВидДеятельностиНДС,
		|		0 					КАК КоличествоРасход,
		|		Остатки.Количество 	КАК КоличествоОстаток
		|	ИЗ
		|		ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК Остатки
		|	) КАК ДанныеПоКоличеству
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоКоличеству.АналитикаУчетаНоменклатуры,
		|	ДанныеПоКоличеству.Организация,
		|	ДанныеПоКоличеству.ВидЗапасов,
		|	ДанныеПоКоличеству.РазделУчета,
		|	ДанныеПоКоличеству.Партия,
		|	ДанныеПоКоличеству.АналитикаУчетаПартий,
		|	ДанныеПоКоличеству.АналитикаФинансовогоУчета,
		|	ДанныеПоКоличеству.ВидДеятельностиНДС
		|) КАК Т
		|";
КонецФункции

Функция ТекстВТОборотыКоличествоБезПартий() // использует ВТОборотыКоличествоСПартиями
	Возврат "
		|ВЫБРАТЬ
		|	Обороты.АналитикаУчетаНоменклатуры,
		|	Обороты.РазделУчета,
		|	Обороты.ВидЗапасов,
		|	Обороты.Организация,
		|	СУММА(Обороты.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТОборотыКоличествоБезПартий
		|ИЗ
		|	ВТОборотыКоличествоСПартиями КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.АналитикаУчетаНоменклатуры,
		|	Обороты.РазделУчета,
		|	Обороты.ВидЗапасов,
		|	Обороты.Организация
		|
		|ИМЕЮЩИЕ
		|	СУММА(Обороты.Количество) <> 0
		|";
КонецФункции

Функция ТекстОписаниеДанныхДляСтоимостиТоваров()
	
	ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	СтоимостьТоваров.Регистратор,
		|	СтоимостьТоваров.Период,
		|
		|	СтоимостьТоваров.Организация,
		|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СтоимостьТоваров.ВидЗапасов,
		|	СтоимостьТоваров.РазделУчета,
		|
		|	0 КАК Стоимость,
		|	0 КАК СтоимостьБезНДС,
		|	0 КАК СтоимостьЗабалансовая,
		|	0 КАК СтоимостьДопРасходы,
		|	0 КАК СтоимостьДопРасходыБезНДС,
		|	0 КАК Трудозатраты,
		|	0 КАК ПостатейныеПостоянныеСНДС,
		|	0 КАК ПостатейныеПостоянныеБезНДС,
		|	0 КАК ПостатейныеПеременныеСНДС,
		|	0 КАК ПостатейныеПеременныеБезНДС,
		|	0 КАК СтоимостьРегл,
		|	0 КАК СтоимостьЗабалансоваяРегл,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ТрудозатратыРегл,
		|	0 КАК ПостатейныеПостоянныеРегл,
		|	0 КАК ПостатейныеПеременныеРегл,
		|	0 КАК СтоимостьУпр,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК ТрудозатратыУпр,
		|	0 КАК ПостатейныеПостоянныеУпр,
		|	0 КАК ПостатейныеПеременныеУпр
		|
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрСведений.СтоимостьТоваров КАК СтоимостьТоваров
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстСтоимостьТоваров() // использует ВТОборотыКоличествоСПартиями, ВТОборотыКоличествоБезПартий
	Возврат "
		|ВЫБРАТЬ
		|	ДокументыРасчетаСебестоимости.Ссылка													КАК Регистратор,
		|	&НачалоПериода 																			КАК Период,
		|
		|	СтоимостьТоваров.Организация 															КАК Организация,
		|	СтоимостьТоваров.АналитикаУчетаНоменклатуры 											КАК АналитикаУчетаНоменклатуры,
		|	СтоимостьТоваров.ВидЗапасов 															КАК ВидЗапасов,
		|	СтоимостьТоваров.РазделУчета 															КАК РазделУчета,
		|
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.Стоимость * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК Стоимость,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьБезНДС * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьБезНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансовая * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьЗабалансовая,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходы * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьДопРасходы,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьДопРасходыБезНДС * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьДопРасходыБезНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.Трудозатраты * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК Трудозатраты,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеСНДС * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеСНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеБезНДС * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеБезНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеСНДС * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеСНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеБезНДС * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеБезНДС,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьРегл * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьЗабалансоваяРегл * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьЗабалансоваяРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостояннаяРазница * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостояннаяРазница,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ВременнаяРазница * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ВременнаяРазница,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ДопРасходыРегл * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ДопРасходыРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ТрудозатратыРегл * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ТрудозатратыРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеРегл * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеРегл * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеРегл,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.СтоимостьУпр * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК СтоимостьУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ДопРасходыУпр * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ДопРасходыУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ТрудозатратыУпр * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ТрудозатратыУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПостоянныеУпр * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПостоянныеУпр,
		|	СУММА(
		|		ВЫРАЗИТЬ(СтоимостьТоваров.ПостатейныеПеременныеУпр * ОборотыСПартиями.Количество
		|				 / Обороты.Количество КАК ЧИСЛО(31,10)))									КАК ПостатейныеПеременныеУпр
		|ИЗ
		|	ВТСтоимостьПартийТоваров КАК СтоимостьТоваров
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРасчетаСебестоимости КАК ДокументыРасчетаСебестоимости
		|		ПО СтоимостьТоваров.Организация = ДокументыРасчетаСебестоимости.Организация
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОборотыКоличествоСПартиями КАК ОборотыСПартиями
		|		ПО ОборотыСПартиями.АналитикаУчетаНоменклатуры  = СтоимостьТоваров.АналитикаУчетаНоменклатуры
		|		И ОборотыСПартиями.РазделУчета 					= СтоимостьТоваров.РазделУчета
		|		И ОборотыСПартиями.ВидЗапасов 					= СтоимостьТоваров.ВидЗапасов
		|		И ОборотыСПартиями.Организация 					= СтоимостьТоваров.Организация
		|		И (ОборотыСПартиями.Партия 						= СтоимостьТоваров.Партия
		|			ИЛИ &РегламентноеЗадание)
		|		И (ОборотыСПартиями.АналитикаУчетаПартий 		= СтоимостьТоваров.АналитикаУчетаПартий
		|			ИЛИ &РегламентноеЗадание)
		|		И (ОборотыСПартиями.АналитикаФинансовогоУчета 	= СтоимостьТоваров.АналитикаФинансовогоУчета
		|			ИЛИ &РегламентноеЗадание)
		|		И (ОборотыСПартиями.ВидДеятельностиНДС 			= СтоимостьТоваров.ВидДеятельностиНДС
		|			ИЛИ &РегламентноеЗадание)
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОборотыКоличествоБезПартий КАК Обороты
		|		ПО Обороты.АналитикаУчетаНоменклатуры   = СтоимостьТоваров.АналитикаУчетаНоменклатуры
		|		И Обороты.РазделУчета 					= СтоимостьТоваров.РазделУчета
		|		И Обороты.ВидЗапасов 					= СтоимостьТоваров.ВидЗапасов
		|		И Обороты.Организация 					= СтоимостьТоваров.Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыРасчетаСебестоимости.Ссылка,
		|	СтоимостьТоваров.АналитикаУчетаНоменклатуры,
		|	СтоимостьТоваров.РазделУчета,
		|	СтоимостьТоваров.ВидЗапасов,
		|	СтоимостьТоваров.Организация
		|";
КонецФункции

#КонецОбласти

#Область Тестирование

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСПодготовкойДанныхДляСледующихЭтапов(СписокЭтапов) Экспорт
	
	СписокЭтапов.Добавить("ПодготовкаДанныхДляРешенияСЛУ");
	СписокЭтапов.Добавить("ПодготовкаДанныхДляРешенияСЛУ_ДополнительныеРасходы");
	
КонецПроцедуры

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСТрансляциейПартий(СписокЭтапов) Экспорт
	
	СписокЭтапов.Добавить("ПодготовкаДанныхДляСтоимостиТоваров");
	
КонецПроцедуры

Процедура ТекстЗапросаДляРасчетаЭтапа(ИмяЭтапа, ПараметрыРасчета, ТекстЗапроса) Экспорт
	
	Если ИмяЭтапа = "ПодготовкаДанныхДляРешенияСЛУ" Тогда
		ТекстЗапроса = ТекстЗапросаДляРешенияСЛУ(ПараметрыРасчета);
	ИначеЕсли ИмяЭтапа = "ПодготовкаДанныхДляРешенияСЛУ_РезервыПодОбесценениеЗапасов" Тогда
		ТекстЗапроса = ТекстДляРешенияСЛУ_РезервыПодОбесценениеЗапасов(ПараметрыРасчета);
	ИначеЕсли ИмяЭтапа = "ПодготовкаДанныхДляРешенияСЛУ_ДополнительныеРасходы" Тогда
		ТекстЗапроса = ТекстДляРешенияСЛУ_ДополнительныеРасходы(ПараметрыРасчета);
	ИначеЕсли ИмяЭтапа = "ПодготовкаДанныхДляСтоимостиТоваров" Тогда
		ТекстЗапроса = ТекстЗапросаДляСтоимостиТоваров(ПараметрыРасчета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
