#Область ПрограммныйИнтерфейс

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// см. ОбщийМодуль.УправлениеДоступомПереопределяемый.ЗаполнитьПоставляемыеПрофилиГруппДоступа()
//
Процедура ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
		
	ИндексПрофилей = ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	//++ Локализация
	
	#Область Дополнить_профиль_СупервайзерТорговыхПредставителей
	ОписаниеПрофиля = НайтиПрофиль("СупервайзерТорговыхПредставителей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "СупервайзерТорговыхПредставителей");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		
		// Дополнительные права
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
		
		// Документы, чтение.
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
		
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_Маркетолог
	ОписаниеПрофиля = НайтиПрофиль("Маркетолог", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
	
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Маркетолог");
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_РуководительОтделаПродаж
	ОписаниеПрофиля = НайтиПрофиль("РуководительОтделаПродаж", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "РуководительОтделаПродаж");

		// Справочники, чтение.

		// Документы, чтение.
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");

		// Дополнительные права
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_МенеджерПоПродажам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоПродажам", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоПродажам");
		// Документы, чтение.
		
		// Документы, добавление изменение.
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийКлиентам");
		
		// Отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПоискЗапросовКоммерческихПредложений");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляЯндексКассы");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Кассир
	ОписаниеПрофиля = НайтиПрофиль("Кассир", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Кассир");
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		
		// Документы, чтение.

		// Документы, создание.
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Казначей
	ОписаниеПрофиля = НайтиПрофиль("Казначей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда
		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Казначей");
		// Нормативно-справочная информация
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
		
		// Документы чтение
		
		// Добавление документы.

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовСЯндексКассой");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОперацийПоЯндексКассе");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовСЯндексКассой");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменСБанками");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
			
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоОбеспечениюПотребностей
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоОбеспечениюПотребностей", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоОбеспечениюПотребностей");
		// Нормативно-справочная информация
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
		
		// БизнесСеть.КоммерческиеПредложения
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ФинансовыйАналитик
	ОписаниеПрофиля = НайтиПрофиль("ФинансовыйАналитик", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ФинансовыйАналитик");
		// Прикладные роли
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		
		// Документы, чтение
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомитента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНаНеподтвержденнуюРеализацию0");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Кладовщик
	ОписаниеПрофиля = НайтиПрофиль("Кладовщик", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Кладовщик");

		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// Регистры, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоЗакупкам
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоЗакупкам", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоЗакупкам");

		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
		
		// БизнесСеть.КоммерческиеПредолжения
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросыКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОснованияЭДОПоЗапросамКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложенийПоставщиков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");

		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");

		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомитента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявленийОВвозеТоваров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_Клиент
	ОписаниеПрофиля = НайтиПрофиль("Клиент", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "Клиент");

		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеПартнеров
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеПартнеров", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ОтветственныйЗаВедениеПартнеров");

	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_ОтветственныйЗаВедениеНоменклатуры
	ОписаниеПрофиля = НайтиПрофиль("ОтветственныйЗаВедениеНоменклатуры", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ОтветственныйЗаВедениеНоменклатуры");
		
		// отчеты, обработки
		ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаПересеченияШтрихкодовНоменклатурыСоСпецКодами");
	КонецЕсли;

	#КонецОбласти

	#Область Дополнить_профиль_РаботникСклада
	ОписаниеПрофиля = НайтиПрофиль("РаботникСклада", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "РаботникСклада");

	КонецЕсли;
	#КонецОбласти

	#Область Дополнить_профиль_МенеджерПоДоставке
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоДоставке", ОписанияПрофилей, ИндексПрофилей);	
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоДоставке");
		
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
		
		// ЛокализацияУчета
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
		
		// Дополнительные права.
		ОписаниеПрофиля.Роли.Добавить("ОтправкаЗаказовНаДоставкуПеревозчикуСервисДоставки");
		
		
		// EDI
		СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_ПродавецКассирККМ
	ОписаниеПрофиля = НайтиПрофиль("ПродавецКассирККМ", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ПродавецКассирККМ");

	КонецЕсли;
	#КонецОбласти
	
	
	#Область Дополнить_профиль_МенеджерПоРозничнойТорговле
	ОписаниеПрофиля = НайтиПрофиль("МенеджерПоРозничнойТорговле", ОписанияПрофилей, ИндексПрофилей);
	Если ОписаниеПрофиля <> Неопределено Тогда

		УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "МенеджерПоРозничнойТорговле");

		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
		
		
	КонецЕсли;
	#КонецОбласти
	
	#Область Дополнить_профиль_УчастникСогласованияУсловийПродаж
	
	ОписаниеПрофиля = НайтиПрофиль("УчастникСогласованияУсловийПродаж", ОписанияПрофилей, ИндексПрофилей);
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	#КонецОбласти 
	
	//-- Локализация

КонецПроцедуры

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// см. ОбщийМодуль.УправлениеДоступомПереопределяемый.ЗаполнитьПоставляемыеПрофилиГруппДоступа()
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
		
	ИндексироватьПрофили(ОписанияПрофилей, "Имя");
	//++ Локализация

	#Область Создать_профиль_ОтветственныйЗаОбменЭД
	// Профиль "Ответственный за обмен электронными документами (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаОбменЭД";
	ОписаниеПрофиля.Идентификатор = "1c7bc32a-60eb-4395-ab8d-87fd6103a095";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за обмен электронными документами (дополнительный)'");

	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекEDI");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDIЗакупка");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDIПродажа");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСервисEDI");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеТекущихДелEDI");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоВзаимодействия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	
	// ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительный профиль, назначается пользователям, осуществляющим настройку
	                                      |соглашений по обмену электронными документами'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	#КонецОбласти
	
	#Область Создать_профиль_ВетеринарныйВрач

	// Профиль "Ветеринарный врач".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ВетеринарныйВрач";
	ОписаниеПрофиля.Идентификатор = "2434ce08-e835-48a1-a1c9-d02e5ce8adba";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ветеринарный врач'");
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "ВетеринарныйВрач");

	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");

	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыкуповПринятыхНаХранениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкиТоваровСХранения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкиТоваровНаХранение");

	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	// ЛокализацияУчета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады","ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем происходит оформление ветеринарной сопроводительной документации,
	                                      |оформление транспортных, производственных и складских операций с продукцией,
	                                      |автоматическое взаимодействие с системой ""Меркурий"".'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

#КонецОбласти
	
	#Область Описание_профиля_ПользовательМобильногоПриложения1СМониторERP
	// Профиль "Пользователь мобильного приложения "1C:Монитор ERP" (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПользовательМобильногоПриложения1СМониторERP";
	ОписаниеПрофиля.Идентификатор = "bd90021b-f46c-11e2-ad7c-c86000df10d3";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь мобильного приложения ""1C:Монитор ERP"" (дополнительный)'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Чтение.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложенияМониторERP");
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Данный профиль дает возможность 
										  |пользователю мобильного приложения ""1С:Монитор ERP""
										  |получать данные из информационной базы.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	#КонецОбласти
	
	
	//-- Локализация
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// см. ОбщийМодуль.УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных()
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = Описание + "
//++ Локализация
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросКоммерческихПредложенийПоставщиковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗапросКоммерческогоПредложенияОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КассовыеКниги.Чтение.Организации
	|Справочник.КассовыеКниги.Изменение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Чтение.ГруппыПартнеров
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Изменение.ГруппыПартнеров
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.МаршрутыПодписания.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Изменение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НастройкиОбменСБанками.Изменение.Организации
	|Справочник.НастройкиЯндексКассы.Чтение.Организации
	|Справочник.НастройкиЯндексКассы.Изменение.Организации
	|Справочник.Патенты.Чтение.Организации
	|Справочник.Патенты.Изменение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПатентыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкаОПодтверждающихДокументахПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Изменение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.БлокировкаВычетаНДС.Чтение.Организации
	|Документ.БлокировкаВычетаНДС.Изменение.Организации
	|Документ.ВводОстатковНДСПредъявленного.Чтение.Организации
	|Документ.ВводОстатковНДСПредъявленного.Изменение.Организации
	|Документ.ВводОстатковТМЦВЭксплуатации.Чтение.Организации
	|Документ.ВводОстатковТМЦВЭксплуатации.Изменение.Организации
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратВОборотИСМП.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Чтение.Организации
	|Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Изменение.Организации
	|Документ.ЗаписьКнигиПокупок.Чтение.Организации
	|Документ.ЗаписьКнигиПокупок.Изменение.Организации
	|Документ.ЗаписьКнигиПродаж.Чтение.Организации
	|Документ.ЗаписьКнигиПродаж.Изменение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Чтение.Организации
	|Документ.ЗапросКоммерческихПредложенийПоставщиков.Изменение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Чтение.Организации
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗапросКоммерческогоПредложенияОтКлиента.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Изменение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеПоставщика.Чтение.Организации
	|Документ.КоммерческоеПредложениеПоставщика.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеПоставщика.Изменение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Чтение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Изменение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Чтение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.ЛистКассовойКниги.Чтение.Организации
	|Документ.ЛистКассовойКниги.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.МаркировкаТоваровИСМП.Чтение.Организации
	|Документ.МаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ОперацияПоЯндексКассе.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Чтение.Организации
	|Документ.ОперацияПоЯндексКассе.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Изменение.Организации
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Чтение.Организации
	|Документ.ОтгрузкаТоваровИСМП.Изменение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.ОтчетЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетОбменСБанками.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.ПеремаркировкаТоваровИСМП.Чтение.Организации
	|Документ.ПеремаркировкаТоваровИСМП.Изменение.Организации
	|Документ.ПисьмоОбменСБанками.Чтение.Организации
	|Документ.ПисьмоОбменСБанками.Изменение.Организации
	|Документ.ПриемкаТоваровИСМП.Чтение.Организации
	|Документ.ПриемкаТоваровИСМП.Изменение.Организации
	|Документ.СводнаяСправкаНДС.Чтение.Организации
	|Документ.СводнаяСправкаНДС.Изменение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СообщениеОбменСБанками.Изменение.Организации
	|Документ.СообщениеЭДО.Чтение.Организации
	|Документ.СообщениеЭДО.Изменение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Чтение.Организации
	|Документ.СписаниеКодовМаркировкиИСМП.Изменение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Чтение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураКомиссионеру.Чтение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Чтение.Организации
	|Документ.СчетФактураКомиссионеру.Изменение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Изменение.Организации
	|Документ.СчетФактураКомитента.Чтение.Организации
	|Документ.СчетФактураКомитента.Изменение.Организации
	|Документ.СчетФактураНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураНалоговыйАгент.Изменение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Чтение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.Организации
	|Документ.ТранспортнаяНакладная.Чтение.Организации
	|Документ.ТранспортнаяНакладная.Изменение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Чтение.Организации
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТранспортнаяНакладнаяЕГАИС.Изменение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Чтение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.Склады
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.Склады
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Чтение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Изменение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.ЧекЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Изменение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Изменение.Организации
	|ЖурналДокументов.КорректировкиНДС.Чтение.Организации
	|ЖурналДокументов.ПрослеживаемостьУведомления.Чтение.Организации
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|РегистрСведений.ДанныеОснованийСчетовФактур.Чтение.Организации
	|РегистрСведений.ДетализацияСебестоимостиТоваров.Чтение.Организации
	|РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП.Чтение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Чтение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Изменение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Чтение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Чтение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Изменение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Изменение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиУчетаУСН.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Изменение.Организации
	|РегистрСведений.НеОтправленныеПрикладныеОбъектыEDI.Чтение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Чтение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Изменение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Изменение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Чтение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Склады
	|РегистрСведений.ПримененияЕНВД.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Изменение.Склады
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Подразделения
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.Организации
	|РегистрСведений.СостоянияДокументовEDI.Чтение.ТипыДокументовEDI
	|РегистрСведений.СостоянияДокументовЭДО.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЭДО.Изменение.Организации
	|РегистрСведений.СтатусОбменовСЯндексКассой.Чтение.Организации
	|РегистрСведений.СтатусОбменовСЯндексКассой.Изменение.Организации
	|РегистрСведений.СубъектыДляСкрытияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.ГруппыПартнеров
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.Организации
	|РегистрСведений.СчетаФактурыКомитентовКРегистрации.Чтение.Организации
	|РегистрСведений.СчетаФактурыПоставщиковКПеревыставлениюКомитентам.Чтение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Чтение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Изменение.Организации
	|РегистрСведений.УчетныеЗаписиЭДО.Чтение.Организации
	|РегистрСведений.УчетныеЗаписиЭДО.Изменение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.ПартииЗатратНаВыпуск.Чтение.Организации
	|РегистрНакопления.ПартииПроизводственныхЗатрат.Чтение.Организации
	|РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ПартииТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Чтение.Организации
//-- Локализация
	|";

КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// см. УправлениеДоступомУТ.ЗаполнитьИспользованиеВидаДоступа()
//
Процедура ЗаполнитьИспользованиеВидаДоступа(ВидДоступа, Использование) Экспорт

	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	//++ Локализация
	// RLS на объекты подсистемы ЗащитаПерсональныхДанных поставляется в ролях
	//   ДобавлениеИзменениеФизическихЛиц
	//   ЧтениеФизическихЛиц
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		Если Список = Метаданные.Документы["ОтзывСогласияНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.Документы["СогласиеНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.РегистрыСведений["СогласияНаОбработкуПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Организация)
			|	И ЗначениеРазрешено(Субъект)";
		ИначеЕсли Список = Метаданные.РегистрыСведений["СубъектыДляСкрытияПерсональныхДанных"] Тогда
			Ограничение.Текст =
			"РазрешитьЧтениеИзменение
			|ГДЕ
			|	ЗначениеРазрешено(Субъект)";
		КонецЕсли;
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// см. УправлениеДоступомПереопределяемый.ЗаполнитьВидыДоступа()
//
Процедура ЗаполнитьВидыДоступа(ВидыДоступа) Экспорт
	
	//++ Локализация
	
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ТипыДокументовEDI";
	ВидДоступа.Представление = НСтр("ru = 'Типы документов сервиса EDI'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ТипыДокументовEDI");
	
	//-- Локализация
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// см. ОбщийМодуль.УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа()
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	// Конец ЭлектронноеВзаимодействие
	
	УправлениеДоступомБП.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	// RLS на объекты подсистемы ЗащитаПерсональныхДанных поставляется в ролях
	//   ДобавлениеИзменениеФизическихЛиц
	//   ЧтениеФизическихЛиц
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		Списки.Вставить(Метаданные.Документы["ОтзывСогласияНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.Документы["СогласиеНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.РегистрыСведений["СогласияНаОбработкуПерсональныхДанных"], Ложь);
		Списки.Вставить(Метаданные.РегистрыСведений["СубъектыДляСкрытияПерсональныхДанных"], Ложь);
	КонецЕсли;
	
	УчетПрослеживаемыхТоваровЛокализация.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	Списки.Вставить(Метаданные.Документы.АктПостановкиНаБалансЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.АктСписанияЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковТМЦВЭксплуатации, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковНДСПредъявленного, Истина);
	Списки.Вставить(Метаданные.Документы.ВыводИзОборотаИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратВОборотИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратИзРегистра2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВыпускКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаОбособленногоУчетаЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.ЛистКассовойКниги, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияПоЯндексКассе, Истина);
	Списки.Вставить(Метаданные.Документы.ОстаткиЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтгрузкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаВРегистр2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.ПриемкаТоваровИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеКодовМаркировкиИСМП, Истина);
	Списки.Вставить(Метаданные.Документы.СправкаОПодтверждающихДокументах, Истина);
	Списки.Вставить(Метаданные.Документы.ТранспортнаяНакладная, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНВходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНИсходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИСВозврат, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОЗачисленииВалюты, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОЗачисленииВалюты, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.РегламентныеДокументы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатратыНЗП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартииТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиОбменаСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьСообщенийИСМП, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПримененияЕНВД, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПулКодовМаркировкиСУЗ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РегистрацииВНалоговомОргане, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиУчетаУСН, Истина);
	
	Списки.Вставить(Метаданные.Справочники.Патенты, Истина);
	Списки.Вставить(Метаданные.Справочники.ПатентыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.КассовыеКниги, Истина);
	Списки.Вставить(Метаданные.Справочники.КлассификаторОрганизацийЕГАИС, Истина);
	Списки.Вставить(Метаданные.Справочники.ЛицензииПоставщиковАлкогольнойПродукции, Истина);
	Списки.Вставить(Метаданные.Справочники.РегистрацииВНалоговомОргане, Истина);
	Списки.Вставить(Метаданные.Справочники.ТранспортнаяНакладнаяПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СправкаОПодтверждающихДокументахПрисоединенныеФайлы, Истина);
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИндексироватьПрофили(ОписанияПрофилей, ПолеПрофиля = "Имя")
	
	Результат = Новый Соответствие;
	Для Индекс = 0 По ОписанияПрофилей.ВГраница() Цикл
		
		Профиль = ОписанияПрофилей[Индекс];
		Результат.Вставить(Профиль[ПолеПрофиля], Индекс);
		
	КонецЦикла;
	Возврат Результат;
	
КонецФункции
//++ Локализация
Функция НайтиПрофиль(ИмяПрофиля, ОписанияПрофилей, ИндексПрофилей)

	ИндексПрофиля = ИндексПрофилей[ИмяПрофиля];
	Если ИндексПрофиля = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОписанияПрофилей[ИндексПрофиля];
	
КонецФункции
//-- Локализация

// Служебная функция. Сделана экспортной для удобства внедрения.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	
	// Необходимые роли БЭД
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	
	// Новости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
	// ЭлектронноеВзаимодействие.СервисДоставки
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСервисДоставки");
	// ЭлектронноеВзаимодействие.СервисДоставки
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиТорговыйПредставитель(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоОбеспечениюПотребностей(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиФинансовогоАналитика(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоЗакупкам(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	//-- Локализация
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.
//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаЧтение(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГруппФинансовогоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписанийИзЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркировокТоваровГИСМ");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменовСЯндексКассой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоЯндексКассе");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	
	
	// Чтение регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиБухгалтера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаУчетныеПолитикиОрганизаций");
	
	// Регистры сведений, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПримененияЕНВД");
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");

	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРегламентированныйУчет");
	
	// Доступ на чтение к учету НДС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокВидовДеятельностиНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНДССостояниеРеализации0");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТаможенныхДекларацийИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровНДС");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурВыданныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомиссионеру");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурКомитента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурНаНеподтвержденнуюРеализацию0");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовФактурПолученныхНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявленийОВвозеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоУчетуНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийПрослеживаемыхТоваров");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц","ВначалеВсеРазрешены");
	
	УчетОригиналовПервичныхДокументов.ДополнитьПрофильРольюДляЧтенияСостоянийОригиналовДокументов(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("АналитическиеОтчетыСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	// Прослеживаемость импортных товаров
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПрослеживаемыхТоваровВЕАЭС");
	
	//-- Локализация
	
КонецПроцедуры

// Служебная функция. Сделана экспортной для исключения дублирования.
//
Процедура ДобавитьРолиБухгалтераРеглУчетаНаИзменение(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	// Справочники, чтение. 
	
	УправлениеДоступомИСУТ.ДополнитьПрофиль(ОписаниеПрофиля, "БухгалтерРеглУчета");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАннулированияПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийИзЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийВЭксплуатации");
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчета");
	
	// Обработки и отчеты
	
	
	// Регистры сведений, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПримененияЕНВД");
	
	// Регистры сведений, чтение.
	
	// Дополнительные права.
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложений");

	// Подсистемы глобального командного интерфейса
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаРегламентированныйУчет");
	
	
	// Полный доступ к учету НДС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокВидовДеятельностиНДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНДССостояниеРеализации0");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТаможенныхДекларацийИмпорта");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомиссионеру");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурКомитента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурНаНеподтвержденнуюРеализацию0");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНаАванс");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученныхНалоговогоАгента");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявленийОВвозеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийПрослеживаемыхТоваров");
	
	// EDI
	СервисEDIУТ.ДополнитьПрофильПравамиЧтенияДокументовEDI(ОписаниеПрофиля);
	
	// Прослеживаемость импортных товаров
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияУчетПрослеживаемыхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПрослеживаемыхТоваровВЕАЭС");
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиСупервайзерТорговыхПредставителей(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМаркетолог(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиРуководительОтделаПродаж(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	
	// ЛокализацияРаботыСЯндексМаркет
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСтатусовПубликацииТоваровЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПродажиСФулфилментомЯндекса");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажНаЯндексМаркет");	
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоДоставке(ОписаниеПрофиля) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджерПоПродажам(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеСтатусовПубликацииТоваровЯндексМаркет");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияИнтеграцияСМаркетплейсами");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПродажиСФулфилментомЯндекса");	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияПродажНаЯндексМаркет");	
	// Обмен данными с мобильным приложением "1С:Заказы"
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения1СЗаказы");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиМенеджераПоРозничнойТорговле(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиКассир(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиКазначей(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиКладовщик(ОписаниеПрофиля) Экспорт
	//++ Локализация
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковНДСПредъявленного");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТМЦВЭксплуатации");
	//-- Локализация
КонецПроцедуры

Процедура ДобавитьРолиАдминистраторПланирования(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПланированияПроизводства(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	
	
	
	//-- Локализация
	
КонецПроцедуры

Процедура ДобавитьРолиУчастникПланированияПродаж(ОписаниеПрофиля) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры



//++ Локализация
//-- Локализация
#КонецОбласти
