#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("ОборотныеРегистрыУправленческогоУчета");
	МеханизмыДокумента.Добавить("УчетДоходовРасходов");
	МеханизмыДокумента.Добавить("УчетПрочихАктивовПассивов");
	
	РасчетКурсовыхРазницЛокализация.ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента);
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * ТаблицаИмяРегистра - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоСрокам(ТекстыЗапроса);
			ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоСрокам(ТекстыЗапроса);
		Иначе
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса);
			ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса);
		КонецЕсли;
		ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаФинансовыеИнструменты(ТекстыЗапроса);
		ТекстЗапросаВтТаблицаСуммыДисконтирования(ТекстыЗапроса);
		
		ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса);
		ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса);
		ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса);
		ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса);
	
		// Таблицы on-line движений
		ТекстЗапросаТаблицаПрочиеДоходы(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(ТекстыЗапроса, Регистры);
		
		ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(ТекстыЗапроса, Регистры);
		
		РасчетКурсовыхРазницЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
	
	РасчетКурсовыхРазницЛокализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);

КонецПроцедуры

// Добавляет команду создания документа "Расчет курсовых разниц".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
// 	Неопределено
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.РасчетКурсовыхРазниц) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РасчетКурсовыхРазниц.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.РасчетКурсовыхРазниц);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьНесколькоВалют";
	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
	РасчетКурсовыхРазницЛокализация.ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры);

КонецПроцедуры

// Возвращает регистры переоценки для заданной хозяйственной операции.
// Если хозяйственная операция не задана, то возвращаются все оперативные регистры переоцениваемые документом.
//
// Параметры:
//  Операция - ПеречислениеСсылка.ХозяйственныеОперации - хозяйственная операция для которой необходимо получить список регистров.
//	ИменаРегистров - Структура - структура с ранее заполненными именами регистров (для добавления новых регистров).
//
// Возвращаемое значение:
//  Структура - в ключах структуры перечислены имена переоцениваемых регистров.
//
Функция РегистрыРасчета(Операция = Неопределено, ИменаРегистров = Неопределено) Экспорт
	
	Если ИменаРегистров = Неопределено Тогда
		ИменаРегистров = Новый Структура;
	КонецЕсли;
	
	НоваяАрхитектура = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками ИЛИ Операция = Неопределено Тогда
		Если НоваяАрхитектура Тогда
			ИменаРегистров.Вставить("РасчетыСПоставщикамиПоСрокам");
		Иначе
			ИменаРегистров.Вставить("РасчетыСПоставщикамиПоДокументам");
		КонецЕсли;
	КонецЕсли;
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами ИЛИ Операция = Неопределено Тогда
		Если НоваяАрхитектура Тогда
			ИменаРегистров.Вставить("РасчетыСКлиентамиПоСрокам");
		Иначе
			ИменаРегистров.Вставить("РасчетыСКлиентамиПоДокументам");
		КонецЕсли;
	КонецЕсли;
		
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("ДенежныеСредстваБезналичные");
		ИменаРегистров.Вставить("ДенежныеСредстваНаличные");
		ИменаРегистров.Вставить("ДенежныеСредстваВКассахККМ");
		ИменаРегистров.Вставить("ДенежныеСредстваВПути");
		ИменаРегистров.Вставить("ДенежныеСредстваУПодотчетныхЛиц");
	КонецЕсли;
		
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("РасчетыПоФинансовымИнструментам");
	КонецЕсли;
	
	Если Операция = Перечисления.ХозяйственныеОперации.ПереоценкаСуммДисконтирования ИЛИ Операция = Неопределено Тогда
		ИменаРегистров.Вставить("ПроцентныеРасходыДисконтирования");
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ДополнитьРегистрыРасчета(ИменаРегистров, Операция);
	
	Возврат ИменаРегистров;
	
КонецФункции

// Выполняет переоценку всего чего возможно в оперативном учете.
//	Переоцениваются:
//	- Остатки денежных средств.
//	- Взаиморасчеты с клиентами.
//	- Взаиморасчеты с поставщиками.
//	- Остатки по кредитам, депозитам, займам.
//
// Параметры:
//	Период - Дата - любая дата месяца за который необходимо провести переоценку
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//
Процедура ВыполнитьПереоценку(Период, Организация = Неопределено) Экспорт
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами);
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками);
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов);
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаСуммДисконтирования);
	
КонецПроцедуры

// Выполняет переоценку остатков денежных средств.
//
// Параметры:
//	МассивОрганизаций - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации - Организация (список организаций) по которой необходимо выполнить переоценку.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//
Процедура ПереоценитьДенежныеСредства(МассивОрганизаций, Период) Экспорт
	
	Для Каждого Организация Из ОбщегоНазначенияУТКлиентСервер.Массив(МассивОрганизаций) Цикл
		ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет переоценку остатков наличных денежных средств в заданных кассах организации.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.Кассы, Массив из СправочникСсылка.Организации, Неопределено - Касса (список касс) по которой необходимо выполнить переоценку.
//	                   Если не задана, то для всех.
//
Процедура ПереоценитьКассыОрганизации(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств;
	РегистрыДляРасчета = Новый Структура("ДенежныеСредстваНаличные");
	Аналитика = Новый Структура("Кассы", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, РегистрыРасчета", Аналитика, РегистрыДляРасчета);
	
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	
КонецПроцедуры

// Выполняет переоценку остатков денежных средств у подотчетных лиц.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.ФизическиеЛица, Массив из СправочникСсылка.ФизическиеЛица, Неопределено - Физическое лицо (список лиц) у которых необходимо выполнить переоценку.
//	                   Если не задано, то для всех.
//
Процедура ПереоценитьДенежныеСредстваУПодотчетныхЛиц(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств;
	РегистрыДляРасчета = Новый Структура("ДенежныеСредстваУПодотчетныхЛиц");
	Аналитика = Новый Структура("ФизическиеЛица", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, РегистрыРасчета", Аналитика, РегистрыДляРасчета);
	
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	
КонецПроцедуры

// Выполняет переоценку взаиморасчетов с клиентами.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив из СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Неопределено - АналитикаУчетаПоПартнерам (список аналитик)
//	                   по которой необходимо выполнить переоценку. Если не задана, то для всех.
//	КоличествоОбработанныхЭлементов - Число - в переменную помещается количество записанных записей
//                                            в регистр РасчетыСКлиентамиПоДокументам при расчете курсовых разниц.
//
Процедура ПереоценитьРасчетыСКлиентами(Организация, Период, АналитикаРасчета = Неопределено, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, КоличествоОбработанныхЭлементов", Аналитика, КоличествоОбработанныхЭлементов);
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	КоличествоОбработанныхЭлементов = ПараметрыПереоценки.КоличествоОбработанныхЭлементов;
	
КонецПроцедуры

// Выполняет переоценку взаиморасчетов с поставщиками.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив из СправочникСсылка.ключиАналитикиУчетаПоПартнерам, Неопределено - АналитикаУчетаПоПартнерам (список аналитик)
//	                   по которой необходимо выполнить переоценку. Если не задана, то для всех.
//	КоличествоОбработанныхЭлементов - Число - в переменную помещается количество записанных записей
//                                            в регистр РасчетыСПоставщикамиПоДокументам при расчете курсовых разниц.
//
Процедура ПереоценитьРасчетыСПоставщиками(Организация, Период, АналитикаРасчета = Неопределено, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета, КоличествоОбработанныхЭлементов", Аналитика, КоличествоОбработанныхЭлементов);
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	КоличествоОбработанныхЭлементов = ПараметрыПереоценки.КоличествоОбработанныхЭлементов;
	
КонецПроцедуры

// Выполняет переоценку кредитов, депозитов, займов.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//  АналитикаРасчета - ПеречислениеСсылка.ТипыСуммГрафикаКредитовИДепозитов, Массив из ПеречислениеСсылка.ТипыСуммГрафикаКредитовИДепозитов, Неопределено - Типы сумм по которым необходимо провести переоценку.//	
//
Процедура ПереоценитьКредитыДепозитыЗаймы(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	ПараметрыПереоценки = Новый Структура;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки.Вставить("АналитикаРасчета", Аналитика);
	
	ПровестиДокументПереоценки(Организация, Период, Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов, ПараметрыПереоценки);
	
КонецПроцедуры

// Выполняет переоценку процентных расходов сумм дисконтирования.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций) по которой необходимо выполнить переоценку.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//	АналитикаРасчета - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Массив из СправочникСсылка.КлючиАналитикиУчетаПоПартнерам, Неопределено - Касса (список касс) по которой необходимо выполнить переоценку.
//	                   Если не задана, то для всех.
//
Процедура ПереоценитьСуммыДисконтирования(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	Операция = Перечисления.ХозяйственныеОперации.ПереоценкаСуммДисконтирования;
	Аналитика = Новый Структура("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ПараметрыПереоценки = Новый Структура("АналитикаРасчета", Аналитика);
	ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки);
	
КонецПроцедуры

// Отразить доходы и расходы от курсовых разниц при взаиморасчетах с партнерами в учете.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации, Неопределено - Организация (список организаций)
//                по которой необходимо выполнить отражение курсовых разниц.
//                Если не задан, то для всех.
//	Период - Дата - любая дата месяца за который необходимо провести переоценку.
//
Процедура ОтразитьКурсовыеРазницыПоРасчетам(Организация, Период) Экспорт
	
	ПереоценитьРасчетыСПоставщиками(Организация, Период);
	ПереоценитьРасчетыСКлиентами(Организация, Период);
	
КонецПроцедуры

// Возвращает документы расчета курсовых разниц за указанный период (одни или произвольное число месяцев)
// в виде соответствия ДатаНачалаМесяца - ДокументРасчетаЭтогоМесяца. Если документ не найден то он будет создан.
// Количество документов равно количеству месяцев в указанном периоде.
// Если в каком-то из месяцев не найдется проведенного документа, то он будет создан.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация по которой необходимо получить документы расчета курсовых разниц
//	НачалоПериода - Дата - Дата начало периода выборки документов (будет приведена к началу месяца)
//	КонецПериода - Дата - Дата конца периода выборки документов (будет приведена к концу месяца)
//	ЭтоРасчетыСКлиентами - Булево - Если Истина, то отбирать документы переоценки по клиентам иначе по поставщикам
//
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - в ключах соответствия дата начала месяца, в значениях документ расчета курсовых разниц соответствующего месяца:
//		* Ключ - Дата - Дата переоценки.
//		* Значение - ДокументСсылка.РасчетКурсовыхРазниц - Регистратор.
//
Функция ДокументыПереоценки(Организация, НачалоПериода, КонецПериода, ЭтоРасчетыСКлиентами) Экспорт
	
	Если НачалоПериода <= Дата('19800101') ИЛИ НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		ВызватьИсключение НСтр("ru = 'Задана некорректная дата первого периода расчета курсовых разниц.'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокументыПереоценки = Новый Соответствие;
	РазностьМесяцев = Месяц(КонецПериода) - Месяц(НачалоПериода) + 12*(Год(КонецПериода) - Год(НачалоПериода));
	Для ИндексМесяца = 0 По РазностьМесяцев Цикл
		НовыйМесяц = ДобавитьМесяц(НачалоПериода, ИндексМесяца);
		ДокументыПереоценки.Вставить(НачалоМесяца(НовыйМесяц));
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РасчетКурсовыхРазниц.Дата, МЕСЯЦ) КАК Дата,
	|	РасчетКурсовыхРазниц.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК РасчетКурсовыхРазниц
	|ГДЕ
	|	НЕ РасчетКурсовыхРазниц.ПометкаУдаления
	|	И РасчетКурсовыхРазниц.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетКурсовыхРазниц.Организация = &Организация
	|	И РасчетКурсовыхРазниц.ХозяйственнаяОперация = &ХозяйственнаяОперация");
	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками;
	Если ЭтоРасчетыСКлиентами Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументыПереоценки[Выборка.Дата] = Выборка.Ссылка;
	КонецЦикла;
	
	ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	Для Каждого Регистратор Из ДокументыПереоценки Цикл
		Если Регистратор.Значение = Неопределено Тогда
			ОбъектДокумента = Документы.РасчетКурсовыхРазниц.СоздатьДокумент();
			ОбъектДокумента.Дата = КонецМесяца(Регистратор.Ключ);
			ОбъектДокумента.Организация = Организация;
			ОбъектДокумента.ХозяйственнаяОперация = ХозяйственнаяОперация;
			ОбъектДокумента.ПереоценкаПоДням = ПереоценкаПоДням;
			ОбъектДокумента.Проведен = Истина;
			ОбъектДокумента.Записать();
			ДокументыПереоценки[Регистратор.Ключ] = ОбъектДокумента.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДокументыПереоценки;
	
КонецФункции

#Область ФормированиеЗаданийКЗакрытиюМесяца

// Дополняет текст запроса механизма формирования заданий закрытия месяца.
//
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 	ТекстЗапроса - Строка - строка с текстом запроса.
// 	ТекстЗапросаВременныхТаблиц - Строка - строка с текстом запроса временных таблиц.
// 	ИменаВременныхТаблиц - Строка - массив имен создаваемых временных таблиц для последующего уничтожения.
Процедура ДополнитьТекстЗапросаЗаданийКЗакрытиюМесяца(Запрос, ТекстЗапроса, ТекстЗапросаВременныхТаблиц, ИменаВременныхТаблиц) Экспорт
	
	СоответствиеЗапросов = СоответствиеЗапросовКонтрольнымРегистрам(Запрос);
	
	Для Каждого ЭлементСоответствия Из СоответствиеЗапросов Цикл
		ЗакрытиеМесяцаСервер.ДополнитьНазванияТаблицДляЗаданий(Запрос, ЭлементСоответствия.Ключ);
		ЗакрытиеМесяцаСервер.ДополнитьТекстЗапросаЗаданий(ЭлементСоответствия.Ключ,
			ЭлементСоответствия.Значение,
			Запрос.МенеджерВременныхТаблиц.Таблицы,
			ТекстЗапроса,
			ТекстЗапросаВременныхТаблиц,
			ИменаВременныхТаблиц);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа()
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

#Область ПереоценкаДенежныхСредствИФинансовыхИнструментов

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
//
// Параметры:
// 	ТаблицаЭтапов - (См. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца)
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов);
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Использование_ПереоценкаДенежныхСредствИФинансовыхИнструментов");
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"Документы.РасчетКурсовыхРазниц.Оформление_ПереоценкаДенежныхСредствИФинансовыхИнструментов");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"Документы.РасчетКурсовыхРазниц.Выполнить_ПереоценкаДенежныхСредствИФинансовыхИнструментов");
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РасчетКурсовыхРазниц.Формы.ФормаСписка.ПолноеИмя(), Истина);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru='Мультивалютный учет не ведется'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Отчеты.СправкаРасчетПереоценкиВалютныхСредств.ПолноеИмя() + ".Форма", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ДействиеПодробнее.ПараметрыФормы.Вставить("ВсеОрганизации", ПараметрыОбработчика.ПараметрыРасчета.ВсеОрганизации);
	
	Если ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца(ПараметрыОбработчика,Истина,,,ДействиеПодробнее) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	АналитикаРасчета = Новый Структура("ТипыСумм", Новый Массив);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") Тогда
		РегистрыДляРасчета = РегистрыРасчета(
			Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов,
			РегистрыДляРасчета);
		АналитикаРасчета.ТипыСумм = ТипыСуммКредитовДепозитовЗаймов();
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	ТребуетсяПереоценка = ТребуетсяПереоценка(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, ПараметрыРасчета.МассивОрганизаций.Количество());
	
	ЕстьВалютныеОстатки = ЕстьВалютныеОстатки(
		ПараметрыРасчета.МассивОрганизаций,
		ПараметрыРасчета.КонецПериода,
		РегистрыДляРасчета,
		АналитикаРасчета);
		
	Если ТребуетсяПереоценка Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеВыполненСОшибками(
			ПараметрыОбработчика,
			НСтр("ru='Обнаружены курсовые разницы по регистрам учета денежных средств.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию(),
			ДействиеПодробнее);
		
	ИначеЕсли НЕ ЕстьВалютныеОстатки Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет валютных остатков по регистрам учета денежных средств.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УстановитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", ТребуетсяПереоценка);
	
КонецПроцедуры

// Оформляет этап закрытия месяца для производство без заказов.
//
// Параметры:
//  ПараметрыОбработчика - см. ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыОбработчикаЭтапаЗакрытияМесяцаДляПроверки
//
Процедура Оформление_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ПараметрыОбработчика) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия") Тогда
		ПараметрыОбработчика.ДанныеЭтапа.Наименование = НСтр("ru = 'Переоценка денежных средств'");
	КонецЕсли;
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстВыполнить = НСтр("ru='Выполнить'");
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика);
	
КонецПроцедуры

Процедура Выполнить_ПереоценкаДенежныхСредствИФинансовыхИнструментов(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	НачалоРасчета = ЗакрытиеМесяцаСервер.НачалоРасчета(
		ПараметрыОбработчика.ДанныеЭтапа.Код,
		ПараметрыОбработчика.ПараметрыРасчета.КонецПериода,
		Неопределено,
		ПараметрыРасчета.МассивОрганизаций);
	
	ПервыйПроход  = Истина;
	
	ТребуетсяПереоценка = ЗакрытиеМесяцаСервер.ПолучитьДополнительноеСвойствоОбработчика(ПараметрыОбработчика, "ТребуетсяПереоценка", Ложь);
	ЕстьЗаданиеКРасчету = (НачалоРасчета <= ПараметрыРасчета.КонецПериода);
	
	Если ТребуетсяПереоценка И НЕ ЕстьЗаданиеКРасчету Тогда
		НачалоРасчета = ПараметрыРасчета.КонецПериода; // пересчитать только указанный месяц
	КонецЕсли;
	
	Пока НачалоРасчета <= ПараметрыРасчета.КонецПериода ИЛИ ТребуетсяПереоценка Цикл
		
		ОкончаниеПериода = КонецМесяца(НачалоРасчета);
		
		Если ЕстьЗаданиеКРасчету Тогда
			
			Если ПервыйПроход Тогда
				НомерЗаданияДоРасчета = ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания();
			КонецЕсли;
		
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(НомерЗаданияДоРасчета, ПараметрыРасчета.МассивОрганизаций, ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ДанныеКПереоценкеЗаМесяц = ЗакрытиеМесяцаСервер.ЗаданияКРасчетуЗаМесяц(
					НачалоРасчета,
					ОкончаниеПериода,
					НомерЗаданияДоРасчета,
					ПараметрыРасчета.МассивОрганизаций,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='При выполнении расчета за период %1 произошла ошибка:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ПараметрыРасчета.МассивОрганизаций,
					НачалоРасчета);
				
			КонецПопытки;
			
		Иначе
			
			ДанныеКПереоценкеЗаМесяц = Новый Структура("Организация", ПараметрыРасчета.МассивОрганизаций);
			
		КонецЕсли;
		
		Попытка
			РегистрыДляРасчета = РегистрыРасчета(Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств);
			ОрганизацииКПереоценке = ТребуетсяПереоценка(
										ПараметрыРасчета.МассивОрганизаций, ОкончаниеПериода, РегистрыДляРасчета,,Истина);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОрганизацииКПереоценке, ДанныеКПереоценкеЗаМесяц.Организация, Истина);
			
			ПереоценитьДенежныеСредства(ОрганизацииКПереоценке, НачалоРасчета);
		Исключение
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Переоценка денежных средств за период %1 завершилась с ошибкой:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ДанныеКПереоценкеЗаМесяц.Организация,
				НачалоРасчета);
			
		КонецПопытки;
		
		Попытка
			Если ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") Тогда
				ПереоценитьКредитыДепозитыЗаймы(ДанныеКПереоценкеЗаМесяц.Организация, НачалоРасчета);
			КонецЕсли;
		Исключение
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Переоценка кредитов, депозитов, займов за период %1 завершилась с ошибкой:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ДанныеКПереоценкеЗаМесяц.Организация,
				НачалоРасчета);
			
		КонецПопытки;
		
		СледующийМесяц = СледующийМесяцКРасчетуДенежныхСредств(НачалоРасчета, ПараметрыРасчета.МассивОрганизаций);
		
		Если ЕстьЗаданиеКРасчету И ПараметрыОбработчика.ТаблицаПояснения.Количество() = 0 Тогда
			
			НачатьТранзакцию();
			
			Попытка
				
				ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(
					НомерЗаданияДоРасчета,
					ПараметрыРасчета.МассивОрганизаций,
					ПараметрыОбработчика.ДанныеЭтапа.Код);
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьРасчет(
					СледующийМесяц,
					НомерЗаданияДоРасчета,
					ПараметрыОбработчика.ДанныеЭтапа.Код,
					ДанныеКПереоценкеЗаМесяц);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='При выполнении расчета за период %1 произошла ошибка:
						|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
					РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
					ПараметрыОбработчика,
					ТекстОшибки,
					ПараметрыРасчета.МассивОрганизаций,
					НачалоРасчета);
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если ЕстьЗаданиеКРасчету И ЗначениеЗаполнено(СледующийМесяц) Тогда
			НачалоРасчета = СледующийМесяц;
		Иначе
			Если ЕстьЗаданиеКРасчету Тогда
				НачалоРасчета = КонецМесяца(НачалоРасчета) + 1; // следующий месяц
			Иначе
				НачалоРасчета = ПараметрыРасчета.КонецПериода + 1; // выход из цикла
			КонецЕсли;
		КонецЕсли;
		
		ТребуетсяПереоценка = Ложь;
		ПервыйПроход = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// Вспомогательные методы этапа.

Функция СледующийМесяцКРасчетуДенежныхСредств(ПериодРасчета, МассивОрганизаций)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	МИНИМУМ(ДенежныеСредства.Месяц) КАК МесяцКРасчету
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВПути КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Касса.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Касса.ВалютаДенежныхСредств <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Касса.ВалютаДенежныхСредств <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Касса.ВалютаДенежныхСредств <> &ВалютаУпр)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ДенежныеСредства.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК ДенежныеСредства
	|	ГДЕ
	|		(ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр)
	|		И ДенежныеСредства.Период > &ОбработанныйМесяц
	|		И ДенежныеСредства.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			Организация В (&МассивОрганизаций)
	|		) КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.Валюта <> ДенежныеСредства.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ДенежныеСредства.Валюта <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ФинансовыеИнструменты.Период) КАК Месяц
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам КАК ФинансовыеИнструменты
	|	ГДЕ
	|		(ФинансовыеИнструменты.Валюта <> ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ФинансовыеИнструменты.Валюта <> &ВалютаУпр)
	|		И ФинансовыеИнструменты.Период > &ОбработанныйМесяц
	|		И ФинансовыеИнструменты.ТипСуммы В (&ТипыСумм)
	|		И ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		&СледующийМесяц КАК Месяц
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			&НаКонецРассчитанногоМесяца,
	|			АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|			И ТипСуммы В (&ТипыСумм)
	|		) КАК ФинансовыеИнструменты
	|	ГДЕ
	|		ФинансовыеИнструменты.Валюта <> ФинансовыеИнструменты.АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета
	|			ИЛИ ФинансовыеИнструменты.Валюта <> &ВалютаУпр
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ЗаданияКПереоценке.Месяц) КАК Месяц
	|	ИЗ
	|		РегистрСведений.ЗаданияКЗакрытиюМесяца КАК ЗаданияКПереоценке
	|	ГДЕ
	|		ЗаданияКПереоценке.Месяц > &ОбработанныйМесяц
	|		И ЗаданияКПереоценке.Организация В (&МассивОрганизаций)
	|		И ЗаданияКПереоценке.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов)
	|
	|	) КАК ДенежныеСредства
	|ИМЕЮЩИЕ 
	|	НЕ (МИНИМУМ(ДенежныеСредства.Месяц) ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("ВалютаУпр",                  Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ОбработанныйМесяц",          КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("СледующийМесяц",             КонецМесяца(ПериодРасчета) + 1);
	Запрос.УстановитьПараметр("НаКонецРассчитанногоМесяца", Новый Граница(КонецМесяца(ПериодРасчета), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций",          МассивОрганизаций);
	Запрос.УстановитьПараметр("ТипыСумм",                   ТипыСуммКредитовДепозитовЗаймов());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), НачалоМесяца(Выборка.МесяцКРасчету), Дата(1, 1, 1));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ХозяйственнаяОперация,
	|	ДанныеДокумента.ПереоценкаПоДням,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаДС,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаРасчетовСПоставщиками,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаРасчетовСКлиентами,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПереоценкаФинансовыхИнструментов,
	|	НастройкиХозяйственныхОпераций.Ссылка КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|		ПО ДанныеДокумента.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	НачалоПериода = НачалоМесяца(Реквизиты.Дата);
	КонецПериода = КонецМесяца(Реквизиты.Дата);
	Запрос.УстановитьПараметр("НачалоПериода",                         НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",                          КонецПериода);
	Запрос.УстановитьПараметр("ГраницаНачалоПериода",                  Новый Граница(НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКонецПериода",                   Новый Граница(КонецПериода,  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",                           Реквизиты.Организация);
	Запрос.УстановитьПараметр("ЗаказПодразделение",                    Неопределено);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",                 Реквизиты.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("НастройкаХозяйственнойОперации",        Реквизиты.НастройкаХозяйственнойОперации);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",            Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета",        ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Реквизиты.Организация));
	Запрос.УстановитьПараметр("ПереоценкаПоДням",                      Реквизиты.ПереоценкаПоДням);
	Запрос.УстановитьПараметр("ИспользоватьУчетПрочихДоходовРасходов", Константы.ИспользоватьУчетПрочихДоходовРасходов.Получить());
	Запрос.УстановитьПараметр("АналитикаРасчета",
		РегистрыСведений.АналитикаУчетаПоПартнерам.КлючиАналитикиПоОрганизации(Реквизиты.Организация));
	Запрос.УстановитьПараметр("Кассы",                                 Неопределено);
	Запрос.УстановитьПараметр("ПоВсемКассам",                          Истина);
	Запрос.УстановитьПараметр("ПодотчетныеЛица",                       Неопределено);
	Запрос.УстановитьПараметр("ПоВсемПодотчетнымЛицам",                Истина);
	Запрос.УстановитьПараметр("ОбеспечительныйПлатеж",                 Неопределено);
	Запрос.УстановитьПараметр("ЕстьДоговораАренды",                    Ложь);
	Запрос.УстановитьПараметр("ТипДоговораАренды",                     Неопределено);
	Запрос.УстановитьПараметр("ТипыСумм",                              ТипыСуммКредитовДепозитовЗаймов());
	Запрос.УстановитьПараметр("ПоВсемТипамСумм",                       Ложь);
	Запрос.УстановитьПараметр("ПорядокОперации", ОперативныеВзаиморасчетыСервер.Порядок(КонецПериода,"",Тип("ДокументСсылка.РасчетКурсовыхРазниц"),"9","99"));
		
	ОплатаКлиента = Новый Массив;
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
	ОплатаКлиента.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Запрос.УстановитьПараметр("ОплатаКлиента", ОплатаКлиента);
	
	ОплатаПоставщику = Новый Массив;
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
	ОплатаПоставщику.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Запрос.УстановитьПараметр("ОплатаПоставщику", ОплатаПоставщику);
	
	Запрос.УстановитьПараметр("ИменаРегистров", РегистрыРасчета(Реквизиты.ХозяйственнаяОперация));
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоСрокам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыПоДокументам.ОбъектРасчетов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыПоДокументам.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РасчетыПоДокументам.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоСрокам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСПоставщиками";

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(РасчетыПоДокументам.ОбъектРасчетов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	РасчетыПоДокументам.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	РасчетыПоДокументам.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РасчетыПоДокументам.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСПоставщиками
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.ДокументРегистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСПоставщиками";

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	РасчетыПоДокументам.ЗаказПоставщику КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	-РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	-РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСПоставщиками
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаРасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыПоДокументам.ВидДвижения,
	|	РасчетыПоДокументам.Валюта КАК Валюта,
	|	РасчетыПоДокументам.Период КАК Период,
	|	РасчетыПоДокументам.АналитикаУчетаПоПартнерам,
	|	РасчетыПоДокументам.ЗаказКлиента.Подразделение КАК Подразделение,
	|	РасчетыПоДокументам.ЗаказКлиента КАК ОбъектРасчетов,
	|	РасчетыПоДокументам.РасчетныйДокумент,
	|	РасчетыПоДокументам.ДатаПлатежа,
	|	РасчетыПоДокументам.ДолгРегл КАК ДолгРегл,
	|	РасчетыПоДокументам.ДолгУпр КАК ДолгУпр,
	|	-РасчетыПоДокументам.ПредоплатаРегл КАК ПредоплатаРегл,
	|	-РасчетыПоДокументам.ПредоплатаУпр КАК ПредоплатаУпр,
	|	"""" КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыПоДокументам
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами)
	|	И ТИПЗНАЧЕНИЯ(РасчетыПоДокументам.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И РасчетыПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыПоДокументам.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваБезналичные";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.БанковскийСчет КАК БанковскийСчет,
	|	ДенежныеСредства.БанковскийСчет.Подразделение КАК Подразделение,
	|	ДенежныеСредства.БанковскийСчет.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваБезналичные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваНаличные";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Касса КАК Касса,
	|	ДенежныеСредства.Касса.Подразделение КАК Подразделение,
	|	ДенежныеСредства.Касса.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваНаличные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваВКассахККМ";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.КассаККМ КАК КассаККМ,
	|	ДенежныеСредства.КассаККМ.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваВКассахККМ
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваУПодотчетныхЛиц";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ДенежныеСредства.Подразделение КАК Подразделение,
	|	ДенежныеСредства.ЦельВыдачи КАК ЦельВыдачи,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ДенежныеСредства.СуммаУпр КАК СуммаУпр,
	|	ДенежныеСредства.СуммаРегл КАК СуммаРегл,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДенежныеСредства.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваУПодотчетныхЛиц
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаДенежныеСредстваВПути";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.НаправлениеДеятельности,
	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -ДенежныеСредства.СуммаУпр
	|			ИНАЧЕ ДенежныеСредства.СуммаУпр
	|	КОНЕЦ) КАК СуммаУпр,
	|	СУММА(
	|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -ДенежныеСредства.СуммаРегл
	|			ИНАЧЕ ДенежныеСредства.СуммаРегл
	|		КОНЕЦ) КАК СуммаРегл,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ втДенежныеСредстваВПути
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
	|	И ТИПЗНАЧЕНИЯ(ДенежныеСредства.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|	И ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДенежныеСредства.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредства.Период,
	|	ДенежныеСредства.Организация,
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
	|	ЕСТЬNULL(ДенежныеСредства.Получатель.НаправлениеДеятельности,
	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|	ДенежныеСредства.ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент,
	|	ДенежныеСредства.Валюта,
	|	ДенежныеСредства.ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации";
	ТекстыЗапроса.Добавить(ТекстЗапроса, "втДенежныеСредстваВПути");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Подразделение КАК Подразделение,
	|	ДенежныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК Получатель,
	|	НЕОПРЕДЕЛЕНО КАК Отправитель,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ДенежныеСредства.СуммаУпр
	|			ИНАЧЕ -ДенежныеСредства.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаУпр > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДенежныеСредстваВПути
	|ИЗ
	|	втДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.СуммаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ДенежныеСредства.Период КАК Период,
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Подразделение КАК Подразделение,
	|	ДенежныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК Получатель,
	|	НЕОПРЕДЕЛЕНО КАК Отправитель,
	|	ДенежныеСредства.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ДенежныеСредства.Контрагент КАК Контрагент,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ДенежныеСредства.СуммаРегл
	|			ИНАЧЕ -ДенежныеСредства.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаРегл > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредства.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ДенежныеСредства.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	втДенежныеСредстваВПути КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.СуммаРегл <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаФинансовыеИнструменты(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаФинансовыеИнструменты";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ФинансовыеИнструменты.ВидДвижения,
	|	ФинансовыеИнструменты.Период КАК Период,
	|	ФинансовыеИнструменты.АналитикаУчетаПоПартнерам,
	|	ФинансовыеИнструменты.Договор КАК Договор,
	|	ФинансовыеИнструменты.Договор.Подразделение КАК Подразделение,
	|	ФинансовыеИнструменты.Договор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Договор) = ТИП(Справочник.ДоговорыКредитовИДепозитов)
	|		ТОГДА ВЫРАЗИТЬ(ФинансовыеИнструменты.Договор КАК Справочник.ДоговорыКредитовИДепозитов).ХарактерДоговора
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ХарактерДоговора,
	|	ФинансовыеИнструменты.ТипСуммы КАК ТипСуммы,
	|	ФинансовыеИнструменты.Договор.ВалютаВзаиморасчетов КАК Валюта,
	|	ФинансовыеИнструменты.Сумма КАК Сумма,
	|	ФинансовыеИнструменты.СуммаУпр КАК СуммаУпр,
	|	ФинансовыеИнструменты.СуммаРегл КАК СуммаРегл,
	|	ФинансовыеИнструменты.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ФинансовыеИнструменты.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаФинансовыеИнструменты
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам КАК ФинансовыеИнструменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ФинансовыеИнструменты.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	(&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
	|		И ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Договор) = ТИП(Справочник.ДоговорыКредитовИДепозитов)
	|	) И ФинансовыеИнструменты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Аналитика.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ФинансовыеИнструменты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаСуммыДисконтирования(ТекстыЗапроса)

	ИмяРегистра = "ТаблицаСуммыДисконтирования";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПроцентныеРасходы.ВидДвижения КАК ВидДвижения,
	|	ПроцентныеРасходы.Период КАК Период,
	|	ПроцентныеРасходы.АналитикаУчетаПоПартнерам,
	|	ПроцентныеРасходы.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ПроцентныеРасходы.ОбъектРасчетов.Договор КАК Договор,
	|	ПроцентныеРасходы.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ПроцентныеРасходы.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПроцентныеРасходы.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ПроцентныеРасходы.Валюта КАК Валюта,
	|	ПроцентныеРасходы.СуммаДисконтирования КАК Сумма,
	|	ПроцентныеРасходы.СуммаДисконтированияУпр КАК СуммаУпр,
	|	ПроцентныеРасходы.СуммаДисконтированияРегл КАК СуммаРегл,
	|	ПроцентныеРасходы.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ПроцентныеРасходы.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаСуммыДисконтирования
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования КАК ПроцентныеРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ПроцентныеРасходы.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	&ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаСуммДисконтирования)
	|	И ПроцентныеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Аналитика.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(ПроцентныеРасходы.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыСКлиентами";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ДолгРегл
	|		ИНАЧЕ ДанныеРегистра.ДолгРегл
	|	КОНЕЦ ДолгРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ДолгУпр
	|		ИНАЧЕ ДанныеРегистра.ДолгУпр
	|	КОНЕЦ ДолгУпр,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаРегл
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаРегл
	|	КОНЕЦ ПредоплатаРегл,
	|	ВЫБОР КОГДА ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -ДанныеРегистра.ПредоплатаУпр
	|		ИНАЧЕ ДанныеРегистра.ПредоплатаУпр
	|	КОНЕЦ ПредоплатаУпр,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДанныеРегистра.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ РасчетыСКлиентами
	|ИЗ
	|	ТаблицаРасчетыСКлиентами КАК ДанныеРегистра";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса = Неопределено, РасчетыСПоставщиками = Ложь)

	ИмяРегистра = "РасчетыСКлиентамиПоОбъектамРасчета";
	
	Если ТекстыЗапроса <> Неопределено Тогда
		Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасчетыСКлиентами", ТекстыЗапроса) Тогда
			Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
				ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоСрокам(ТекстыЗапроса);
			Иначе
				ТекстЗапросаВтТаблицаРасчетыСКлиентамиПоДокументам(ТекстыЗапроса);
			КонецЕсли;
		КонецЕсли;

		Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСКлиентами", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСКлиентами(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентами.Период КАК Период,
	|	РасчетыСКлиентами.Валюта КАК Валюта,
	|	СУММА(РасчетыСКлиентами.ДолгРегл) КАК ДолгРегл,
	|	СУММА(РасчетыСКлиентами.ДолгУпр) КАК ДолгУпр,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(РасчетыСКлиентами.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.Подразделение КАК Подразделение,
	|	Аналитика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	РасчетыСКлиентами.ИдентификаторФинЗаписи,
	|	РасчетыСКлиентами.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ РасчетыСКонтрагентамиПоОбъектамРасчета
	|ИЗ
	|	РасчетыСКлиентами
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|	
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.Период,
	|	РасчетыСКлиентами.Валюта,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.Подразделение,
	|	Аналитика.НаправлениеДеятельности,
	|	РасчетыСКлиентами.ОбъектРасчетов,
	|	Аналитика.Контрагент,
	|	Аналитика.Договор,
	|	РасчетыСКлиентами.ИдентификаторФинЗаписи,
	|	РасчетыСКлиентами.НастройкаХозяйственнойОперации";
	
	Если РасчетыСПоставщиками Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетыСКлиентами", "РасчетыСПоставщиками");
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, "РасчетыСКонтрагентамиПоОбъектамРасчета", "РасчетыСПоставщикамиПоОбъектамРасчета");
	Иначе
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса, "РасчетыСКонтрагентамиПоОбъектамРасчета", "РасчетыСКлиентамиПоОбъектамРасчета");
	КонецЕсли;
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса = Неопределено)

	ИмяРегистра = "РасчетыСПоставщиками";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапросаВтРасчетыСКлиентами(),"РасчетыСКлиентами","РасчетыСПоставщиками");
	
	Если ТекстыЗапроса <> Неопределено Тогда
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса)

	ИмяРегистра = "РасчетыСПоставщикамиПоОбъектамРасчета";

	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаРасчетыСПоставщиками", ТекстыЗапроса) Тогда
		Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоСрокам(ТекстыЗапроса);
		Иначе
			ТекстЗапросаВтТаблицаРасчетыСПоставщикамиПоДокументам(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;

	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСПоставщиками", ТекстыЗапроса) Тогда
		ТекстЗапросаВтРасчетыСПоставщиками(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета( , Истина);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьВременныеТаблицы(ТекстыЗапроса, ГруппаТаблиц = "") Экспорт
	
	Если ГруппаТаблиц = "ДенежныеСредства" ИЛИ ПустаяСтрока(ГруппаТаблиц) Тогда
		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваБезналичные", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваБезналичные(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваНаличные", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваНаличные(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваВКассахККМ", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваВКассахККМ(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваУПодотчетныхЛиц", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваУПодотчетныхЛиц(ТекстыЗапроса);
		КонецЕсли;

		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаДенежныеСредстваВПути", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаДенежныеСредстваВПути(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаФинансовыеИнструменты", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаФинансовыеИнструменты(ТекстыЗапроса);
	КонецЕсли;

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ТаблицаСуммыДисконтирования", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаСуммыДисконтирования(ТекстыЗапроса);
	КонецЕсли;
	
	Если ГруппаТаблиц = "РасчетыСПартнерами" ИЛИ ПустаяСтрока(ГруппаТаблиц) Тогда
		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСКлиентамиПоОбъектамРасчета", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСКлиентамиПоОбъектамРасчета(ТекстыЗапроса);
		КонецЕсли;
		Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("РасчетыСПоставщикамиПоОбъектамРасчета", ТекстыЗапроса) Тогда
			ТекстЗапросаВтРасчетыСПоставщикамиПоОбъектамРасчета(ТекстыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ДобавитьВременныеТаблицы(ТекстыЗапроса, ГруппаТаблиц);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаПрочиеДоходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ПрочиеДоходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) КАК СтатьяДоходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА &УправленческийУчетОрганизаций
	|			ТОГДА ВложенныйЗапрос.Сумма
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаУпр,
	|	СУММА(ВЫБОР
	|		КОГДА &ИспользоватьУчетПрочихДоходовРасходов
	|			ТОГДА ВложенныйЗапрос.СуммаРегл
	|		ИНАЧЕ 0 КОНЕЦ) КАК СуммаРегл,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаДоходов,
	|		Таблица.СуммаУпр КАК Сумма,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаСуммыДисконтирования КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с клиентами
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаДоходов,
	|		Таблица.ДолгУпр КАК Сумма,
	|		Таблица.ДолгРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр > 0 ИЛИ Таблица.ДолгРегл > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	// Курсовые разницы от расчетов с клиентами: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаДоходов,
	|		-Таблица.ПредоплатаУпр КАК Сумма,
	|		-Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр < 0 ИЛИ Таблица.ПредоплатаРегл < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с поставщиками
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаДоходов,
	|		-Таблица.ДолгУпр КАК Сумма,
	|		-Таблица.ДолгРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр < 0 ИЛИ Таблица.ДолгРегл < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	// Курсовые разницы от расчетов с поставщиками: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаДоходов,
	|		Таблица.ПредоплатаУпр КАК Сумма,
	|		Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр > 0 ИЛИ Таблица.ПредоплатаРегл > 0
	|И &ОбъединениеСТаблицамиЛокализации
	|
	|	) КАК ВложенныйЗапрос
	|
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	РасчетКурсовыхРазницЛокализация.ДополнитьОбъединениеТаблицЗапросаПрочиеДоходы(ТекстЗапроса);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(ТекстыЗапроса)

	ИмяРегистра = "ВтИсходныеПрочиеРасходы";
	
	ДобавитьВременныеТаблицы(ТекстыЗапроса);
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстОписаниеВтИсходныеПрочиеРасходы();
	ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) КАК СтатьяРасходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаСНДС,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДСУпр,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаСНДСРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаБезНДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	СУММА(ВложенныйЗапрос.ВременнаяРазница) КАК ВременнаяРазница,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи         КАК ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) КАК АналитикаРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.СуммаРегл КАК ВременнаяРазница,
	|		&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		ТаблицаСуммыДисконтирования КАК Таблица
	|	ГДЕ
	|		Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Курсовые разницы от расчетов с клиентами
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаРасходов,
	|		-Таблица.ДолгУпр КАК СуммаУпр,
	|		-Таблица.ДолгРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл < 0 ИЛИ Таблица.ДолгУпр < 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Курсовые разницы от расчетов с клиентами: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами) КАК АналитикаРасходов,
	|		Таблица.ПредоплатаУпр КАК СуммаУпр,
	|		Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл > 0 ИЛИ Таблица.ПредоплатаУпр > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	//Курсовые разницы от расчетов с поставщиками
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаРасходов,
	|		Таблица.ДолгУпр КАК СуммаУпр,
	|		Таблица.ДолгРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл > 0 ИЛИ Таблица.ДолгУпр > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	//Курсовые разницы от расчетов с поставщиками: ошибки округления, возврат авансов
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) КАК АналитикаРасходов,
	|		-Таблица.ПредоплатаУпр КАК СуммаУпр,
	|		-Таблица.ПредоплатаРегл КАК СуммаРегл,
	|		0 КАК ВременнаяРазница,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) КАК ХозяйственнаяОперация,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|		Таблица.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл < 0 ИЛИ Таблица.ПредоплатаУпр < 0
	|И &ОбъединениеСТаблицамиЛокализации
	|
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи,
	|	ВложенныйЗапрос.НастройкаХозяйственнойОперации
	|";
	
	РасчетКурсовыхРазницЛокализация.ДополнитьОбъединениеТаблицЗапросаИсходныеПрочиеРасходы(ТекстЗапроса);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПрочиеРасходы(ТекстыЗапроса)
	
	ИмяРегистра = "ВтПрочиеРасходы";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаВтПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса, Регистры = Неопределено)
	
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ДвиженияКонтрагентДоходыРасходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса, "РасчетыСПартнерами");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|
	|	РегистрАналитики.Партнер КАК Партнер,
	|	РегистрАналитики.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	ВложенныйЗапрос.Валюта КАК ВалютаВзаиморасчетов,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРеглБезНДС,
	|
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ИсточникГФУРасчетов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР 
	|			КОГДА Таблица.ДолгУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ДолгУпр < 0
	|			ТОГДА -Таблица.ДолгУпр
	|			ИНАЧЕ Таблица.ДолгУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР 
	|			КОГДА Таблица.ДолгРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ДолгРегл < 0
	|			ТОГДА -Таблица.ДолгРегл
	|			ИНАЧЕ Таблица.ДолгРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ Таблица.ПредоплатаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСПоставщиками)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ Таблица.ПредоплатаРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСПоставщикамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгУпр > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ДолгУпр < 0
	|			ТОГДА -Таблица.ДолгУпр
	|			ИНАЧЕ Таблица.ДолгУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ДолгРегл > 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ДолгРегл < 0
	|			ТОГДА -Таблица.ДолгРегл
	|			ИНАЧЕ Таблица.ДолгРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ДолгРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаУпр < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ПредоплатаУпр < 0
	|			ТОГДА -Таблица.ПредоплатаУпр
	|			ИНАЧЕ Таблица.ПредоплатаУпр
	|		КОНЕЦ КАК СуммаУпр,
	|		0 КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаУпр <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|			ИНАЧЕ
	|				НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.РасчетыСКлиентами)
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ПредоплатаРегл < 0 ТОГДА
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		0 КАК СуммаУпр,
	|		ВЫБОР КОГДА Таблица.ПредоплатаРегл < 0
	|			ТОГДА -Таблица.ПредоплатаРегл
	|			ИНАЧЕ Таблица.ПредоплатаРегл
	|		КОНЕЦ КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		РасчетыСКлиентамиПоОбъектамРасчета КАК Таблица
	|	ГДЕ
	|		Таблица.ПредоплатаРегл <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКредитыИЗаймыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКредитыИЗаймыУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.Договор КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыЗаймыВыданныеПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыЗаймыВыданныеУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.Договор КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы) 
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.ЗаймВыданный)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|		Таблица.Подразделение КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Таблица.Договор КАК Договор,
	|		Таблица.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Таблица.Валюта КАК Валюта,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты) 
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|		Таблица.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи
	|	ИЗ
	|		ТаблицаСуммыДисконтирования КАК Таблица
	|	ГДЕ
	|		Таблица.СуммаРегл <> 0 ИЛИ Таблица.СуммаУпр <> 0
	|	) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитики
	|		ПО ВложенныйЗапрос.АналитикаУчетаПоПартнерам = РегистрАналитики.КлючАналитики
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	РегистрАналитики.Контрагент,
	|	РегистрАналитики.Партнер,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.ИдентификаторФинЗаписи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";


	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(ТекстыЗапроса, Регистры = Неопределено)

	ИмяРегистра = "ДвиженияДенежныеСредстваДоходыРасходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ДобавитьВременныеТаблицы(ТекстыЗапроса, "ДенежныеСредства");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Подразделение КАК ПодразделениеДоходовРасходов,
	|
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиДС,
	|	ВложенныйЗапрос.ДенежныеСредства КАК ДенежныеСредства,
	|	ВложенныйЗапрос.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов КАК АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	СУММА(ВложенныйЗапрос.СуммаУпр) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаРегл) КАК СуммаРегл,
	|	0 КАК СуммаВВалюте,
	|	
	|	ВложенныйЗапрос.ИсточникГФУДенежныхСредств КАК ИсточникГФУДенежныхСредств,
	|	ВложенныйЗапрос.ИсточникГФУДоходовРасходов КАК ИсточникГФУДоходовРасходов
	|
	|ИЗ (
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток) 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.БанковскийСчет КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|		Таблица.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.БанковскийСчет КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваБезналичные КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Касса КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|		Таблица.Касса.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Касса КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваНаличные КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток) 
	|		КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.КассаККМ КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|		Таблица.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.КассаККМ КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваВКассахККМ КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.ПодотчетноеЛицо КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.ПодотчетноеЛицо КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваУПодотчетныхЛиц КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Контрагент КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваВПути) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ДенежныеСредства)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Контрагент КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаДенежныеСредстваВПути КАК Таблица
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период КАК Период,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДепозитыПрибыль)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДепозитыУбыток)
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль) 
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток) 
	|		КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|		Таблица.Договор КАК ДенежныеСредства,
	|		Таблица.Подразделение КАК Подразделение,
	|		Значение(Перечисление.ТипыДенежныхСредств.Депозиты) КАК ТипДенежныхСредств,
	|		Таблица.Валюта КАК Валюта,
	|
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК СтатьяДоходовРасходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты)
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК АналитикаДоходов,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.АналитикаКурсовыхРазниц.ФинансовыеИнструменты)
	|		КОНЕЦ КАК АналитикаРасходов,
	|
	|		Таблица.СуммаУпр КАК СуммаУпр,
	|		Таблица.СуммаРегл КАК СуммаРегл,
	|
	|		Таблица.Договор КАК ИсточникГФУДенежныхСредств,
	|		ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.КурсовыеРазницы)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.КурсовыеРазницы)
	|		КОНЕЦ КАК ИсточникГФУДоходовРасходов
	|	
	|	ИЗ
	|		ТаблицаФинансовыеИнструменты КАК Таблица
	|	ГДЕ
	|		Таблица.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Депозит)
	|И &ОбъединениеСТаблицамиЛокализации
	|
	|	) КАК ВложенныйЗапрос
	|
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|	И &ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ХозяйственнаяОперация,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.ДенежныеСредства,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.ТипДенежныхСредств,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.СтатьяДоходовРасходов,
	|	ВложенныйЗапрос.АналитикаДоходов,
	|	ВложенныйЗапрос.АналитикаРасходов,
	|	ВложенныйЗапрос.ИсточникГФУДенежныхСредств,
	|	ВложенныйЗапрос.ИсточникГФУДоходовРасходов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Период";
	
	РасчетКурсовыхРазницЛокализация.ДополнитьОбъединениеТаблицЗапросаДвиженияДенежныеСредстваДоходыРасходы(ТекстЗапроса);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область РасчетКурсовыхРазниц

Процедура ВыполнитьРасчетКурсовыхРазниц(ДокументСсылка, ИменаРегистров, АналитикаРасчета = Неопределено, КоличествоОбработанныхЭлементов = 0)
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	Запрос.УстановитьПараметр("ИменаРегистров", ИменаРегистров);
	Если ТипЗнч(АналитикаРасчета) = Тип("Структура") Тогда
		АналитикаУчетаПоПартнерам = ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета);
		КлючиОрганизации = ПолучитьСсылкиСправочника("КлючиАналитикиУчетаПоПартнерам", АналитикаУчетаПоПартнерам, Запрос.Параметры.Организация);
		Если ЗначениеЗаполнено(КлючиОрганизации) Тогда
			Запрос.УстановитьПараметр("АналитикаРасчета", КлючиОрганизации);
		КонецЕсли;
		Кассы = ПолучитьАналитику("Кассы", АналитикаРасчета);
		Если ЗначениеЗаполнено(Кассы) Тогда
			Запрос.УстановитьПараметр("Кассы", Кассы);
			Запрос.УстановитьПараметр("ПоВсемКассам", НЕ ЗначениеЗаполнено(Кассы));
		КонецЕсли;
		ФизическиеЛица = ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета);
		Если ЗначениеЗаполнено(ФизическиеЛица) Тогда
			Запрос.УстановитьПараметр("ПодотчетныеЛица", ФизическиеЛица);
			Запрос.УстановитьПараметр("ПоВсемПодотчетнымЛицам", НЕ ЗначениеЗаполнено(ФизическиеЛица));
		КонецЕсли;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ПодготовитьНаборыЗаписейКРасчету(ДокументСсылка, ИменаРегистров, АналитикаРасчета);
		РассчитатьКурсовыеРазницы(Запрос.Параметры, КоличествоОбработанныхЭлементов);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = НСтр("ru = 'Не удалось выполнить расчет курсовых разниц по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Расчет курсовых разниц'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			ДокументСсылка.Метаданные(),
			ДокументСсылка,
			ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницы(Знач Параметры, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	ВсеТипыДокументов = Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы());
	Если ВсеТипыДокументов.СодержитТип(ТипЗнч(Параметры)) Тогда
		ЗапросПараметров = Новый Запрос;
		ЗапросПараметров.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗаполнитьПараметрыИнициализации(ЗапросПараметров, Параметры);
		Параметры = ЗапросПараметров.Параметры;
	КонецЕсли;
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru='Расчет курсовых разниц'"), Параметры.ИменаРегистров);
	
	РасчетКурсовыхРазниц = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Документ.РасчетКурсовыхРазниц.МодульМенеджера.РасчетКурсовыхРазниц");
	
	Запрос = ИнициализироватьЗапросКурсовыхРазниц(Параметры);
	Если Запрос <> Неопределено Тогда
		ДниПереоценки = ДниПереоценки(Параметры);
		Для Каждого День Из ДниПереоценки Цикл
			
			МенеджерТаблиц = Новый МенеджерВременныхТаблиц;
			
			Запрос.МенеджерВременныхТаблиц = МенеджерТаблиц;
			Запрос.УстановитьПараметр("НачалоПериода", День.Дата);
			Запрос.УстановитьПараметр("КонецПериода" , КонецДня(День.Дата));
			Запрос.УстановитьПараметр("ГраницаНачалоПериода", Новый Граница(День.Дата, ВидГраницы.Включая));
			Запрос.УстановитьПараметр("ГраницаКонецПериода" , Новый Граница(КонецДня(День.Дата), ВидГраницы.Включая));
			
			Запрос.ВыполнитьПакет();
			
			Для Каждого Регистр Из Параметры.ИменаРегистров Цикл
				ВсегоЗаписано = ЗаписатьДвижения(Параметры.Ссылка, МенеджерТаблиц, Регистр.Ключ, День.Дата);
				КоличествоОбработанныхЭлементов = КоличествоОбработанныхЭлементов + ВсегоЗаписано;
			КонецЦикла;
			
			МенеджерТаблиц.Закрыть();
			
		КонецЦикла;
	КонецЕсли;
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(РасчетКурсовыхРазниц, КоличествоОбработанныхЭлементов/1000);
	
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницыПоСрокам(Организация, Дата, Операция, ПереоценкаПоДням = Неопределено, КоличествоОбработанныхЭлементов = 0) Экспорт
	
	МассивОрганизаций = Организация;
	Если Организация = Неопределено Тогда
		МассивОрганизаций = Справочники.Организации.ДоступныеОрганизации(Истина);
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		МассивОрганизаций = Новый Массив;
		МассивОрганизаций.Добавить(Организация);
	КонецЕсли;
	
	РасчетыСКлиентами = Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами;
	
	ПараметрыПереоценки = ОперативныеВзаиморасчетыСервер.ПараметрыПереоценки(РасчетыСКлиентами, ПереоценкаПоДням);
	ПараметрыПереоценки.ПереоценкаПоДням = ПереоценкаПоДням;
	ОперативныеВзаиморасчетыСервер.ВыполнитьПереоценкуЗаПериод(МассивОрганизаций, НачалоМесяца(Дата), КонецМесяца(Дата), ПараметрыПереоценки);
	
КонецПроцедуры

// Определяет дни в которые необходимо переоценить текущие остатки для заданной хоз. операции:
// - для переоценки "На дату оплаты и на конец месяца" - дни в которые были оплаты в валюте и последнее число месяца.
// - для переоценки "На каждый день месяца" - дни в которые были оплаты в валюте и дни в которые менялся курс.
//
// Параметры:
//  <Параметры>  - структура с обязательными ключами:
//                 НачалоПериода - <Дата> - задает начало периода поиска дат переоценки.
//                 КонецПериода - <Дата> - задает конец периода поиска дат переоценки.
//                 Организация - <Справочник.Организации> - организация по которой необходимо переоценивать остатки.
//                 ПереоценкаПоДням - <Булево> - Истина - датами переоценки являются все даты изменения курсов валют и
//                                               даты оплат, иначе только даты оплаты.
//                 ХозяйственнаяОперация - <Перечисление.ХозяйственныеОперации> - задает регистр накопления о которому
//                                                                                определяются даты оплаты.
//                 АналитикаРасчета - <Массив> - ключи аналитики организации по которой необходимо переоценивать остатки.
//
// Возвращаемое значение:
//   ТаблицаЗначений - с одной колонкой "Дата" типа <Дата>.
//
Функция ДниПереоценки(Параметры)
	
	ОбъединитьВсе = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	
	ТекстЗапроса = "";
	Если Параметры.ИменаРегистров.Свойство("РасчетыСПоставщикамиПоСрокам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты поставщикам в валюте
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	ДАТАВРЕМЯ(1,1,1) КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыСКлиентамиПоСрокам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты клиентов в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта КАК Валюта,
		|	Расчеты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыСПоставщикамиПоДокументам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты поставщикам в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта КАК Валюта,
		|	Расчеты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ХозяйственнаяОперация В (&ОплатаПоставщику) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыСКлиентамиПоДокументам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Оплаты клиентов в валюте
		|ВЫБРАТЬ
		|	Расчеты.Валюта КАК Валюта,
		|	Расчеты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
		|ГДЕ
		|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
		|	И (Расчеты.ХозяйственнаяОперация В (&ОплатаКлиента) ИЛИ &ПереоценкаПоДням)
		|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И Расчеты.Долг <> 0
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваБезналичные") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Безналичные денежные средства
		|ВЫБРАТЬ
		|	БезналичныеДС.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
		|	БезналичныеДС.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК БезналичныеДС
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваНаличные") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Наличные денежные средства
		|ВЫБРАТЬ
		|	НаличныеДС.Касса.ВалютаДенежныхСредств КАК Валюта,
		|	НаличныеДС.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
		|				И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК НаличныеДС
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваВКассахККМ") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Денежные средства в кассах ККМ
		|ВЫБРАТЬ
		|	ДСвКассахККМ.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
		|	ДСвКассахККМ.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
		|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСвКассахККМ
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваВПути") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Денежные средства в пути
		|ВЫБРАТЬ
		|	ДСвПути.Валюта КАК Валюта,
		|	ДСвПути.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСвПути
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ДенежныеСредстваУПодотчетныхЛиц") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"// Денежные средства у подотчетных лиц
		|ВЫБРАТЬ
		|	ДСуПодотчетныхЛиц.Валюта КАК Валюта,
		|	ДСуПодотчетныхЛиц.Период
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			Организация = &Организация
		|				И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
		|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
		|	) КАК ДСуПодотчетныхЛиц
		|";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("РасчетыПоФинансовымИнструментам") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	РасчетыПоКредитамДепозитам.Договор.ВалютаВзаиморасчетов КАК Валюта,
		|	РасчетыПоКредитамДепозитам.Период
		|ИЗ
		|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			ДЕНЬ,
		|			АналитикаУчетаПоПартнерам.Организация = &Организация
		|				И (Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета
		|					ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
		|				И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов)
		|	) КАК РасчетыПоКредитамДепозитам";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ИменаРегистров.Свойство("ПроцентныеРасходыДисконтирования") Тогда
		ПервыйЗапрос = ПустаяСтрока(ТекстЗапроса);
		ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос,"",ОбъединитьВсе) +
		"ВЫБРАТЬ
		|	СуммыДисконтирования.Валюта КАК Валюта,
		|	СуммыДисконтирования.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ПроцентныеРасходыДисконтирования КАК СуммыДисконтирования
		|ГДЕ
		|	СуммыДисконтирования.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СуммыДисконтирования.Валюта <> &ВалютаУправленческогоУчета
		|	И (СуммыДисконтирования.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ИЛИ &ПереоценкаПоДням)
		|	И СуммыДисконтирования.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
		|	И СуммыДисконтирования.СуммаДисконтирования <> 0";
		Если ПервыйЗапрос Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","ПОМЕСТИТЬ втОборотыВалюты" + Символы.ПС + "ИЗ");
		КонецЕсли;
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ДополнитьДниПереоценки(Параметры.ИменаРегистров, ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапроса + 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(втОборотыВалюты.Период, ДЕНЬ) КАК Дата
	|ИЗ
	|	втОборотыВалюты КАК втОборотыВалюты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КурсыВалют.Период
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ПереоценкаПоДням
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("ГраницаНачалоПериода", Новый Граница(Параметры.НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКонецПериода",  Новый Граница(Параметры.КонецПериода,  ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Возврат Выборка;
	
КонецФункции

Функция ИнициализироватьЗапросКурсовыхРазниц(Параметры)
	
	ТекстыЗапросов = Новый Массив;
	Для Каждого Регистр Из Параметры.ИменаРегистров Цикл
			
		Если Регистр.Ключ = "РасчетыСПоставщикамиПоДокументам" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиПоДокументам());
			
		ИначеЕсли Регистр.Ключ = "РасчетыСКлиентамиПоДокументам" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыРасчетыСКлиентамиПоДокументам());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваБезналичные" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваБезналичные());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваНаличные" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваНаличные());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваВКассахККМ" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваУПодотчетныхЛиц" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваУПодотчетныхЛиц());
			
		ИначеЕсли Регистр.Ключ = "ДенежныеСредстваВПути" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыДенежныеСредстваВПути());
			
		ИначеЕсли Регистр.Ключ = "РасчетыПоФинансовымИнструментам" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыРасчетыПоФинансовымИнструментам());
			
		ИначеЕсли Регистр.Ключ = "ПроцентныеРасходыДисконтирования" Тогда
			ТекстыЗапросов.Добавить(ТекстЗапросаКурсовыеРазницыПроцентныеРасходыДисконтирования());
		КонецЕсли;
	
		РасчетКурсовыхРазницЛокализация.ДополнитьЗапросКурсовыхРазниц(Регистр.Ключ, ТекстыЗапросов);
		
	КонецЦикла;
	
	Если ТекстыЗапросов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов);
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Возврат Запрос;
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиПоДокументам()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаПоПартнерам КАК КлючАналитики,
	|	Расчеты.ЗаказПоставщику КАК ОбъектРасчетов
	|ПОМЕСТИТЬ втАналитикаЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.ХозяйственнаяОперация В (&ОплатаПоставщику)
	|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И Расчеты.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику КАК Заказ,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток КАК Долг,
	|	ОстаткиДня.ДолгРеглОстаток КАК ДолгРегл,
	|	ОстаткиДня.ДолгУпрОстаток КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр
	|ПОМЕСТИТЬ втОстаткиНаКонецДня
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказПоставщику = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток <> 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток,
	|	ОстаткиДня.ДолгРеглОстаток,
	|	ОстаткиДня.ДолгУпрОстаток,
	|	0,
	|	0
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказПоставщику = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток = 0
	|	И (ОстаткиДня.ДолгРеглОстаток <> 0 ИЛИ ОстаткиДня.ДолгУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказПоставщику,
	|	ОстаткиДня.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ОстаткиДня.ПредоплатаРеглОстаток,
	|	ОстаткиДня.ПредоплатаУпрОстаток
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|ГДЕ
	|	ОстаткиДня.КВозвратуОстаток = 0
	|	И ОстаткиДня.ПредоплатаОстаток = 0
	|	И (ОстаткиДня.ПредоплатаРеглОстаток <> 0 ИЛИ ОстаткиДня.ПредоплатаУпрОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - Остатки.ДолгРегл КАК ДолгРегл,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - Остатки.ДолгУпр КАК ДолгУпр
	|
	|ПОМЕСТИТЬ втНеРеализованныеКР
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|ГДЕ
	|	Остатки.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК ЗаказПоставщику,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	0 КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаРасчетов
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл < 0
	|		ТОГДА -Остатки.ПредоплатаРегл
	|		ИНАЧЕ Остатки.ПредоплатаРегл
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр < 0
	|		ТОГДА -Остатки.ПредоплатаУпр
	|		ИНАЧЕ Остатки.ПредоплатаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.ДолгРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.ЗаказПоставщику,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	СУММА(ТаблицаРасчетов.ДолгРегл) КАК ДолгРегл,
	|	СУММА(ТаблицаРасчетов.ДолгУпр) КАК ДолгУпр,
	|	СУММА(ТаблицаРасчетов.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(ТаблицаРасчетов.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация
	|ПОМЕСТИТЬ КурсовыеРазницыРасчетыСПоставщикамиПоДокументам
	|ИЗ
	|	ТаблицаРасчетов КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	ТаблицаРасчетов.ЗаказПоставщику,
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыРасчетыСКлиентамиПоДокументам()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.АналитикаУчетаПоПартнерам КАК КлючАналитики,
	|	Расчеты.ЗаказКлиента КАК ОбъектРасчетов
	|ПОМЕСТИТЬ втАналитикаЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУправленческогоУчета ИЛИ Расчеты.Валюта <> &ВалютаРегламентированногоУчета)
	|	И Расчеты.ХозяйственнаяОперация В (&ОплатаКлиента)
	|	И Расчеты.АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|	И Расчеты.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента КАК Заказ,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток КАК Долг,
	|	ОстаткиДня.ДолгРеглОстаток КАК ДолгРегл,
	|	ОстаткиДня.ДолгУпрОстаток КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр
	|ПОМЕСТИТЬ втОстаткиНаКонецДня
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|		И ОстаткиДня.ЗаказКлиента = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток <> 0
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента,
	|	ОстаткиДня.РасчетныйДокумент,
	|	ОстаткиДня.ДолгОстаток,
	|	ОстаткиДня.ДолгРеглОстаток,
	|	ОстаткиДня.ДолгУпрОстаток,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАналитикаЗаДень КАК АналитикаДня
	|		ПО ОстаткиДня.АналитикаУчетаПоПартнерам = АналитикаДня.КлючАналитики
	|			И ОстаткиДня.ЗаказКлиента = АналитикаДня.ОбъектРасчетов
	|ГДЕ
	|	ОстаткиДня.ДолгОстаток = 0
	|	И (ОстаткиДня.ДолгРеглОстаток <> 0 ИЛИ ОстаткиДня.ДолгУпрОстаток <> 0)
	|	И (НЕ АналитикаДня.КлючАналитики ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиДня.Валюта,
	|	&КонецПериода,
	|	ОстаткиДня.АналитикаУчетаПоПартнерам,
	|	ОстаткиДня.ЗаказКлиента,
	|	ОстаткиДня.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ОстаткиДня.ПредоплатаРеглОстаток,
	|	ОстаткиДня.ПредоплатаУпрОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам В (&АналитикаРасчета)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиДня
	|ГДЕ
	|	ОстаткиДня.КВозвратуОстаток = 0
	|	И ОстаткиДня.ПредоплатаОстаток = 0
	|	И (ОстаткиДня.ПредоплатаРеглОстаток <> 0 ИЛИ ОстаткиДня.ПредоплатаУпрОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - Остатки.ДолгРегл КАК ДолгРегл,
	|	(ВЫРАЗИТЬ(Остатки.Долг * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - Остатки.ДолгУпр КАК ДолгУпр
	|ПОМЕСТИТЬ втНеРеализованныеКР
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|			ПО Остатки.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|			ПО (ИСТИНА)
	|ГДЕ
	|	Остатки.Долг <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ КАК ЗаказКлиента,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	0 КАК ДолгУпр,
	|	0 КАК ПредоплатаРегл,
	|	0 КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА Остатки.ДолгРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ТаблицаРасчетов
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.Долг = 0 И Остатки.ДолгУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл < 0
	|		ТОГДА -Остатки.ПредоплатаРегл
	|		ИНАЧЕ Остатки.ПредоплатаРегл
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр < 0
	|		ТОГДА -Остатки.ПредоплатаУпр
	|		ИНАЧЕ Остатки.ПредоплатаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.ПредоплатаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаКонецДня КАК Остатки
	|ГДЕ
	|	Остатки.ПредоплатаУпр <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.ДолгРегл < 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА -Остатки.ДолгРегл
	|		ИНАЧЕ Остатки.ДолгРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгРегл < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.Заказ,
	|	Остатки.РасчетныйДокумент,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА -Остатки.ДолгУпр
	|		ИНАЧЕ Остатки.ДолгУпр
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР КОГДА Остатки.ДолгУпр < 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль)
	|	КОНЕЦ
	|ИЗ
	|	втНеРеализованныеКР КАК Остатки
	|ГДЕ
	|	Остатки.ДолгУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения,
	|	ТаблицаРасчетов.Период КАК Период,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.ЗаказКлиента,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	СУММА(ТаблицаРасчетов.ДолгРегл) КАК ДолгРегл,
	|	СУММА(ТаблицаРасчетов.ДолгУпр) КАК ДолгУпр,
	|	СУММА(ТаблицаРасчетов.ПредоплатаРегл) КАК ПредоплатаРегл,
	|	СУММА(ТаблицаРасчетов.ПредоплатаУпр) КАК ПредоплатаУпр,
	|	ТаблицаРасчетов.ХозяйственнаяОперация
	|ПОМЕСТИТЬ КурсовыеРазницыРасчетыСКлиентамиПоДокументам
	|ИЗ
	|	ТаблицаРасчетов КАК ТаблицаРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасчетов.Период,
	|	ТаблицаРасчетов.ХозяйственнаяОперация,
	|	ТаблицаРасчетов.АналитикаУчетаПоПартнерам,
	|	ТаблицаРасчетов.РасчетныйДокумент,
	|	ТаблицаРасчетов.ЗаказКлиента,
	|	ТаблицаРасчетов.Валюта,
	|	ТаблицаРасчетов.ВидДвижения"
	+"
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваБезналичные()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.БанковскийСчет КАК Счет
	|ПОМЕСТИТЬ СчетаЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.БанковскийСчет КАК БанковскийСчет,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр
	|
	|ПОМЕСТИТЬ втОстаткиБезналичных
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗаДень
	|		ПО ОстаткиНаДень.БанковскийСчет = СчетаЗаДень.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|		ПО ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ СчетаЗаДень.Счет ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.БанковскийСчет.ВалютаДенежныхСредств,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.БанковскийСчет,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗаДень
	|		ПО ОстаткиНаДень.БанковскийСчет = СчетаЗаДень.Счет
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ СчетаЗаДень.Счет ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.БанковскийСчет КАК БанковскийСчет,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаБезналичныхДС
	|ИЗ
	|	втОстаткиБезналичных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.БанковскийСчет,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиБезналичных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаБезналичныхДС.Валюта,
	|	ТаблицаБезналичныхДС.ВидДвижения,
	|	ТаблицаБезналичныхДС.Период КАК Период,
	|	ТаблицаБезналичныхДС.Организация,
	|	ТаблицаБезналичныхДС.БанковскийСчет,
	|	СУММА(ТаблицаБезналичныхДС.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаБезналичныхДС.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаБезналичныхДС.ХозяйственнаяОперация,
	|	ТаблицаБезналичныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаБезналичныхДС.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваБезналичные
	|ИЗ
	|	ТаблицаБезналичныхДС КАК ТаблицаБезналичныхДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаБезналичныхДС.Валюта,
	|	ТаблицаБезналичныхДС.Период,
	|	ТаблицаБезналичныхДС.Организация,
	|	ТаблицаБезналичныхДС.БанковскийСчет,
	|	ТаблицаБезналичныхДС.ХозяйственнаяОперация,
	|	ТаблицаБезналичныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаБезналичныхДС.ВидДвижения,
	|	ТаблицаБезналичныхДС.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваНаличные()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Касса КАК Касса
	|ПОМЕСТИТЬ КассыЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Касса.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Касса КАК Касса,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр
	|
	|ПОМЕСТИТЬ втОстаткиНаличных
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыЗаДень
	|		ПО ОстаткиНаДень.Касса = КассыЗаДень.Касса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Касса.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ КассыЗаДень.Касса ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Касса.ВалютаДенежныхСредств,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.Касса,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
	|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|				ИЛИ Касса.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыЗаДень
	|		ПО ОстаткиНаДень.Касса = КассыЗаДень.Касса
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ КассыЗаДень.Касса ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Касса КАК Касса,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаНаличныхДС
	|ИЗ
	|	втОстаткиНаличных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Касса,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиНаличных КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНаличныхДС.Валюта,
	|	ТаблицаНаличныхДС.ВидДвижения,
	|	ТаблицаНаличныхДС.Период КАК Период,
	|	ТаблицаНаличныхДС.Организация,
	|	ТаблицаНаличныхДС.Касса,
	|	СУММА(ТаблицаНаличныхДС.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаНаличныхДС.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаНаличныхДС.ХозяйственнаяОперация,
	|	ТаблицаНаличныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаНаличныхДС.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваНаличные
	|ИЗ
	|	ТаблицаНаличныхДС КАК ТаблицаНаличныхДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНаличныхДС.Валюта,
	|	ТаблицаНаличныхДС.Период,
	|	ТаблицаНаличныхДС.Организация,
	|	ТаблицаНаличныхДС.Касса,
	|	ТаблицаНаличныхДС.ХозяйственнаяОперация,
	|	ТаблицаНаличныхДС.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаНаличныхДС.ВидДвижения,
	|	ТаблицаНаличныхДС.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваВКассахККМ()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ КассыККМЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.КассаККМ КАК Касса,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр
	|
	|ПОМЕСТИТЬ втОстаткиВКассахККМ
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|		&ГраницаКонецПериода,
	|		Организация = &Организация
	|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета 
	|				ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМЗаДень
	|		ПО ОстаткиНаДень.КассаККМ = КассыККМЗаДень.КассаККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|		ПО ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|		ПО ИСТИНА
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ КассыККМЗаДень.КассаККМ ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|		ИЛИ ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.КассаККМ.ВалютаДенежныхСредств,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.КассаККМ,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУправленческогоУчета
	|					ИЛИ КассаККМ.ВалютаДенежныхСредств <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМЗаДень
	|		ПО ОстаткиНаДень.КассаККМ = КассыККМЗаДень.КассаККМ
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ КассыККМЗаДень.КассаККМ ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Касса КАК Касса,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаДСВКассахККМ
	|ИЗ
	|	втОстаткиВКассахККМ КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Касса,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиВКассахККМ КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСВКассахККМ.Валюта,
	|	ТаблицаДСВКассахККМ.ВидДвижения,
	|	ТаблицаДСВКассахККМ.Период КАК Период,
	|	ТаблицаДСВКассахККМ.Организация,
	|	ТаблицаДСВКассахККМ.Касса КАК КассаККМ,
	|	СУММА(ТаблицаДСВКассахККМ.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСВКассахККМ.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДСВКассахККМ.ХозяйственнаяОперация,
	|	ТаблицаДСВКассахККМ.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСВКассахККМ.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваВКассахККМ
	|ИЗ
	|	ТаблицаДСВКассахККМ КАК ТаблицаДСВКассахККМ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСВКассахККМ.Валюта,
	|	ТаблицаДСВКассахККМ.Период,
	|	ТаблицаДСВКассахККМ.Организация,
	|	ТаблицаДСВКассахККМ.Касса,
	|	ТаблицаДСВКассахККМ.ХозяйственнаяОперация,
	|	ТаблицаДСВКассахККМ.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСВКассахККМ.ВидДвижения,
	|	ТаблицаДСВКассахККМ.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваУПодотчетныхЛиц()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ОборотыЗаДень.Подразделение КАК Подразделение,
	|	ОборотыЗаДень.ЦельВыдачи КАК ЦельВыдачи
	|
	|ПОМЕСТИТЬ ПодотчетникиЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|ГДЕ
	|	ОборотыЗаДень.СуммаОборот <> 0
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ОстаткиНаДень.Подразделение КАК Подразделение,
	|	ОстаткиНаДень.ЦельВыдачи КАК ЦельВыдачи,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр
	|
	|ПОМЕСТИТЬ втОстаткиУПодотчетныхЛиц
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодотчетникиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ПодотчетникиЗаДень.Организация
	|			И ОстаткиНаДень.ПодотчетноеЛицо = ПодотчетникиЗаДень.ПодотчетноеЛицо
	|			И ОстаткиНаДень.Подразделение = ПодотчетникиЗаДень.Подразделение
	|			И ОстаткиНаДень.ЦельВыдачи = ПодотчетникиЗаДень.ЦельВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ ПодотчетникиЗаДень.ПодотчетноеЛицо ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.ПодотчетноеЛицо,
	|	ОстаткиНаДень.Подразделение,
	|	ОстаткиНаДень.ЦельВыдачи,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|			И (ПодотчетноеЛицо В (&ПодотчетныеЛица) ИЛИ &ПоВсемПодотчетнымЛицам)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодотчетникиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ПодотчетникиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ПодотчетникиЗаДень.Организация
	|			И ОстаткиНаДень.ПодотчетноеЛицо = ПодотчетникиЗаДень.ПодотчетноеЛицо
	|			И ОстаткиНаДень.Подразделение = ПодотчетникиЗаДень.Подразделение
	|			И ОстаткиНаДень.ЦельВыдачи = ПодотчетникиЗаДень.ЦельВыдачи
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ПодотчетникиЗаДень.ПодотчетноеЛицо ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.ЦельВыдачи КАК ЦельВыдачи,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДСУПодотчетныхЛиц
	|ИЗ
	|	втОстаткиУПодотчетныхЛиц КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.ПодотчетноеЛицо,
	|	Остатки.Подразделение,
	|	Остатки.ЦельВыдачи,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиУПодотчетныхЛиц КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСУПодотчетныхЛиц.Валюта,
	|	ТаблицаДСУПодотчетныхЛиц.ВидДвижения,
	|	ТаблицаДСУПодотчетныхЛиц.Период КАК Период,
	|	ТаблицаДСУПодотчетныхЛиц.Организация,
	|	ТаблицаДСУПодотчетныхЛиц.ПодотчетноеЛицо,
	|	ТаблицаДСУПодотчетныхЛиц.Подразделение,
	|	ТаблицаДСУПодотчетныхЛиц.ЦельВыдачи,
	|	СУММА(ТаблицаДСУПодотчетныхЛиц.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСУПодотчетныхЛиц.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДСУПодотчетныхЛиц.ХозяйственнаяОперация,
	|	ТаблицаДСУПодотчетныхЛиц.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСУПодотчетныхЛиц.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваУПодотчетныхЛиц
	|ИЗ
	|	ТаблицаДСУПодотчетныхЛиц КАК ТаблицаДСУПодотчетныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСУПодотчетныхЛиц.Валюта,
	|	ТаблицаДСУПодотчетныхЛиц.Период,
	|	ТаблицаДСУПодотчетныхЛиц.Организация,
	|	ТаблицаДСУПодотчетныхЛиц.ПодотчетноеЛицо,
	|	ТаблицаДСУПодотчетныхЛиц.Подразделение,
	|	ТаблицаДСУПодотчетныхЛиц.ЦельВыдачи,
	|	ТаблицаДСУПодотчетныхЛиц.ХозяйственнаяОперация,
	|	ТаблицаДСУПодотчетныхЛиц.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСУПодотчетныхЛиц.ВидДвижения,
	|	ТаблицаДСУПодотчетныхЛиц.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыДенежныеСредстваВПути()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.Валюта КАК Валюта,
	|	ОборотыЗаДень.Организация КАК Организация,
	|	ОборотыЗаДень.Получатель КАК Получатель,
	|	ОборотыЗаДень.Отправитель КАК Отправитель,
	|	ОборотыЗаДень.ВидПереводаДенежныхСредств КАК ВидПеревода,
	|	ОборотыЗаДень.Контрагент КАК Контрагент
	|
	|ПОМЕСТИТЬ ДеньгиВПутиЗаДень
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.Организация КАК Организация,
	|	ОстаткиНаДень.Получатель КАК Получатель,
	|	ОстаткиНаДень.Отправитель КАК Отправитель,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Контрагент КАК Контрагент,
	|	ОстаткиНаДень.СуммаОстаток КАК Сумма,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток КАК СуммаРегл,
	|	(ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток КАК СуммаУпр
	|
	|ПОМЕСТИТЬ втОстаткиВПути
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньгиВПутиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ДеньгиВПутиЗаДень.Организация
	|			И ОстаткиНаДень.Получатель = ДеньгиВПутиЗаДень.Получатель
	|			И ОстаткиНаДень.Отправитель = ДеньгиВПутиЗаДень.Отправитель
	|			И ОстаткиНаДень.ВидПереводаДенежныхСредств = ДеньгиВПутиЗаДень.ВидПеревода
	|			И ОстаткиНаДень.Контрагент = ДеньгиВПутиЗаДень.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток <> 0
	|	И (НЕ ДеньгиВПутиЗаДень.Валюта ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаРеглОстаток <> 0
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) - ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	ОстаткиНаДень.Организация,
	|	ОстаткиНаДень.Получатель,
	|	ОстаткиНаДень.Отправитель,
	|	ОстаткиНаДень.ВидПереводаДенежныхСредств,
	|	ОстаткиНаДень.Контрагент,
	|	-ОстаткиНаДень.СуммаОстаток,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
	|			&ГраницаКонецПериода,
	|			Организация = &Организация
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньгиВПутиЗаДень
	|		ПО ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Валюта = ДеньгиВПутиЗаДень.Валюта
	|			И ОстаткиНаДень.Организация = ДеньгиВПутиЗаДень.Организация
	|			И ОстаткиНаДень.Получатель = ДеньгиВПутиЗаДень.Получатель
	|			И ОстаткиНаДень.ВидПереводаДенежныхСредств = ДеньгиВПутиЗаДень.ВидПеревода
	|			И ОстаткиНаДень.Контрагент = ДеньгиВПутиЗаДень.Контрагент
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ДеньгиВПутиЗаДень.Валюта ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&КонецПериода КАК Период,
	|	Остатки.Организация КАК Организация,
	|	Остатки.Получатель КАК Получатель,
	|	Остатки.Отправитель КАК Отправитель,
	|	Остатки.ВидПереводаДенежныхСредств КАК ВидПереводаДенежныхСредств,
	|	Остатки.Контрагент КАК Контрагент,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ТаблицаДСвПути
	|ИЗ
	|	втОстаткиВПути КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&КонецПериода,
	|	Остатки.Организация,
	|	Остатки.Получатель,
	|	Остатки.Отправитель,
	|	Остатки.ВидПереводаДенежныхСредств,
	|	Остатки.Контрагент,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.КурсовыеРазницыУбыток)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСПрибыль)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыДСУбыток)
	|	КОНЕЦ
	|ИЗ
	|	втОстаткиВПути КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДСвПути.Валюта,
	|	ТаблицаДСвПути.ВидДвижения,
	|	ТаблицаДСвПути.Период КАК Период,
	|	ТаблицаДСвПути.Организация,
	|	ТаблицаДСвПути.Получатель,
	|	ТаблицаДСвПути.Отправитель КАК Отправитель,
	|	ТаблицаДСвПути.ВидПереводаДенежныхСредств,
	|	ТаблицаДСвПути.Контрагент,
	|	СУММА(ТаблицаДСвПути.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаДСвПути.СуммаУпр) КАК СуммаУпр,
	|	ТаблицаДСвПути.ХозяйственнаяОперация,
	|	ТаблицаДСвПути.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСвПути.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыДенежныеСредстваВПути
	|ИЗ
	|	ТаблицаДСвПути КАК ТаблицаДСвПути
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДСвПути.Валюта,
	|	ТаблицаДСвПути.Период,
	|	ТаблицаДСвПути.Организация,
	|	ТаблицаДСвПути.Получатель,
	|	ТаблицаДСвПути.Отправитель,
	|	ТаблицаДСвПути.ВидПереводаДенежныхСредств,
	|	ТаблицаДСвПути.Контрагент,
	|	ТаблицаДСвПути.ХозяйственнаяОперация,
	|	ТаблицаДСвПути.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаДСвПути.ВидДвижения,
	|	ТаблицаДСвПути.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыРасчетыПоФинансовымИнструментам()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.Договор КАК Договор,
	|	ОборотыЗаДень.ТипСуммы КАК ТипСуммы,
	|	ОборотыЗаДень.СуммаПриход КАК СуммаПриход,
	|	ОборотыЗаДень.СуммаРеглПриход КАК СуммаРеглПриход,
	|	ОборотыЗаДень.СуммаРасход КАК СуммаРасход,
	|	ОборотыЗаДень.СуммаРеглРасход КАК СуммаРеглРасход,
	|	ОборотыЗаДень.СуммаОборот КАК СуммаОборот,
	|	ОборотыЗаДень.СуммаРеглОборот КАК СуммаРеглОборот
	|ПОМЕСТИТЬ ДоговораЗаДень
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			(Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета 
	|					ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
	|			И (ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
	|	) КАК ОборотыЗаДень
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.СуммаВВалюте КАК ОстатокВалюты,
	|	ВЫБОР
	|		КОГДА &ЕстьДоговораАренды 
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР 
	|		КОГДА &ЕстьДоговораАренды
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	ОстаткиНаДень.СуммаРегл КАК ОстатокРегл,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаПриход, 0) КАК СуммаПриход,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглПриход, 0) КАК СуммаРеглПриход,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРасход, 0) КАК СуммаРасход,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглРасход, 0) КАК СуммаРеглРасход,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаОборот, 0) КАК СуммаОборот,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглОборот, 0) КАК СуммаРеглОборот,
	|	ОстаткиНаДень.ТипСуммы КАК ТипСуммы,
	|	ОстаткиНаДень.Договор КАК Договор,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.ХарактерДоговора КАК ХарактерДоговора,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиКредитовДепозитов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Остатки.Договор КАК Договор,
	|		Остатки.Договор.ХарактерДоговора КАК ХарактерДоговора,
	|		Остатки.ТипСуммы КАК ТипСуммы,
	|		Остатки.Договор.ВалютаВзаиморасчетов КАК Валюта,
	|		Остатки.СуммаОстаток КАК СуммаВВалюте,
	|		Остатки.СуммаРеглОстаток КАК СуммаРегл,
	|		Остатки.СуммаУпрОстаток КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|				&ГраницаКонецПериода,
	|				АналитикаУчетаПоПартнерам.Организация = &Организация
	|				И ТипСуммы <> &ОбеспечительныйПлатеж
	|				И (ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
	|				И (Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета
	|					ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
	|		) КАК Остатки
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНаДень.Договор = ДоговораЗаДень.Договор
	|			И ОстаткиНаДень.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Договор.ВалютаВзаиморасчетов = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаВВалюте <> 0
	|	И (НЕ ДоговораЗаДень.Договор ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) <> ОстаткиНаДень.СуммаРегл
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаВВалюте * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) <> ОстаткиНаДень.СуммаУпр)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Договор.ВалютаВзаиморасчетов,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	0,
	|	-ОстаткиНаДень.СуммаРеглОстаток,
	|	-ОстаткиНаДень.СуммаУпрОстаток,
	|	0,
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаПриход, 0),
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглПриход, 0),
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРасход, 0),
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглРасход, 0),
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаОборот, 0),
	|	ЕСТЬNULL(ДоговораЗаДень.СуммаРеглОборот, 0),
	|	ОстаткиНаДень.ТипСуммы,
	|	ОстаткиНаДень.Договор,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.Договор.ХарактерДоговора,
	|	&ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|			И (ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
	|			И (Договор.ВалютаВзаиморасчетов <> &ВалютаУправленческогоУчета
	|				ИЛИ Договор.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговораЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ДоговораЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНаДень.Договор = ДоговораЗаДень.Договор
	|			И ОстаткиНаДень.ТипСуммы = ДоговораЗаДень.ТипСуммы
	|ГДЕ
	|	ОстаткиНаДень.СуммаОстаток = 0
	|	И (НЕ ДоговораЗаДень.Договор ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаУпрОстаток <> 0)
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР КОГДА Остатки.СуммаРегл < 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.СуммаРегл КАК СуммаРеглРег,
	|	0 КАК СуммаУпрРег,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	Остатки.Договор КАК Договор,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаКредитовДепозитов
	|ИЗ
	|	втОстаткиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	&КонецПериода,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр < 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	0,
	|	Остатки.СуммаУпр КАК СуммаУпрРег,
	|	Остатки.ТипСуммы,
	|	Остатки.Договор,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.ХарактерДоговора КАК ХарактерДоговора,
	|	Остатки.ХозяйственнаяОперация,
	|	Остатки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиКредитовДепозитов КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКредитовДепозитов.Валюта,
	|	ТаблицаКредитовДепозитов.Период КАК Период,
	|	ТаблицаКредитовДепозитов.ВидДвижения,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаРеглРег) КАК СуммаРеглРег,
	|	СУММА(ТаблицаКредитовДепозитов.СуммаУпрРег) КАК СуммаУпрРег,
	|	ТаблицаКредитовДепозитов.ТипСуммы,
	|	ТаблицаКредитовДепозитов.Договор,
	|	ТаблицаКредитовДепозитов.АналитикаУчетаПоПартнерам,
	|	ТаблицаКредитовДепозитов.ХарактерДоговора КАК ХарактерДоговора,
	|	ТаблицаКредитовДепозитов.ХозяйственнаяОперация,
	|	ТаблицаКредитовДепозитов.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыРасчетыПоФинансовымИнструментам
	|ИЗ
	|	ТаблицаКредитовДепозитов КАК ТаблицаКредитовДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаКредитовДепозитов.Валюта,
	|	ТаблицаКредитовДепозитов.Период,
	|	ТаблицаКредитовДепозитов.АналитикаУчетаПоПартнерам,
	|	ТаблицаКредитовДепозитов.Договор,
	|	ТаблицаКредитовДепозитов.ХарактерДоговора,
	|	ТаблицаКредитовДепозитов.ТипСуммы,
	|	ТаблицаКредитовДепозитов.ХозяйственнаяОперация,
	|	ТаблицаКредитовДепозитов.ВидДвижения,
	|	ТаблицаКредитовДепозитов.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

Функция ТекстЗапросаКурсовыеРазницыПроцентныеРасходыДисконтирования()
	
	Возврат 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОборотыЗаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОборотыЗаДень.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОборотыЗаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ОборотыЗаДень.Валюта КАК Валюта
	|ПОМЕСТИТЬ ОборотыЗаДень
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Обороты(
	|			&ГраницаНачалоПериода,
	|			&ГраницаКонецПериода,
	|			,
	|			(Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОборотыЗаДень
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	РасчетныйДокумент
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта КАК Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ) КАК Период,
	|	ОстаткиНаДень.СуммаДисконтированияОстаток КАК ОстатокВалюты,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаДисконтированияОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаДисконтированияРеглОстаток КАК СуммаРегл,
	|	ВЫРАЗИТЬ(ОстаткиНаДень.СуммаДисконтированияОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2)) - ОстаткиНаДень.СуммаДисконтированияУпрОстаток КАК СуммаУпр,
	|	ОстаткиНаДень.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент КАК РасчетныйДокумент,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ втОстаткиСуммДисконтирования
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Остатки(
	|		&ГраницаКонецПериода,
	|		АналитикаУчетаПоПартнерам.Организация = &Организация
	|		И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОборотыЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ОборотыЗаДень.АналитикаУчетаПоПартнерам
	|		И ОстаткиНаДень.ОбъектРасчетов = ОборотыЗаДень.ОбъектРасчетов
	|		И ОстаткиНаДень.РасчетныйДокумент = ОборотыЗаДень.РасчетныйДокумент
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалюты
	|		ПО ОстаткиНаДень.Валюта = КурсВалюты.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&КонецПериода, Валюта = &ВалютаУправленческогоУчета И БазоваяВалюта = &ВалютаРегламентированногоУчета) КАК КурсВалютыУпр
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОстаткиНаДень.СуммаДисконтированияОстаток <> 0
	|	И (НЕ ОборотыЗаДень.ОбъектРасчетов ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И ((ВЫРАЗИТЬ(ОстаткиНаДень.СуммаДисконтированияОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель КАК ЧИСЛО(31,2))) <> ОстаткиНаДень.СуммаДисконтированияРеглОстаток
	|			ИЛИ (ВЫРАЗИТЬ(ОстаткиНаДень.СуммаДисконтированияОстаток * КурсВалюты.КурсЧислитель / КурсВалюты.КурсЗнаменатель * КурсВалютыУпр.КурсЗнаменатель / КурсВалютыУпр.КурсЧислитель КАК ЧИСЛО(31,2))) <> ОстаткиНаДень.СуммаДисконтированияУпрОстаток)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНаДень.Валюта,
	|	КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	|	0,
	|	-ОстаткиНаДень.СуммаДисконтированияРеглОстаток,
	|	-ОстаткиНаДень.СуммаДисконтированияУпрОстаток,
	|	ОстаткиНаДень.ОбъектРасчетов,
	|	ОстаткиНаДень.АналитикаУчетаПоПартнерам,
	|	ОстаткиНаДень.РасчетныйДокумент,
	|	&ХозяйственнаяОперация,
	|	&НастройкаХозяйственнойОперации
	|ИЗ
	|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Остатки(
	|			&ГраницаКонецПериода,
	|			АналитикаУчетаПоПартнерам.Организация = &Организация
	|			И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|	) КАК ОстаткиНаДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыЗаДень
	|		ПО ОстаткиНаДень.АналитикаУчетаПоПартнерам = ОборотыЗаДень.АналитикаУчетаПоПартнерам
	|			И ОстаткиНаДень.ОбъектРасчетов = ОборотыЗаДень.ОбъектРасчетов
	|			И ОстаткиНаДень.РасчетныйДокумент = ОборотыЗаДень.РасчетныйДокумент
	|ГДЕ
	|	ОстаткиНаДень.СуммаДисконтированияОстаток = 0
	|	И (НЕ ОборотыЗаДень.ОбъектРасчетов ЕСТЬ NULL
	|		ИЛИ &КонецПериода = КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|		ИЛИ &ПереоценкаПоДням)
	|	И (ОстаткиНаДень.СуммаДисконтированияРеглОстаток <> 0 ИЛИ ОстаткиНаДень.СуммаДисконтированияУпрОстаток <> 0)
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Валюта КАК Валюта,
	|	&КонецПериода КАК Период,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА -Остатки.СуммаРегл
	|		ИНАЧЕ Остатки.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	0 КАК СуммаУпр,
	|	Остатки.СуммаРегл КАК СуммаРеглРег,
	|	0 КАК СуммаУпрРег,
	|	Остатки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаРегл > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ТаблицаДисконтирования
	|ИЗ
	|	втОстаткиСуммДисконтирования КАК Остатки
	|ГДЕ
	|	Остатки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Валюта,
	|	&КонецПериода,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0 
	|		ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА -Остатки.СуммаУпр
	|		ИНАЧЕ Остатки.СуммаУпр
	|	КОНЕЦ,
	|	0,
	|	Остатки.СуммаУпр КАК СуммаУпрРег,
	|	Остатки.ОбъектРасчетов,
	|	Остатки.АналитикаУчетаПоПартнерам,
	|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА Остатки.СуммаУпр > 0
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюУбыток)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.КурсовыеРазницыПоДисконтированиюПрибыль)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	втОстаткиСуммДисконтирования КАК Остатки
	|ГДЕ
	|	Остатки.СуммаУпр <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДисконтирования.Валюта,
	|	ТаблицаДисконтирования.Период КАК Период,
	|	ТаблицаДисконтирования.ВидДвижения,
	|	СУММА(ТаблицаДисконтирования.СуммаРегл) КАК СуммаДисконтированияРегл,
	|	СУММА(ТаблицаДисконтирования.СуммаУпр) КАК СуммаДисконтированияУпр,
	|	СУММА(ТаблицаДисконтирования.СуммаРеглРег) КАК СуммаРеглРегистра,
	|	СУММА(ТаблицаДисконтирования.СуммаУпрРег) КАК СуммаУпрРегистра,
	|	ТаблицаДисконтирования.ОбъектРасчетов,
	|	ТаблицаДисконтирования.АналитикаУчетаПоПартнерам,
	|	ТаблицаДисконтирования.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТаблицаДисконтирования.ХозяйственнаяОперация,
	|	ТаблицаДисконтирования.НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ КурсовыеРазницыПроцентныеРасходыДисконтирования
	|ИЗ
	|	ТаблицаДисконтирования КАК ТаблицаДисконтирования
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДисконтирования.Валюта,
	|	ТаблицаДисконтирования.Период,
	|	ТаблицаДисконтирования.АналитикаУчетаПоПартнерам,
	|	ТаблицаДисконтирования.ОбъектРасчетов,
	|	ТаблицаДисконтирования.РасчетныйДокумент,
	|	ТаблицаДисконтирования.ХозяйственнаяОперация,
	|	ТаблицаДисконтирования.ВидДвижения,
	|	ТаблицаДисконтирования.НастройкаХозяйственнойОперации
	|;
	|";
	
КонецФункции

#КонецОбласти

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации, РегистрыДляРасчета)
	
	ВходящиеДанные = Новый Соответствие;
	ВходящиеДанные.Вставить(Метаданные.Документы.РасчетКурсовыхРазниц);
	Для Каждого Регистр Из РегистрыДляРасчета Цикл
		ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления[Регистр.Ключ]);
	КонецЦикла;
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.АналитикаУчетаПоПартнерам);
	ВходящиеДанные.Вставить(Метаданные.РегистрыСведений.ОтносительныеКурсыВалют);
	
	ЗакрытиеМесяцаСервер.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеЗаданийКЗакрытиюМесяцаСлужебные

Функция СоответствиеЗапросовКонтрольнымРегистрам(Запрос)
	
	СоответствиеТекстовЗапросов = Новый Соответствие();
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваБезналичные", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваБезналичные", "БанковскийСчет.ВалютаДенежныхСредств"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваВКассахККМ", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваВКассахККМ", "КассаККМ.ВалютаДенежныхСредств"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваВПути", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваВПути"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваНаличные", ТекстЗапросаДенежныеСредства(
		Запрос, "ТаблицаИзмененийДенежныеСредстваНаличные", "Касса.ВалютаДенежныхСредств"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийДенежныеСредстваУПодотчетныхЛиц",
		ТекстЗапросаДенежныеСредства(Запрос, "ТаблицаИзмененийДенежныеСредстваУПодотчетныхЛиц"));
	СоответствиеТекстовЗапросов.Вставить("ТаблицаИзмененийРасчетыПоФинансовымИнструментам",
		ТекстЗапросаРасчетыПоФинансовымИнструментам(Запрос));
	РасчетКурсовыхРазницЛокализация.ДополнитьСоответствиеЗапросовКонтрольнымРегистрам(Запрос, СоответствиеТекстовЗапросов);
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции

#Область ТекстыЗапросовЗаданийКЗакрытиюМесяца

Функция ТекстЗапросаДенежныеСредства(Запрос, ИмяВременнойТаблицы, ОбращениеКВалютномуПолю = "Валюта") Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов) КАК Операция,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Регистратор КАК Документ
	|ИЗ
	|	&ИмяВременнойТаблицы КАК Таблица
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|	ПО ИСТИНА
	|ГДЕ
	|	ТипЗначения(Таблица.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|		ИЛИ &ВалютаПереопределяемый <> Константы.ВалютаУправленческогоУчета
	|		ИЛИ &ВалютаПереопределяемый <> Таблица.Организация.ВалютаРегламентированногоУчета
	|";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВалютаПереопределяемый", "Таблица." + ОбращениеКВалютномуПолю);
	СтруктураТекстовЗапросов = ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов(ТекстЗапроса);
	Возврат СтруктураТекстовЗапросов;
	
КонецФункции

Функция ТекстЗапросаРасчетыПоФинансовымИнструментам(Запрос) Экспорт
	Если НЕ Запрос.Параметры.Свойство("ВалютаУпр") Тогда
		Запрос.УстановитьПараметр("ВалютаУпр", Константы.ВалютаУправленческогоУчета.Получить());
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов) КАК Операция,
	|	Аналитика.Организация КАК Организация,
	|	ТаблицаИзменений.Регистратор КАК Документ
	|ИЗ
	|	ТаблицаИзмененийРасчетыПоФинансовымИнструментам КАК ТаблицаИзменений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ТаблицаИзменений.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ТаблицаИзменений.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> &ВалютаУпр
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> Аналитика.Организация.ВалютаРегламентированногоУчета)
	|	И (ТаблицаИзменений.Сумма <> 0
	|		ИЛИ ТаблицаИзменений.СуммаУпр <> 0
	|		ИЛИ ТаблицаИзменений.СуммаРегл <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ПереоценкаАренды) КАК Операция,
	|	Аналитика.Организация КАК Организация,
	|	ТаблицаИзменений.Регистратор КАК Документ
	|ИЗ
	|	ТаблицаИзмененийРасчетыПоФинансовымИнструментам КАК ТаблицаИзменений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ТаблицаИзменений.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ТаблицаИзменений.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц)
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> &ВалютаУпр
	|			ИЛИ ТаблицаИзменений.Договор.ВалютаВзаиморасчетов <> Аналитика.Организация.ВалютаРегламентированногоУчета)
	|	И (ТаблицаИзменений.Сумма <> 0
	|		ИЛИ ТаблицаИзменений.СуммаУпр <> 0
	|		ИЛИ ТаблицаИзменений.СуммаРегл <> 0)
	|";
	
	СтруктураТекстовЗапросов = ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов(ТекстЗапроса);
	Возврат СтруктураТекстовЗапросов

КонецФункции

#КонецОбласти

#КонецОбласти

#Область Прочее

Процедура ПровестиДокументПереоценки(Организация, Период, Операция, ПараметрыПереоценки = Неопределено)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()) Тогда
		Возврат;
	КонецЕсли;
	
	#Область ИнициализацияПараметровПереоценки
	РегистрыДляРасчета = РегистрыРасчета(Операция);
	АналитикаРасчета = Неопределено;
	КоличествоОбработанныхЭлементов = 0;
	Если ЗначениеЗаполнено(ПараметрыПереоценки) Тогда
		Если ПараметрыПереоценки.Свойство("РегистрыРасчета") Тогда
			РегистрыДляРасчета = ПараметрыПереоценки.РегистрыРасчета;
		КонецЕсли;
		ПараметрыПереоценки.Свойство("АналитикаРасчета", АналитикаРасчета);
		Если ТипЗнч(АналитикаРасчета) = Тип("Структура") Тогда
			ВсеПустые = Истина;
			Для Каждого Аналитика Из АналитикаРасчета Цикл
				Если ТипЗнч(Аналитика.Значение) = Тип("Массив") Тогда
					Для Каждого Значение Из Аналитика.Значение Цикл
						Если ЗначениеЗаполнено(Значение) Тогда
							ВсеПустые = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ЗначениеЗаполнено(Аналитика.Значение) Тогда
					ВсеПустые = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ВсеПустые Тогда
				АналитикаРасчета = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыПереоценки.Свойство("КоличествоОбработанныхЭлементов") Тогда
			КоличествоОбработанныхЭлементов = ПараметрыПереоценки.КоличествоОбработанныхЭлементов;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	ВыполненРасчет = Ложь;
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов")
		И (Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами 
			ИЛИ Операция = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками) Тогда
		РассчитатьКурсовыеРазницыПоСрокам(Организация, Период, Операция);
		ВыполненРасчет = Истина;
	КонецЕсли;
	
	Если НЕ ВыполненРасчет И НЕ ТребуетсяПереоценка(Организация, Период, РегистрыДляРасчета, АналитикаРасчета)  Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Организация КАК Организация
	|ПОМЕСТИТЬ втДокументПереоценки
	|ИЗ
	|	Документ.РасчетКурсовыхРазниц КАК Документ
	|ГДЕ
	|	Документ.ХозяйственнаяОперация = &Операция
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Документ.Организация В (&Организация) ИЛИ &ВсеОрганизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(Документ.Ссылка, НЕОПРЕДЕЛЕНО) КАК Документ
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДокументПереоценки КАК Документ
	|		ПО Организации.Ссылка = Документ.Организация
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|	И (Организации.Ссылка В (&Организация) ИЛИ &ВсеОрганизации)
	|	И (Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|		ИЛИ &УчитыватьУпрОрганизацию)");
	
	Запрос.УстановитьПараметр("Операция",       Операция);
	Запрос.УстановитьПараметр("НачалоПериода",  НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода",   КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации", НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("УчитыватьУпрОрганизацию", ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюОрганизацию"));
	
	ПереоцениватьПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Документ) Тогда
			
			Если НЕ ВыполненРасчет Тогда
				ВыполнитьРасчетКурсовыхРазниц(Выборка.Документ, РегистрыДляРасчета, АналитикаРасчета, КоличествоОбработанныхЭлементов);
			КонецЕсли;
			
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокументОбъект.ПометкаУдаления = Ложь;
			ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполненРасчет", Истина);// отключить повторный расчет при проведении
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Иначе
			
			ДокументОбъект = Документы.РасчетКурсовыхРазниц.СоздатьДокумент();
			ДокументОбъект.Дата = КонецМесяца(Период);
			ДокументОбъект.Организация = Выборка.Организация;
			ДокументОбъект.ХозяйственнаяОперация = Операция;
			ДокументОбъект.ПереоценкаПоДням = ПереоцениватьПоДням;
			ДокументОбъект.Записать();
			
			Если НЕ ВыполненРасчет Тогда
				ВыполнитьРасчетКурсовыхРазниц(ДокументОбъект.Ссылка, РегистрыДляРасчета, АналитикаРасчета, КоличествоОбработанныхЭлементов);
			КонецЕсли;
			
			ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполненРасчет", Истина);// отключить повторный расчет при проведении
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла;// По организациям
	
	Если ЗначениеЗаполнено(ПараметрыПереоценки) И ПараметрыПереоценки.Свойство("КоличествоОбработанныхЭлементов") Тогда
		ПараметрыПереоценки.КоличествоОбработанныхЭлементов = КоличествоОбработанныхЭлементов;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьДвижения(ДокументСсылка, МенеджерТаблиц, ИмяРегистра, День)
	
	ВсегоЗаписано = 0;
	КурсовыеРазницы = МенеджерТаблиц.Таблицы["КурсовыеРазницы" + ИмяРегистра].ПолучитьДанные().Выгрузить();
	ЗаполнитьИдентификаторыФинЗаписей(КурсовыеРазницы, ДокументСсылка, ИмяРегистра, День);
	Если КурсовыеРазницы.Количество() > 0 Тогда
		Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей - 
		Набор.Отбор.Регистратор.Установить(ДокументСсылка);
		Набор.Загрузить(КурсовыеРазницы);
		Набор.Записать(Ложь);
		ВсегоЗаписано = КурсовыеРазницы.Количество();
	КонецЕсли;
	ЕщеДописано = 0;
	Возврат ВсегоЗаписано + ЕщеДописано;
	
КонецФункции

// В отдельных случаях расчет курсовых разниц по регистру "РасчетыПоФинансовымИнструментам" может не транслироваться в МФУ.
// Если в МФУ используется выделение долгосрочных активов и обязательств, то сумма финансового инструмента может учитываться
// на долгосрочном счете, а сумма рассчитанной курсовой разницы будет отражена на краткосрочном счете, как и все операции по
// финансовым иснструментам. После этого регламентная операция закрытия месяца по расчету курсовых разниц в регистре "Международный"
// сформирует еще одну проводку по краткосрочному счету для "нейтрализации" проводки расчета курсовой разницы из оперконтура.
// Чтобы избавиться от лишних оборотов и развернутого сальда на счетах доходов - расходов, движения расчета курсовых разниц
// по регистру "РасчетыПоФинансовымИнструментам" при использовании деления задолженностей по срокам обращения не транслируются в МФУ.
//
Процедура ЗаполнитьИдентификаторыФинЗаписей(КурсовыеРазницы, ДокументСсылка, ИмяРегистра, День)
	
	ОбщегоНазначенияУТ.ДобавитьИдентификаторСтрокВТаблицу(КурсовыеРазницы, "ИдентификаторФинЗаписи", "Строка");
	
	
КонецПроцедуры


// Есть валютные остатки.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации
//  Период - Дата
//  РегистрыДляРасчета - Неопределено, Структура - в ключах которой указаны регистры для расчета:
// 	* РасчетыСПоставщикамиПоДокументам 
// 	* РасчетыСКлиентамиПоДокументам 
// 	* ДенежныеСредстваБезналичные 
// 	* ДенежныеСредстваНаличные 
// 	* ДенежныеСредстваВКассахККМ 
// 	* ДенежныеСредстваВПути 
// 	* ДенежныеСредстваУПодотчетныхЛиц 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РезервыПоСомнительнымДолгам 
// 	* ПроцентныеРасходыДисконтирования 
//  АналитикаРасчета - Неопределено, Структура - Аналитика расчета:
// * ТипыСумм - Массив из ПеречислениеСсылка.ТипыГрафиковФинансовыхИнструментов, ПеречислениеСсылка.ТипыПлатежейПоАренде
// 
// Возвращаемое значение:
//  Булево - Есть валютные остатки
Функция ЕстьВалютныеОстатки(Организация, Период, РегистрыДляРасчета = Неопределено, АналитикаРасчета = Неопределено) Экспорт
	
	ТекстЗапросаВТ = "";
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РезервыПоСомнительнымДолгам") Тогда
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"ВЫБРАТЬ
		|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
		|	АналитикаУчетаПоПартнерам.Организация КАК Организация
		|ПОМЕСТИТЬ втКлючиАналитикиПоПартнерам
		|ИЗ
		|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|ГДЕ
		|	(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|	И (АналитикаУчетаПоПартнерам.КлючАналитики В (&АналитикаУчетаПоПартнерам) ИЛИ &ПоВсемАналитикам)"
		+ РазделительПакетовЗапроса();
	КонецЕсли;
	
	Если РегистрыДляРасчета = Неопределено Тогда
		РегистрыДляРасчета = РегистрыРасчета();
	КонецЕсли;
	Разделитель = Символы.ПС+Символы.ПС;
	ОБЪЕДИНИТЬ = Разделитель+"ОБЪЕДИНИТЬ ВСЕ"+Разделитель;
	ТекстЗапроса = "";
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоДокументам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоДокументам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоСрокам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоСрокам"" КАК ПредметПереоценки,
		|	Остатки.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		АналитикаУчетаПоПартнерам В (ВЫБРАТЬ Т.КлючАналитики ИЗ втКлючиАналитикиПоПартнерам КАК Т)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваБезналичные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваБезналичные"" КАК ПредметПереоценки,
		|	Остатки.БанковскийСчет КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (БанковскийСчет В (&БанковскиеСчета) ИЛИ &ПоВсемСчетам)
		|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваНаличные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК ПредметПереоценки,
		|	Остатки.Касса КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваВКассахККМ") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВКассахККМ"" КАК ПредметПереоценки,
		|	Остатки.КассаККМ КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (КассаККМ В (&КассыККМ) ИЛИ &ПоВсемКассамККМ)
		|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|			ИЛИ КассаККМ.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваУПодотчетныхЛиц") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваУПодотчетныхЛиц"" КАК ПредметПереоценки,
		|	Остатки.ПодотчетноеЛицо КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ПодотчетноеЛицо В (&ФизическиеЛица) ИЛИ &ПоВсемФизЛицам)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваВПути") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВПути"" КАК ПредметПереоценки,
		|	Остатки.ВидПереводаДенежныхСредств КАК ДенежныеСредства
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыПоФинансовымИнструментам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыПоФинансовымИнструментам"" КАК ПредметПереоценки,
		|	Остатки.Договор КАК Валюта
		|ИЗ
		|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
		|		&ГраницаКонецПериода,
		|		(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|			И (Договор.ВалютаВзаиморасчетов <> &ВалютаУпрУчета
		|				ИЛИ Договор.ВалютаВзаиморасчетов <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки";
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ДополнитьПроверкуЕстьВалютныеОстатки(РегистрыДляРасчета, ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапросаВТ + ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату",              КонецМесяца(Период));
	Запрос.УстановитьПараметр("ГраницаКонецПериода", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаУпрУчета",      Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации",      НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемАналитикам",    НЕ ЗначениеЗаполнено(Запрос.Параметры.АналитикаУчетаПоПартнерам));
	Запрос.УстановитьПараметр("БанковскиеСчета",     ПолучитьАналитику("БанковскиеСчета", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемСчетам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.БанковскиеСчета));
	Запрос.УстановитьПараметр("Кассы",               ПолучитьАналитику("Кассы", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.Кассы));
	Запрос.УстановитьПараметр("КассыККМ",            ПолучитьАналитику("КассыККМ", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассамККМ",     НЕ ЗначениеЗаполнено(Запрос.Параметры.КассыККМ));
	Запрос.УстановитьПараметр("ФизическиеЛица",      ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемФизЛицам",      НЕ ЗначениеЗаполнено(Запрос.Параметры.ФизическиеЛица));
	Запрос.УстановитьПараметр("ТипыСумм",            ПолучитьАналитику("ТипыСумм", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемТипамСумм",     НЕ ЗначениеЗаполнено(Запрос.Параметры.ТипыСумм));
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции


// Требуется переоценка.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации
//  Период - Дата
//   РегистрыДляРасчета - Неопределено, Структура - в ключах которой указаны регистры для расчета:
// 	* РасчетыСПоставщикамиПоДокументам 
// 	* РасчетыСКлиентамиПоДокументам 
// 	* ДенежныеСредстваБезналичные 
// 	* ДенежныеСредстваНаличные 
// 	* ДенежныеСредстваВКассахККМ 
// 	* ДенежныеСредстваВПути 
// 	* ДенежныеСредстваУПодотчетныхЛиц 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РасчетыПоФинансовымИнструментам 
// 	* РезервыПоСомнительнымДолгам 
// 	* ПроцентныеРасходыДисконтирования 
//  АналитикаРасчета - Структура, Массив, Неопределено - Аналитика расчета:
// * ТипыСумм - Массив из ПеречислениеСсылка.ТипыГрафиковФинансовыхИнструментов, ПеречислениеСсылка.ТипыПлатежейПоАренде -
//  ВернутьОрганизацииКПереоценке - Булево - Вернуть организации к переоценке
//  ДляОтладки - Неопределено - Для отладки
// 
// Возвращаемое значение:
//  Булево, Массив из СправочникСсылка.Организации - Требуется переоценка
Функция ТребуетсяПереоценка(Организация, Период, РегистрыДляРасчета = Неопределено, АналитикаРасчета = Неопределено, ВернутьОрганизацииКПереоценке = Ложь, ДляОтладки = Неопределено) Экспорт
	
	Если РегистрыДляРасчета = Неопределено Тогда
		РегистрыДляРасчета = РегистрыРасчета();
	КонецЕсли;
	
	ТекстЗапросаВТ = "";
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам")
		ИЛИ РегистрыДляРасчета.Свойство("РасчетыПоФинансовымИнструментам")
		ИЛИ РегистрыДляРасчета.Свойство("РезервыПоСомнительнымДолгам")
		ИЛИ РегистрыДляРасчета.Свойство("ПроцентныеРасходыДисконтирования") Тогда
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
		|	АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ПОМЕСТИТЬ втКлючиАналитикиПоПартнерам
		|ИЗ
		|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		|ГДЕ
		|	(АналитикаУчетаПоПартнерам.Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|	И (АналитикаУчетаПоПартнерам.КлючАналитики В (&АналитикаУчетаПоПартнерам) ИЛИ &ПоВсемАналитикам)
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючАналитики
		|;
		|
		|"
	КонецЕсли;
	
	ТекстЗапросаВТ = ТекстЗапросаВТ + 
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Период,
	|	КурсыВалютСрезПоследних.БазоваяВалюта,
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.КурсЧислитель,
	|	КурсыВалютСрезПоследних.КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсы
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&НаДату,) КАК КурсыВалютСрезПоследних"
	+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	
	Разделитель = Символы.ПС+Символы.ПС;
	ОБЪЕДИНИТЬ = Разделитель+"ОБЪЕДИНИТЬ ВСЕ"+Разделитель;
	ТекстЗапроса = "";
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоДокументам"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК КурсРазнУпр,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК КурсРазнРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ЗаказПоставщику КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|ГДЕ
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток <= -0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток <= -0.01
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И Остатки.КВозвратуОстаток = 0
		|		И (Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток <= -0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток <= -0.01
		|			)
		|		)";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоДокументам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоДокументам"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК КурсРазнУпр,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК КурсРазнРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ЗаказКлиента КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток <= -0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток <= -0.01
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0 И Остатки.КВозвратуОстаток = 0
		|		И (Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток <= -0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток <= -0.01
		|			)
		|		)";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыСПоставщикамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСПоставщикамиПоСрокам"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК КурсРазнУпр,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК КурсРазнРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ОбъектРасчетов КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток <= -0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток <= -0.01
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0
		|		И (Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток <= -0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток <= -0.01
		|			)
		|		)
		|";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыСКлиентамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыСКлиентамиПоСрокам"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток КАК КурсРазнУпр,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток КАК КурсРазнРегл,
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.ОбъектРасчетов КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ДолгУпрОстаток <= -0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток >= 0.01
		|	ИЛИ Остатки.ДолгОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ДолгРеглОстаток <= -0.01
		|	ИЛИ (Остатки.ПредоплатаОстаток = 0
		|		И (Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.ПредоплатаРеглОстаток <= -0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток >= 0.01
		|			ИЛИ Остатки.ПредоплатаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.ПредоплатаУпрОстаток <= -0.01
		|			)
		|		)
		|";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваБезналичные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваБезналичные"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.БанковскийСчет КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (БанковскийСчет В (&БанковскиеСчета) ИЛИ &ПоВсемСчетам)
		|			И (БанковскийСчет.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ БанковскийСчет.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.БанковскийСчет.ВалютаДенежныхСредств = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток <= -0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток <= -0.01";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваНаличные") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваНаличные"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.Касса КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (Касса В (&Кассы) ИЛИ &ПоВсемКассам)
		|			И (Касса.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ Касса.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Касса.ВалютаДенежныхСредств = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток <= -0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток <= -0.01";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваВКассахККМ") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваВКассахККМ"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	НЕОПРЕДЕЛЕНО КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.КассаККМ КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (КассаККМ В (&КассыККМ) ИЛИ &ПоВсемКассамККМ)
		|			И (КассаККМ.ВалютаДенежныхСредств <> &ВалютаУпрУчета
		|				ИЛИ КассаККМ.ВалютаДенежныхСредств <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.КассаККМ.ВалютаДенежныхСредств = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток <= -0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток <= -0.01";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ДенежныеСредстваУПодотчетныхЛиц") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ДенежныеСредстваУПодотчетныхЛиц"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	Остатки.ЦельВыдачи КАК ЦельВыдачи,
		|	Остатки.Организация КАК Организация,
		|	Остатки.ПодотчетноеЛицо КАК ДенежныеСредства,
		|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
		|		&ГраницаКонецПериода,
		|		(Организация В (&Организация) ИЛИ &ВсеОрганизации)
		|			И (ПодотчетноеЛицо В (&ФизическиеЛица) ИЛИ &ПоВсемФизЛицам)
		|			И (Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Остатки.Организация.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток <= -0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток >= 0.01
		|	ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток <= -0.01";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("РасчетыПоФинансовымИнструментам") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") +
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""РасчетыПоФинансовымИнструментам"" КАК РегистрНакопления,
		|	НЕОПРЕДЕЛЕНО КАК Валюта,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Аналитика.Организация КАК Организация,
		|	Остатки.Договор КАК ДенежныеСредства,
		|	Остатки.ТипСуммы КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Остатки(
		|		&ГраницаКонецПериода,
		|		(ТипСуммы В (&ТипыСумм) ИЛИ &ПоВсемТипамСумм)
		|		И (Договор.ВалютаВзаиморасчетов <> &ВалютаУпрУчета
		|				ИЛИ Договор.ВалютаВзаиморасчетов <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Договор.ВалютаВзаиморасчетов = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	(ВЫБОР
		|		КОГДА &ЕстьДоговораАренды
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ
		|			Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток >= 0.01
		|			ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаУпрОстаток <= -0.01
		|	КОНЕЦ
		|	ИЛИ ВЫБОР
		|		КОГДА &ЕстьДоговораАренды
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ
		|			Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток >= 0.01
		|			ИЛИ Остатки.СуммаОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаРеглОстаток <= -0.01
		|	КОНЕЦ)
		|	И (Остатки.ТипСуммы = &ОбеспечительныйПлатеж И Остатки.СуммаОстаток = 0 ИЛИ Остатки.ТипСуммы <> &ОбеспечительныйПлатеж)
		|";
	КонецЕсли;
	
	Если РегистрыДляРасчета.Свойство("ПроцентныеРасходыДисконтирования") Тогда
		ТекстЗапроса = ТекстЗапроса + ?(НЕ ПустаяСтрока(ТекстЗапроса), ОБЪЕДИНИТЬ, "") + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	""ПроцентныеРасходыДисконтирования"" КАК РегистрНакопления,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.СуммаДисконтированияОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаДисконтированияУпрОстаток КАК КурсРазнУпр,
		|	Остатки.СуммаДисконтированияОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаДисконтированияРеглОстаток КАК КурсРазнРегл,
		|	Остатки.СуммаДисконтированияОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель КАК ОстатокПоКурсуРегл,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК Организация,
		|	Остатки.ОбъектРасчетов КАК Объект,
		|	Остатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	НЕОПРЕДЕЛЕНО КАК ДатаПлановогоПогашения,
		|	НЕОПРЕДЕЛЕНО КАК ДатаВозникновения
		|ИЗ
		|	РегистрНакопления.ПроцентныеРасходыДисконтирования.Остатки(
		|		&ГраницаКонецПериода,
		|		(Валюта <> &ВалютаУпрУчета ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета)
		|	) КАК Остатки
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКлючиАналитикиПоПартнерам КАК Аналитика
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсРегл
		|	ПО Остатки.Валюта = КурсРегл.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсРегл.БазоваяВалюта
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКурсы КАК КурсУпр
		|	ПО &ВалютаУпрУчета = КурсУпр.Валюта
		|		И Аналитика.ВалютаРегламентированногоУчета = КурсУпр.БазоваяВалюта
		|ГДЕ
		|	Остатки.СуммаДисконтированияОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаДисконтированияУпрОстаток >= 0.01
		|	ИЛИ Остатки.СуммаДисконтированияОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель * КурсУпр.КурсЗнаменатель / КурсУпр.КурсЧислитель - Остатки.СуммаДисконтированияУпрОстаток <= -0.01
		|	ИЛИ Остатки.СуммаДисконтированияОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаДисконтированияРеглОстаток >= 0.01
		|	ИЛИ Остатки.СуммаДисконтированияОстаток * КурсРегл.КурсЧислитель / КурсРегл.КурсЗнаменатель - Остатки.СуммаДисконтированияРеглОстаток <= -0.01";
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ДополнитьПроверкуТребуетсяПереоценка(РегистрыДляРасчета, ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаВТ + ТекстЗапроса;
	Если ВернутьОрганизацииКПереоценке Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1", "РАЗЛИЧНЫЕ");
	КонецЕсли;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату",              КонецМесяца(Период));
	Запрос.УстановитьПараметр("ГраницаКонецПериода", Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаУпрУчета",      Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации",      НЕ ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемАналитикам",    НЕ ЗначениеЗаполнено(Запрос.Параметры.АналитикаУчетаПоПартнерам));
	Запрос.УстановитьПараметр("БанковскиеСчета",     ПолучитьАналитику("БанковскиеСчета", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемСчетам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.БанковскиеСчета));
	Запрос.УстановитьПараметр("Кассы",               ПолучитьАналитику("Кассы", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассам",        НЕ ЗначениеЗаполнено(Запрос.Параметры.Кассы));
	Запрос.УстановитьПараметр("КассыККМ",            ПолучитьАналитику("КассыККМ", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемКассамККМ",     НЕ ЗначениеЗаполнено(Запрос.Параметры.КассыККМ));
	Запрос.УстановитьПараметр("ФизическиеЛица",      ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемФизЛицам",      НЕ ЗначениеЗаполнено(Запрос.Параметры.ФизическиеЛица));
	Запрос.УстановитьПараметр("ТипыСумм",            ПолучитьАналитику("ТипыСумм", АналитикаРасчета));
	Запрос.УстановитьПараметр("ПоВсемТипамСумм",     НЕ ЗначениеЗаполнено(Запрос.Параметры.ТипыСумм));
	
	Запрос.УстановитьПараметр("ОбеспечительныйПлатеж", Неопределено);
	Запрос.УстановитьПараметр("ЕстьДоговораАренды", Ложь);
	Запрос.УстановитьПараметр("ТипДоговораАренды", Неопределено);
	
	Если ДляОтладки <> Неопределено Тогда
		ДляОтладки.Вставить("ТребуетсяПереоценка", Запрос);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если ВернутьОрганизацииКПереоценке Тогда
		КурсовыеРазницы = Запрос.Выполнить().Выгрузить();// нерассчитанные курсовые разницы
		КурсовыеРазницы.Свернуть("Организация");
		Организации = КурсовыеРазницы.ВыгрузитьКолонку("Организация");
		Возврат Организации;
	КонецЕсли;
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ТребуетсяПереоценкаВзаиморасчетов(Организация, Период, АналитикаРасчета = Неопределено) Экспорт
	
	РегистрыДляРасчета = Новый Структура;
	Если НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		РегистрыДляРасчета.Вставить("РасчетыСПоставщикамиПоДокументам");
		РегистрыДляРасчета.Вставить("РасчетыСКлиентамиПоДокументам");
	Иначе
		РегистрыДляРасчета.Вставить("РасчетыСПоставщикамиПоСрокам");
		РегистрыДляРасчета.Вставить("РасчетыСКлиентамиПоСрокам");
	КонецЕсли;
	
	Возврат ТребуетсяПереоценка(Организация, Период, РегистрыДляРасчета, АналитикаРасчета);
	
КонецФункции

Процедура УдалитьДвиженияАналитики(ДокументСсылка, ИмяРегистра, АналитикаРасчета)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("Кассы", АналитикаРасчета));
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Регистратор = &Регистратор
	|	И НЕ (ДанныеРегистра.Касса В (&АналитикаРасчета))
	|	И &ВсеКромеАналитикиРасчета";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДенежныеСредстваНаличные", ИмяРегистра);
	АналитикаУчетаПоПартнерам = ПолучитьАналитику("АналитикаУчетаПоПартнерам", АналитикаРасчета);
	ТипыСумм = ПолучитьАналитику("ТипыСумм", АналитикаРасчета);
	Если ИмяРегистра = "РасчетыСКлиентамиПоДокументам" ИЛИ ИмяРегистра = "РасчетыСПоставщикамиПоДокументам" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "АналитикаУчетаПоПартнерам");
		Запрос.УстановитьПараметр("АналитикаРасчета", АналитикаУчетаПоПартнерам);
		
	ИначеЕсли ИмяРегистра = "РасчетыПоФинансовымИнструментам" Тогда
		Если ЗначениеЗаполнено(АналитикаУчетаПоПартнерам) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "АналитикаУчетаПоПартнерам");
			Запрос.УстановитьПараметр("АналитикаРасчета", АналитикаУчетаПоПартнерам);
			Если ЗначениеЗаполнено(ТипыСумм) Тогда
				ТекстЗапроса = СтрЗаменить(
									ТекстЗапроса, 
									"&ВсеКромеАналитикиРасчета", 
									"&ВсеКромеАналитикиРасчета
									|	И НЕ (ДанныеРегистра.ТипСуммы В (&ТипыСумм))");
				Запрос.УстановитьПараметр("ТипыСумм", ТипыСумм);
			КонецЕсли;
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "ТипСуммы");
			Запрос.УстановитьПараметр("АналитикаРасчета", ТипыСумм);
		КонецЕсли;
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваБезналичные" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "БанковскийСчет");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("БанковскиеСчетаОрганизаций", АналитикаРасчета));
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваВКассахККМ" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "КассаККМ");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("КассыККМ", АналитикаРасчета));
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваВПути" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "Получатель");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("БанковскиеСчетаОрганизаций,Кассы,КассыККМ", АналитикаРасчета));
		
	ИначеЕсли ИмяРегистра = "ДенежныеСредстваУПодотчетныхЛиц" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Касса", "ПодотчетноеЛицо");
		Запрос.УстановитьПараметр("АналитикаРасчета", ПолучитьАналитику("ФизическиеЛица", АналитикаРасчета));
		
	КонецЕсли;
	
	РасчетКурсовыхРазницЛокализация.ЗаменитьЗапросОчисткиДвиженийАналитики(ИмяРегистра, ТекстЗапроса);
	
	// Получим новый набор движений - набор без движений которые надо удалить
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВсеКромеАналитикиРасчета", ЗначениеЗаполнено(Запрос.Параметры.АналитикаРасчета));
	ДвиженияРегистра = Запрос.Выполнить().Выгрузить();
	
	Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей - 
	Набор.Отбор.Регистратор.Установить(ДокументСсылка);
	Набор.Загрузить(ДвиженияРегистра);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
	
КонецПроцедуры

Процедура ПодготовитьНаборыЗаписейКРасчету(ДокументСсылка, РегистрыДляРасчета, АналитикаРасчета)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.РасчетКурсовыхРазниц");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	Для Каждого Регистр Из РегистрыДляРасчета Цикл
		Если Регистр.Ключ = "РасчетыСКлиентамиПоСрокам" ИЛИ Регистр.Ключ = "РасчетыСПоставщикамиПоСрокам" Тогда
			Продолжить;
		КонецЕсли;
		ЭлементБлокировки = Блокировка.Добавить(СтрШаблон("РегистрНакопления.%1.НаборЗаписей", Регистр.Ключ));
		ЭлементБлокировки.УстановитьЗначение("Регистратор", ДокументСсылка);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	Для Каждого Регистр Из РегистрыДляРасчета Цикл
		Если Регистр.Ключ = "РасчетыСКлиентамиПоСрокам" ИЛИ Регистр.Ключ = "РасчетыСПоставщикамиПоСрокам" Тогда
			Продолжить;
		КонецЕсли;
		Если АналитикаРасчета = Неопределено Тогда
			Набор = РегистрыНакопления[Регистр.Ключ].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей - 
			Набор.Отбор.Регистратор.Установить(ДокументСсылка);
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
		Иначе
			УдалитьДвиженияАналитики(ДокументСсылка, Регистр.Ключ, АналитикаРасчета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Удаляет записи по полю ДокументРегистратор в регистре накопления РасчетыСКлиентамиПоСрокам, РасчетыСПоставщикамиПоСрокам
//
// Параметры:
//  ДокументРегистратор - ДокументСсылка - Ссылка документа по которому необходимо удалить записи в регистре накопления
//  ИмяРегистра - Строка - Имя регистра накопления. Может принимать значения РасчетыСКлиентамиПоСрокам, РасчетыСПоставщикамиПоСрокам
//
Процедура УдалитьДвиженияРегистровПоСрокам(ДокументРегистратор, ИмяРегистра) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыПоСрокам.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ втРегистраторы
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|ГДЕ
	|	РасчетыПоСрокам.ДокументРегистратор = &ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегистраторы КАК РегистраторыРасчета
	|	ПО РасчетыПоСрокам.Регистратор = РегистраторыРасчета.Ссылка
	|ГДЕ
	|	РасчетыПоСрокам.ДокументРегистратор <> &ДокументРегистратор
	|ИТОГИ ПО
	|	Регистратор";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетыСКлиентамиПоСрокам", ИмяРегистра);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	
	ВыборкаПоДокументам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДокументам.Следующий() Цикл
		Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей - 
		Набор.Отбор.Регистратор.Установить(ВыборкаПоДокументам.Регистратор);
		Выборка = ВыборкаПоДокументам.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСсылкиСправочника(ИмяСправочника, МассивСсылок, Организация = Неопределено)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Спр.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Спр
	|ГДЕ
	|	Спр.Ссылка В(&МассивСсылок)
	|	И ИСТИНА";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организации", ИмяСправочника);
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИСТИНА", "Спр.Организация = &Организация");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МассивСсылок", ?(МассивСсылок = Неопределено, Новый Массив, МассивСсылок));
	МассивКлючейОрганизации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивКлючейОрганизации;
	
КонецФункции

Функция ПолучитьАналитику(ИмяАналитики, АналитикаРасчета)
	
	Результат = Неопределено;
	Если ТипЗнч(АналитикаРасчета) = Тип("Структура") Тогда
		АналитикаРасчета.Свойство(ИмяАналитики, Результат);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция РазделительПакетовЗапроса()
	
	Возврат "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

Функция ТипыСуммКредитовДепозитовЗаймов()
	Результат = Новый Массив;
	Для Инд = 0 По Метаданные.Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ЗначенияПеречисления.Количество() - 1 Цикл
		Результат.Добавить(Перечисления.ТипыСуммГрафикаКредитовИДепозитов[Инд]);
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
