
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ТранспортнаяНакладная.Команда.ТранспортныеНакладные");
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
	ПараметрыФормы = Новый Структура();
	
	ОткрытьФорму("Документ.ТранспортнаяНакладная.Форма.ФормаСписка", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
