
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		ДокументыОснованияМассив = Новый Массив;
		ДокументыОснованияМассив.Добавить(ДанныеЗаполнения);
		
		Документы.ТранспортнаяНакладная.СоздатьТранспортныеНакладные(ДокументыОснованияМассив,,ЭтотОбъект);
		
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОбщегоНазначенияУТ.ПроверитьНаличиеДублейСтрокТЧ(ЭтотОбъект, "ДокументыОснования", "ДокументОснование", Отказ);
	
	// << 06.04.2023 Марченко С.Н., КРОК, JIRA№A2105505-1524 
	//РезультатПроверки = Документы.ТранспортнаяНакладная.ПроверитьДокументыОснования(ЭтотОбъект);
	//Если РезультатПроверки.ОбъектыПоКоторымСоздаватьТранспортныеНакладныеНельзя.Количество() > 0 Тогда   
	//	Отказ = Истина;  
	//КонецЕсли;

	МассивНепроверяемыхРеквизитов = Новый Массив;	
	// Удаление проверки заполнение добавлено так как это доработка 2-го релиза   
	// Она мешает для запуска первого релиза
	МассивНепроверяемыхРеквизитов.Добавить("КР_ПрочиеМашиноместа.ВесГруза");
	МассивНепроверяемыхРеквизитов.Добавить("КР_ПрочиеМашиноместа.ОбъемГруза");  
	// A2105505-1617
	МассивНепроверяемыхРеквизитов.Добавить("КР_ПрочиеМашиноместа.ОписаниеМеста");
	МассивНепроверяемыхРеквизитов.Добавить("КР_ПрочиеМашиноместа.КоличествоМест");  
	//
	МассивНепроверяемыхРеквизитов.Добавить("ДокументыОснования");

	// << 28.05.2024 Петухов А.В., Фактор, #4143
	Если ЭтотОбъект.КР_ПрочиеМашиноместа.Количество() > 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КР_КоличествоКоробов");
	КонецЕсли;
	// >> 28.05.2024 Петухов А.В., Фактор, #4143
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	// >> 01.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1308
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	// << 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376
	КР_ПередЗаписьюДополнительно(Отказ, РежимЗаписи, РежимПроведения);
	// >> 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Перевозчик)
		И ЗначениеЗаполнено(ПеревозчикПартнер) Тогда
		
		Перевозчик = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(
				ПеревозчикПартнер);
	КонецЕсли;
			
	Если Не ЗначениеЗаполнено(БанковскийСчетЗаказчикаПеревозки) Тогда	
		Если ЗначениеЗаполнено(ЗаказчикПеревозки) Тогда
			Если  ТипЗнч(ЗаказчикПеревозки) = Тип("СправочникСсылка.Контрагенты") Тогда
				БанковскийСчетЗаказчикаПеревозки = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(ЗаказчикПеревозки);
			Иначе
				СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
				СтруктураПараметров.Организация = ЗаказчикПеревозки;
				БанковскийСчетЗаказчикаПеревозки = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(БанковскийСчетПлательщика) Тогда	
		Если ЗначениеЗаполнено(Плательщик) Тогда
			Если  ТипЗнч(Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда
				БанковскийСчетПлательщика = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Плательщик);
			Иначе
				СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
				СтруктураПараметров.Организация = Плательщик;
				БанковскийСчетПлательщика = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(БанковскийСчетПеревозчика) Тогда	
		Если ЗначениеЗаполнено(Перевозчик) Тогда		
			БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Перевозчик);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КР_ДобавленныеПроцедурыИФункции

#Область КР_ОбработчикиСобытий 

// << 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376
Процедура КР_ПередЗаписьюДополнительно(Отказ, РежимЗаписи, РежимПроведения)
	
	// << 18.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465
	СтруктураКоэффициентов = КР_ЗначенияКоэффициентов();
	
	КР_ВесГруза = КР_КоличествоКоробов * СтруктураКоэффициентов.КоэфВесаКороба;
		
	// --> Евлахов Игорь Николаевич (Начало) 07.11.2023
	// Задача #3309
	// *//--> Евлахов Игорь Николаевич (Начало было)
	//КР_ОбъемГрузаТовар = КР_КоличествоКоробов * СтруктураКоэффициентов.КоэфОбъемаКороба; 
	// *//<-- Евлахов Игорь Николаевич (Конец было)
	Если КР_ОбъемГрузаТовар = 0 Тогда
		КР_ОбъемГрузаТовар = КР_КоличествоКоробов * СтруктураКоэффициентов.КоэфОбъемаКороба;	
	КонецЕсли;
	// <-- Евлахов Игорь Николаевич (Конец) 07.11.2023
	
	КР_ВесГрузаПоПрочимМашиноместам = КР_ПрочиеМашиноместа.Итог("ВесГруза");
	КР_ОбъемГрузаПоПрочимМашиноместам = КР_ПрочиеМашиноместа.Итог("ОбъемГруза");
	// >> 18.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465
	
	// << 27.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465
	КР_ЗаполнитьПолучателяОтправителяЛогистики();
	// >> 27.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465

	// ГалкинАН #4309 (08.08.2024) galkin.an {
	
	злЗаполнитьДанныеТранспортногоСредства();
	злЗаполнитьАдресаСкладов();
	
	// #4309 }
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры // >> 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376

// << 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры // >> 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376

// << 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры // >> 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376

// << 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры // >> 22.11.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-376

#КонецОбласти

// << 18.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465
Функция КР_ЗначенияКоэффициентов()
	
	СтруктураКоэффициентов = Новый Структура;
	СтруктураКоэффициентов.Вставить("КоэфВесаКороба", КР_ДополнительныеНастройкиПовтИсп.Значение("КоэффициентВесаКороба"));
	СтруктураКоэффициентов.Вставить("КоэфОбъемаКороба", КР_ДополнительныеНастройкиПовтИсп.Значение("КоэффициентОбъемаКороба"));
	
	Возврат СтруктураКоэффициентов;
	
КонецФункции // >> 18.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465

// << 27.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465
Процедура КР_ЗаполнитьПолучателяОтправителяЛогистики()

	// ГалкинАН #4309 (08.08.2024) galkin.an {
	// Было.
	//СкладыОтгрузки  = КР_ДополнительныеНастройкиПовтИсп.МассивЗначений("СкладыОтгрузкиЦентральногоСклада");
	//СкладОтгрузкиЦС = КР_ДополнительныеНастройкиПовтИсп.Значение("СкладОтгрузкиЦентральногоСкладаДляЛогистики");
	//
	//Если КР_ЧерезЦС Или Не СкладыОтгрузки.Найти(КР_Получатель) = Неопределено Тогда
	//	КР_ПолучательЛогистика = СкладОтгрузкиЦС;
	//Иначе
	//	КР_ПолучательЛогистика = КР_Получатель;
	//КонецЕсли;
	//
	//Если СкладыОтгрузки.Найти(КР_Отправитель) = Неопределено Тогда
	//	КР_ОтправительЛогистика = КР_Отправитель;
	//Иначе
	//	КР_ОтправительЛогистика = СкладОтгрузкиЦС;
	//КонецЕсли;
	// Стало.
	Документы.ТранспортнаяНакладная.злЗаполнитьПолучателяОтправителяЛогистика(ЭтотОбъект);
	// #4309 }
	
КонецПроцедуры // >> 27.04.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1465

// ГалкинАН #4309 (08.08.2024) galkin.an {

Процедура злЗаполнитьДанныеТранспортногоСредства()

	Документы.ТранспортнаяНакладная.злЗаполнитьДанныеТранспортногоСредства(ЭтотОбъект);
	
КонецПроцедуры

Процедура злЗаполнитьАдресаСкладов()
	
	Документы.ТранспортнаяНакладная.злУстановитьАдресСклада(ЭтотОбъект, ЭтотОбъект.КР_Отправитель, "АдресПогрузки");
	Документы.ТранспортнаяНакладная.злУстановитьАдресСклада(ЭтотОбъект, ЭтотОбъект.КР_Получатель, "АдресДоставки");
		
КонецПроцедуры

// #4309 }

#КонецОбласти

#КонецЕсли
