
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	РазрешитьРедактированиеНастройкаАдресногоХранения                             = Истина;
	РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОтгрузке                   = Истина;
	РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриПоступлении                = Истина;
	РазрешитьРедактированиеИспользоватьСкладскиеПомещения                         = Истина;
	РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОформленииИзлишковНедостач = Истина;
	РазрешитьРедактированиеТипСклада                                              = Истина;
	РазрешитьРедактированиеРодитель                                               = Истина;
	РазрешитьРедактированиеРозничныйВидЦены                                       = Истина;
	РазрешитьРедактированиеИндивидуальныйВидЦены                                  = Истина;
	РазрешитьИспользоватьСтатусыПриходныхОрдеров                                  = Истина;
	РазрешитьИспользоватьСтатусыРасходныхОрдеров                                  = Истина;
	РазрешитьРедактированиеДатаНачалаОрдернойСхемыПриОтгрузке                     = Истина;
	РазрешитьРедактированиеДатаНачалаОрдернойСхемыПриПоступлении                  = Истина;
	РазрешитьРедактированиеДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач    = Истина;
	РазрешитьРедактированиеДатаНачалаИспользованияСкладскихПомещений              = Истина;
	РазрешитьРедактированиеДатаНачалаАдресногоХраненияОстатков                    = Истина;
	РазрешитьРедактированиеЦеховойКладовой                                        = Истина;
	РазрешитьРедактированиеПодразделения                                          = Истина;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("РазрешитьРедактированиеТипСклада");
	МассивЭлементов.Добавить("РазрешитьРедактированиеРозничныйВидЦены");
	МассивЭлементов.Добавить("РазрешитьРедактированиеИндивидуальныйВидЦены");
	МассивЭлементов.Добавить("ОписаниеТипСклада");
	МассивЭлементов.Добавить("ОписаниеРозничныйВидЦены");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		"РазрешитьРедактированиеТипСклада,
		|РазрешитьРедактированиеРозничныйВидЦены,
		|РазрешитьРедактированиеИндивидуальныйВидЦены,
		|ОписаниеТипСклада,
		|ОписаниеРозничныйВидЦены",
		"Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьРозничныеПродажи"));
	
	ИспользоватьОрдерныеСклады = ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады");
	Для Каждого Элемент Из Элементы.ГруппаЗависимыеОтОрдернойСхемы.ПодчиненныеЭлементы Цикл
		Элемент.Видимость = ИспользоватьОрдерныеСклады;
	КонецЦикла;

	Если НЕ ПолучитьФункциональнуюОпцию("УправлениеПредприятием") Тогда
		Элементы.ОписаниеЦеховаяКладовая.Видимость = Ложь;
	КонецЕсли; 
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	// << 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	КР_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	// >> 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Прочее

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОтгрузке Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриОтгрузке");
	КонецЕсли;

	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриПоступлении Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриПоступлении");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьСкладскиеПомещения Тогда
		Результат.Добавить("ИспользоватьСкладскиеПомещения");
	КонецЕсли;
	
	Если РазрешитьРедактированиеНастройкаАдресногоХранения Тогда
		Результат.Добавить("НастройкаАдресногоХранения");
	КонецЕсли;

	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОформленииИзлишковНедостач Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач");
	КонецЕсли;
	
	Если РазрешитьРедактированиеТипСклада Тогда
		Результат.Добавить("ТипСклада");
	КонецЕсли;
	
	Если РазрешитьРедактированиеРодитель Тогда
		Результат.Добавить("Родитель");
	КонецЕсли;
	
	Если РазрешитьИспользоватьСтатусыПриходныхОрдеров Тогда
		Результат.Добавить("ИспользоватьСтатусыПриходныхОрдеров");
	КонецЕсли;
	
	Если РазрешитьИспользоватьСтатусыРасходныхОрдеров Тогда
		Результат.Добавить("ИспользоватьСтатусыРасходныхОрдеров");
	КонецЕсли;
	
	Если РазрешитьРедактированиеРозничныйВидЦены Тогда
		Результат.Добавить("РозничныйВидЦены");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИндивидуальныйВидЦены Тогда
		Результат.Добавить("ИндивидуальныйВидЦены");
	КонецЕсли;
	
	Если РазрешитьРедактированиеДатаНачалаОрдернойСхемыПриОтгрузке Тогда
		Результат.Добавить("ДатаНачалаОрдернойСхемыПриОтгрузке");
	КонецЕсли;
	
	Если РазрешитьРедактированиеДатаНачалаОрдернойСхемыПриПоступлении Тогда
		Результат.Добавить("ДатаНачалаОрдернойСхемыПриПоступлении");
	КонецЕсли;
	
	Если РазрешитьРедактированиеДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач Тогда
		Результат.Добавить("ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач");
	КонецЕсли;
	
	Если РазрешитьРедактированиеДатаНачалаИспользованияСкладскихПомещений Тогда
		Результат.Добавить("ДатаНачалаИспользованияСкладскихПомещений");
	КонецЕсли;
	
	Если РазрешитьРедактированиеДатаНачалаАдресногоХраненияОстатков Тогда
		Результат.Добавить("ДатаНачалаАдресногоХраненияОстатков");
	КонецЕсли;
	
	
	Если РазрешитьРедактированиеПодразделения Тогда
		Результат.Добавить("Подразделение");
	КонецЕсли;

	// << 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	КР_РазрешитьРедактирование(Результат);
	// >> 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область КР_ДобавленныеПроцедурыИФункции

// << 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
&НаСервере
Процедура КР_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	#Область РеквизитыФормы
	
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеИспользоватьРазмещениеКакПриходныйОрдер", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование флага ""Использовать размещение как приходный ордер""'"));
	
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеВидСклада", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование поля ""Вид склада""'"));
	
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеАдресныйСкладБезордернойОтгрузки", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование флага ""Адресный склад безордерной отгрузки""'"));
	
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеСкладСПомещениямиБезордернойОтгрузки", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование флага ""Склад с помещениями безордерной отгрузки""'"));
	
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеУчетОстатковКоробов", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование флага ""Учет остатков коробов""'"));
	
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеКонтролироватьОстаткиКоробов", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование флага ""Контролировать остатки коробов""'"));
		
	// << 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеЯчейкаХраненияФорменнойОдежды", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование поля ""Ячейка хранения форменной одежды""'"));

	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеЯчейкаХраненияБракованногоТовара", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование поля ""Ячейка хранения бракованного товара""'"));
	// >> 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188	
	
	// << 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеМаркетплейсСкладаРасхождений", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование поля ""Маркетплейс склада расхождений""'"));
	// >> 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	
	// --> Евлахов Игорь Николаевич (Начало) 29.07.2024
	// Задача #4448
	РеквизитФормы = КР_МетодыМодификацииФорм.ДобавитьРеквизитФормы(ЭтотОбъект,
		"злРазрешитьРедактированиеМарка", ОписаниеТиповБулево, , 
		НСтр("ru = 'Разрешить редактирование поля ""Марка (бренд)""'"));
	// <-- Евлахов Игорь Николаевич (Конец) 29.07.2024
	
	#КонецОбласти
	
	#Область ЭлементыФорму
	
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеИспользоватьРазмещениеКакПриходныйОрдер");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеВидСклада");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеАдресныйСкладБезордернойОтгрузки");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеСкладСПомещениямиБезордернойОтгрузки");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеУчетОстатковКоробов");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеКонтролироватьОстаткиКоробов");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
	
	// << 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеЯчейкаХраненияФорменнойОдежды");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеЯчейкаХраненияБракованногоТовара");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
	// >> 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188
	
	// << 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"КР_РазрешитьРедактированиеМаркетплейсСкладаРасхождений");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
	// >> 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	
	// --> Евлахов Игорь Николаевич (Начало) 29.07.2024
	// Задача #4448
	ЭлементФормы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(ЭтотОбъект,
		"злРазрешитьРедактированиеМарка");
	ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	// <-- Евлахов Игорь Николаевич (Конец) 29.07.2024
	#КонецОбласти

	ЭтотОбъект.КР_РазрешитьРедактированиеИспользоватьРазмещениеКакПриходныйОрдер = Истина;
	ЭтотОбъект.КР_РазрешитьРедактированиеВидСклада = Истина;
	ЭтотОбъект.КР_РазрешитьРедактированиеАдресныйСкладБезордернойОтгрузки = Истина;
	ЭтотОбъект.КР_РазрешитьРедактированиеСкладСПомещениямиБезордернойОтгрузки = Истина;
	ЭтотОбъект.КР_РазрешитьРедактированиеУчетОстатковКоробов = Истина;
	ЭтотОбъект.КР_РазрешитьРедактированиеКонтролироватьОстаткиКоробов = Истина;    
	
	// << 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188
	ЭтотОбъект.КР_РазрешитьРедактированиеЯчейкаХраненияФорменнойОдежды = Истина;
	ЭтотОбъект.КР_РазрешитьРедактированиеЯчейкаХраненияБракованногоТовара = Истина;    
	// >> 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188
	
	// << 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	ЭтотОбъект.КР_РазрешитьРедактированиеМаркетплейсСкладаРасхождений = Истина;    
	// >> 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	
	// --> Евлахов Игорь Николаевич (Начало) 29.07.2024
	// Задача #4448
	ЭтотОбъект.злРазрешитьРедактированиеМарка = Истина;
	// <-- Евлахов Игорь Николаевич (Конец) 29.07.2024
	
КонецПроцедуры // >> 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751	

// << 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
&НаКлиенте
Процедура КР_РазрешитьРедактирование(Результат)  

	Если ЭтотОбъект.КР_РазрешитьРедактированиеИспользоватьРазмещениеКакПриходныйОрдер Тогда
		Результат.Добавить("КР_ИспользоватьРазмещениеКакПриходныйОрдер");
	КонецЕсли;

	Если ЭтотОбъект.КР_РазрешитьРедактированиеВидСклада Тогда
		Результат.Добавить("КР_ВидСклада");
	КонецЕсли;

	Если ЭтотОбъект.КР_РазрешитьРедактированиеАдресныйСкладБезордернойОтгрузки Тогда
		Результат.Добавить("КР_АдресныйСкладБезордернойОтгрузки");
	КонецЕсли;

	Если ЭтотОбъект.КР_РазрешитьРедактированиеСкладСПомещениямиБезордернойОтгрузки Тогда
		Результат.Добавить("КР_СкладСПомещениямиБезордернойОтгрузки");
	КонецЕсли;

	Если ЭтотОбъект.КР_РазрешитьРедактированиеУчетОстатковКоробов Тогда
		Результат.Добавить("КР_УчетОстатковКоробов");
	КонецЕсли;

	Если ЭтотОбъект.КР_РазрешитьРедактированиеКонтролироватьОстаткиКоробов Тогда
		Результат.Добавить("КР_КонтролироватьОстаткиКоробов");
	КонецЕсли;
	
	// << 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188
	Если ЭтотОбъект.КР_РазрешитьРедактированиеЯчейкаХраненияФорменнойОдежды Тогда
		Результат.Добавить("КР_ЯчейкаХраненияФорменнойОдежды");
	КонецЕсли;

	Если ЭтотОбъект.КР_РазрешитьРедактированиеЯчейкаХраненияБракованногоТовара Тогда
		Результат.Добавить("КР_ЯчейкаХраненияБракованногоТовара");
	КонецЕсли;
	// >> 02.02.2023 Марченко С.Н., КРОК, JIRA№A2105505-1188

	// << 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	Если ЭтотОбъект.КР_РазрешитьРедактированиеМаркетплейсСкладаРасхождений Тогда
		Результат.Добавить("КР_МаркетплейсСкладаРасхождений");
	КонецЕсли;
	// >> 27.12.2023 Марченко С.Н., КРОК, JIRA№A2105505-2595
	
	// --> Евлахов Игорь Николаевич (Начало) 29.07.2024
	// Задача #4448
	Если ЭтотОбъект.злРазрешитьРедактированиеМарка Тогда
		Результат.Добавить("злМарка");
	КонецЕсли;
	// <-- Евлахов Игорь Николаевич (Конец) 29.07.2024
	
КонецПроцедуры // >> 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

#КонецОбласти