
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи.Команда.ОткрытьФормуСписка");
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
	ОткрытьФорму("ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи.Форма.ФормаСписка", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

#КонецОбласти
