#Область СлужебныйПрограммныйИнтерфейс

#Область Контрагенты

Процедура ПриЗаписиКонтрагента(Объект, Отказ) Экспорт
	СинхронизацияЭДО.ПриЗаписиКонтрагента(Объект, Отказ);
КонецПроцедуры

#КонецОбласти

Процедура ПриОпределенииСпискаТиповОбъектовУчетаПоТипуДокумента(ТипДокумента, СписокТипов) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.КоммерческиеПредложения") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КоммерческиеПредложенияСлужебный");
		МодульПодсистемы.ДополнитьСписокТиповДокументовПоВидуЭлектронногоДокумента(ТипДокумента, СписокТипов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиКонтрагентаЭДО(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СинхронизацияЭДО.ПроверитьКонтрагентаВ1СЭДОПриЗаписи(Источник, Отказ);

КонецПроцедуры

#КонецОбласти