#Область ПрограммныйИнтерфейс

// См. ОбменСКонтрагентамиКлиентПереопределяемый.ОткрытьФормуПодбораТоваров.
Процедура ОткрытьФормуПодбораТоваров(ИдентификаторФормы, ОбработкаПродолжения) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок",               	НСтр("ru = 'Подбор товаров'"));
	ПараметрыФормы.Вставить("ЗаголовокКнопкиПеренести", НСтр("ru = 'Сформировать электронный документ'"));
	ПараметрыФормы.Вставить("УникальныйИдентификатор",	ИдентификаторФормы);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", 	НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареУслугеРаботе(Ложь));
	
	ОткрытьФорму("Обработка.ПодборТоваровПоОтбору.Форма", ПараметрыФормы, , , ,	, ОбработкаПродолжения);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиКлиентПереопределяемый.ПриВыбореДоговораКонтрагента.
Процедура ПриВыбореДоговораКонтрагента(Параметры, Владелец, ОповещениеОЗакрытии, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Контрагент"   , Параметры.Контрагент);
	Отбор.Вставить("Организация", Параметры.Организация);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Владелец,,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиКлиентПереопределяемый.ПроверитьИспользованиеИнтернетПоддержкаПользователей.
Процедура ПроверитьИспользованиеИнтернетПоддержкаПользователей(Использование) Экспорт
	
	Если СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().РазделениеВключено Тогда
		Использование = Ложь;
	Иначе
		Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиКлиентПереопределяемый.ПриПодбореУчетногоДокумента.
Процедура ПриПодбореУчетногоДокумента(Знач Настройки, Знач ОповещениеОВыборе, СтандартнаяОбработка = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина);
	Отбор = Новый Структура("Контрагент, Организация", Настройки.Контрагент, Настройки.Организация);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	Если Настройки.ИмяОбъектаМетаданных = "Документ.СчетФактураПолученный" Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
		ДополнительныеПараметры.Вставить("ОповещениеОВыборе", ОповещениеОВыборе);
		
		Оповещение = Новый ОписаниеОповещения("ПриПодбореУчетногоДокументаЗавершение", ЭлектронноеВзаимодействиеУТКлиент, ДополнительныеПараметры);
		
		ТекстВопроса = НСтр("ru='Какой список счетов-фактур открыть?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("1", НСтр("ru = 'СФ полученные'"));
		Кнопки.Добавить("2", НСтр("ru = 'СФ полученные (аванс)'"));
		Кнопки.Добавить("3", НСтр("ru = 'СФ полученные налогового агента'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ОткрытьФорму(Настройки.ИмяОбъектаМетаданных + ".ФормаВыбора", 
			ПараметрыФормы,,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиКлиентПереопределяемый.СоздатьКонтрагентаИнтерактивно
Процедура СоздатьКонтрагентаИнтерактивно(РеквизитыКонтрагента, ОписаниеОповещенияОСозданииКонтрагента) Экспорт
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование", РеквизитыКонтрагента.Наименование);
	СтруктураЗаполнения.Вставить("НаименованиеПолное", РеквизитыКонтрагента.Наименование);
	СтруктураЗаполнения.Вставить("ИНН", РеквизитыКонтрагента.ИНН);
	СтруктураЗаполнения.Вставить("КПП", РеквизитыКонтрагента.КПП);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураЗаполнения", СтруктураЗаполнения);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияОСозданииКонтрагента", ОписаниеОповещенияОСозданииКонтрагента);
	
	ИспользоватьПартнеровКакКонтрагентов = Ложь;
	ИспользоватьПартнеровКакКонтрагентов = ЭлектронноеВзаимодействиеУТВызовСервера.ПолучитьЗначениеФО("ИспользоватьПартнеровКакКонтрагентов");
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(Неопределено,, ДополнительныеПараметры);
	Если Не ИспользоватьПартнеровКакКонтрагентов Тогда
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрыФормы,,,,, ОписаниеОповещенияОЗакрытии);
	Иначе
		ОткрытьФорму("Справочник.Партнеры.Форма.ФормаЭлементаРеквизитыКонтрагента", ПараметрыФормы,,,,, ОписаниеОповещенияОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиКлиентПереопределяемый.ВыбратьКонтрагента
Процедура ВыбратьКонтрагента(РеквизитыОтбораКонтрагента, ОписаниеОповещенияОЗакрытии) Экспорт
	
	Отбор = Новый Структура;
	Если ЗначениеЗаполнено(РеквизитыОтбораКонтрагента.Наименование) Тогда
		Отбор.Вставить("Наименование", РеквизитыОтбораКонтрагента.Наименование);
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыОтбораКонтрагента.ИНН) Тогда
		Отбор.Вставить("ИНН", РеквизитыОтбораКонтрагента.ИНН);
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыОтбораКонтрагента.КПП) Тогда
		Отбор.Вставить("КПП", РеквизитыОтбораКонтрагента.КПП);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещенияОЗакрытии)
	
КонецПроцедуры

#КонецОбласти
