#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПараметрТипПервичногоДокумента = Неопределено;
	Если Параметры.Отбор.Свойство("ТипПервичногоДокумента", ПараметрТипПервичногоДокумента) Тогда
		СписокВыбора = Элементы.ОтборТипПервичногоДокумента.СписокВыбора;
		СписокВыбора.Очистить();
		Если ТипЗнч(ПараметрТипПервичногоДокумента) = Тип("ФиксированныйМассив") Тогда;
			Для Каждого ЭлементМассива Из ПараметрТипПервичногоДокумента Цикл
				СписокВыбора.Добавить(ЭлементМассива);
			КонецЦикла;
		Иначе
			СписокВыбора.Добавить(ПараметрТипПервичногоДокумента);
		КонецЕсли; 
		Если СписокВыбора.Количество() > 0 Тогда
			ТипПервичногоДокумента = СписокВыбора[0].Значение;
		КонецЕсли;
		Если СписокВыбора.Количество() = 1 Тогда
			Элементы.ОтборТипПервичногоДокумента.Видимость = Ложь;
			АвтоЗаголовок = Ложь;
			Заголовок = Строка(ТипПервичногоДокумента);
		КонецЕсли;
		Параметры.Отбор.Удалить("ТипПервичногоДокумента");
		
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"ТипПервичногоДокумента", 
			ТипПервичногоДокумента, 
			ЗначениеЗаполнено(ТипПервичногоДокумента),
			ВидСравненияКомпоновкиданных.Равно);
			
	КонецЕсли;
	
	ПараметрКонтрагент = Неопределено;
	Если Параметры.Отбор.Свойство("Контрагент", ПараметрКонтрагент) Тогда
		Контрагент = ПараметрКонтрагент;
		Элементы.ОтборКонтрагент.Видимость = Ложь;  
		Параметры.Отбор.Удалить("Контрагент");
		
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Контрагент", 
			Контрагент, 
			ЗначениеЗаполнено(Контрагент),
			ВидСравненияКомпоновкиданных.Равно);
			
	КонецЕсли;
	
	ПараметрПартнер = Неопределено;
	Если Параметры.Отбор.Свойство("Партнер", ПараметрПартнер) Тогда
		Партнер = ПараметрПартнер;
		Элементы.ОтборПартнер.Видимость = Ложь; 
		Параметры.Отбор.Удалить("Партнер");
		
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Партнер", 
			Партнер, 
			ЗначениеЗаполнено(Партнер),
			ВидСравненияКомпоновкиданных.Равно);
			
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьПараметрыВыбораПартнера();
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборТипПервичногоДокументаПриИзменении(Элемент)
	
	ОтборТипПервичногоДокументаПриИзмененииСервер()
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Контрагент", 
		Контрагент, 
		ЗначениеЗаполнено(Контрагент),
		ВидСравненияКомпоновкиданных.Равно);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Номер", 
		Номер, 
		ЗначениеЗаполнено(Номер),
		ВидСравненияКомпоновкиданных.Содержит);

КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Дата", 
		НачалоДня(Дата), 
		ЗначениеЗаполнено(Дата),
		ВидСравненияКомпоновкиданных.БольшеИлиРавно);

		
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Дата", 
		КонецДня(Дата), 
		ЗначениеЗаполнено(Дата),
		ВидСравненияКомпоновкиданных.МеньшеИлиРавно);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПартнерПриИзменении(Элемент)
	
	ОтборПартнерПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборПартнерПриИзмененииСервер()
	
	Если Партнер = Справочники.Партнеры.НашеПредприятие Тогда
		Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Организации") Тогда
			Контрагент = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Контрагент", 
		Контрагент, 
		ЗначениеЗаполнено(Контрагент),
		ВидСравненияКомпоновкиданных.Равно);
		
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Партнер", 
		Партнер, 
		ЗначениеЗаполнено(Партнер),
		ВидСравненияКомпоновкиданных.Равно);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораПартнера()
	
	МассивПараметров = Новый Массив;

	Если ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ОплатаОтКлиента
		 Или ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.РеализацияКлиенту Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Клиент", Истина));
	ИначеЕсли ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ОплатаПоставщику
		 Или ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ПриобретениеУПоставщика Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Поставщик", Истина));
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПередачиТоваровМеждуОрганизациями") Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("УстанавливатьОтборПоТипуПартнераКакИЛИ", Истина));
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.НашеПредприятие", Истина));
	КонецЕсли;

	Элементы.ОтборПартнер.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ОтборТипПервичногоДокументаПриИзмененииСервер()
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"ТипПервичногоДокумента", 
		ТипПервичногоДокумента, 
		ЗначениеЗаполнено(ТипПервичногоДокумента),
		ВидСравненияКомпоновкиданных.Равно);
	
	УстановитьПараметрыВыбораПартнера();
	
КонецПроцедуры

#КонецОбласти
