
&НаКлиенте
Процедура злПутьХраненияВерсийВнешнихОбработокНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповещениеПродолжения = Новый ОписаниеОповещения(
		"ВыборКаталогаЗавершение",
		ЭтотОбъект,
		"НаборКонстант.злПутьХраненияВерсийВнешнихОбработок");
		
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОповещениеПродолжения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ИмяРеквизита) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НаборКонстант.злПутьХраненияВерсийВнешнихОбработок = Результат;
	КонецЕсли;
	
КонецПроцедуры
