&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	ОценкаПроизводительностиКлиент.ЗамерВремени("Документ.ВозвратТоваровПоставщику.Команда.ВозвратыТоваровПоставщикам");
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
	ОткрытьФорму(
		"Документ.ВозвратТоваровПоставщику.Форма.ФормаСпискаДокументов",
		, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
