
#Область ПрограммныйИнтерфейс

// Обработчик события вызывается при получении имени кассира.
//
// Параметры:
//  ИмяКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИмяКассира(ИмяКассира, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	//++ НЕ ГОСИС
	
	ИмяКассира = РозничныеПродажиВызовСервера.РеквизитыКассира().Наименование;
	СтандартнаяОбработка = Ложь;
	
	//-- НЕ ГОСИС
	//-- Локализация
	
КонецПроцедуры

// Обработчик события вызывается при получении ИНН кассира.
//
// Параметры:
//  ИННКассира - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполненияИННКассира(ИННКассира, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	//++ НЕ ГОСИС
	
	ИННКассира = РозничныеПродажиВызовСервера.РеквизитыКассира().ИНН;
	СтандартнаяОбработка = Ложь;
	
	//-- НЕ ГОСИС
	//-- Локализация
	
КонецПроцедуры

// Обработчик события вызывается при заполнения наименования рабочего места.
//
// Параметры:
//  Наименование - Строка - Наименование рабочего места.
//  ИмяПользователя - Строка - Имя пользователя информационной базы.
//  СтандартнаяОбработка - Булево -
//
Процедура ОбработкаЗаполненияНаименованияРабочегоМеста(Наименование, ИмяПользователя, СтандартнаяОбработка)  Экспорт
	
КонецПроцедуры

// Обработчик события получения идентификатора клиента для рабочегоМеста.
//
// Параметры:
//  ИдентификаторКлиента - Строка, Неопределено - Идентификатор клиента
//  СтандартнаяОбработка - Булево - 
//
Процедура ИдентификаторКлиентаДляРабочегоМеста(ИдентификаторКлиента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Функция возвращает поддерживаемые форматы ФФД в прикладном решении.
//
// Возвращаемое значение:
//  СписокЗначений - 
//
Функция ПолучитьПоддерживаемыйФорматыФФД() Экспорт
	
	//++ Локализация
	//++ НЕ ГОСИС
	
	ФорматыФФД = Новый СписокЗначений();
	ФорматыФФД.Добавить("1.0");
	ФорматыФФД.Добавить("1.0.5");
	ФорматыФФД.Добавить("1.1");
	ФорматыФФД.Добавить("1.2");
	Возврат ФорматыФФД;
	
	//-- НЕ ГОСИС
	//-- Локализация
	
КонецФункции

#КонецОбласти