
#Область ПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнение

Процедура ВыпонитьПервоначальноеЗаполнениеЛокализованныхДанных() Экспорт  
	
	// Версия внесенных изменений "конфигурации".
	// За основу взята версия хранилища разработки.
	// Правило нумерации: берем номер последней версии хранилища и добавляем к ней единицу.
	
	// --> Евлахов Игорь Николаевич (Начало) 06.10.2023 
	// Задача #3208
	// Смена версии для добавления предопределенного элемента справочника ВидыКонтактнойИнформации
	ВерсияЛокализации = 1488;
    // <-- Евлахов Игорь Николаевич (Конец) 06.10.2023
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущаяВерсияЛокализации = Константы.КР_ВерсияЛокализацииСистемы.Получить();
	
	Если ВерсияЛокализации = ТекущаяВерсияЛокализации Тогда 
		Возврат;
	КонецЕсли;
	
	СобытиеЖурналаРегистрации = "ПервоначальноеЗаполнениеЛокализованныхДанных"; 
	
	Попытка
		
		//////////////////////////////////////
		// Регистрация обработчиков обновления
		
		// 12.12.2022, Федоров Д.Е., КРОК, Jira№ A2105505-872
		Справочники.ВидыКонтактнойИнформации.КР_ПервоначальноеЗаполнениеЛокализованныхДанных(
			ТекущаяВерсияЛокализации, ВерсияЛокализации);
			
		// >> 04.04.2023 Новиков Н.С., КРОК, JIRA№ A2105505-1465
		Справочники.НаборыДополнительныхРеквизитовИСведений.КР_ПервоначальноеЗаполнениеЛокализованныхДанных(
			ТекущаяВерсияЛокализации, ВерсияЛокализации);
			
		// 18.01.2023, Маскаев П.Ю., КРОК, JIRA№ A2105505-1162
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КР_ПервоначальноеЗаполнениеЛокализованныхДанных(
			ТекущаяВерсияЛокализации, ВерсияЛокализации);
			
		// Конец регистрации обработчиков обновления
		///////////////////////////////////////
				
		Константы.КР_ВерсияЛокализацииСистемы.Установить(ВерсияЛокализации);
 		ТекстСообщения = НСтр("ru = 'Выполнено первоначальное заполнение локализованных данных на версию %1'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ВерсияЛокализации);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
		
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Первоначальное заполнение локализованных данных на версию %1 не выполнено по причине:
			|%2'");                                                                                        
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		ТекстСообщения = СтрШаблон(ТекстСообщения, ВерсияЛокализации, ОписаниеОшибки);
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти
	
#Область ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	// КР_НаличиеПакетовИнтеграцииПоОбъекту
	Отчеты.КР_НаличиеПакетовИнтеграцииПоОбъекту.ПриНастройкеВариантовОтчетов(Настройки);

КонецПроцедуры

// См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов
Процедура ПередДобавлениемКомандОтчетов(КомандыОтчетов, Параметры, СтандартнаяОбработка) Экспорт

	// КР_НаличиеПакетовИнтеграцииПоОбъекту
	Отчеты.КР_НаличиеПакетовИнтеграцииПоОбъекту.ПередДобавлениемКомандОтчетов(КомандыОтчетов, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти  

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

#КонецОбласти