#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("ОборотныеРегистрыУправленческогоУчета");
	МеханизмыДокумента.Добавить("СебестоимостьИПартионныйУчет");
	МеханизмыДокумента.Добавить("УчетДоходовРасходов");
	МеханизмыДокумента.Добавить("УчетПрочихАктивовПассивов");
	
	РаспределениеРасходовБудущихПериодовЛокализация.ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента);
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * ТаблицаИмяРегистра - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПартииПрочихРасходов(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаДвиженияДоходыРасходыПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры);
		
		РаспределениеРасходовБудущихПериодовЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	РаспределениеРасходовБудущихПериодовЛокализация.ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);

КонецПроцедуры

// Добавляет команду создания документа "Распределение РБП".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//	СтрокаТаблицыЗначений - добавленная команда
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.РаспределениеРасходовБудущихПериодов) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РаспределениеРасходовБудущихПериодов.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.РаспределениеРасходовБудущихПериодов);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьУчетПрочихДоходовРасходов";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
	РаспределениеРасходовБудущихПериодовЛокализация.ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры);

КонецПроцедуры


// Возвращает параметры выбора статей в документе.
// 
// Возвращаемое значение:
// 	Массив - Массив параметров настройки счетов учета (См. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики)
//
Функция ПараметрыВыбораСтатейИАналитик() Экспорт
	
	МассивПаметровВыбора = Новый Массив;
	
	#Область СтатьяРасходов
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходов");
	
	МассивПаметровВыбора.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	#Область РаспределениеРасходовСтатьяРасходов
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект.РаспределениеРасходов";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("РаспределениеРасходовСтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("РаспределениеРасходовАналитикаРасходов");
	
	МассивПаметровВыбора.Добавить(ПараметрыВыбора);
	#КонецОбласти
	
	Возврат МассивПаметровВыбора;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Текст запроса РБП к распределению (источники).
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаРасходыКРаспределениюИсточники() Экспорт

	#Область ТекстПриходыРБП
	ТекстПриходыРБПУпр = "
	|ВЫБРАТЬ &Первые,
	|			Приходы.Организация КАК Организация,
	|			Приходы.Подразделение КАК Подразделение,
	|			Приходы.СтатьяРасходов КАК СтатьяРасходов,
	|			Приходы.АналитикаРасходов КАК АналитикаРасходов,
	|			Приходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|			Приходы.Сумма КАК СуммаПриход,
	|			Приходы.СуммаУпр КАК СуммаУпрПриход,
	|			0 КАК СуммаРеглПриход,
	|			0 КАК ПостояннаяРазницаПриход,
	|			0 КАК ВременнаяРазницаПриход,
	|			0 КАК СуммаРасход,
	|			0 КАК СуммаУпрРасход,
	|			0 КАК СуммаРеглРасход,
	|			0 КАК ПостояннаяРазницаРасход,
	|			0 КАК ВременнаяРазницаРасход,
	|			0 КАК СуммаОстаток,
	|			0 КАК СуммаУпрОстаток,
	|			0 КАК СуммаРеглОстаток,
	|			0 КАК ПостояннаяРазницаОстаток,
	|			0 КАК ВременнаяРазницаОстаток,
	|			0 КАК СуммаОстатокИтог,
	|			0 КАК СуммаУпрОстатокИтог,
	|			0 КАК СуммаРеглОстатокИтог,
	|			0 КАК ПостояннаяРазницаОстатокИтог,
	|			0 КАК ВременнаяРазницаОстатокИтог,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ КАК ЭтоОВЗ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы КАК Приходы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|				ПО Статьи.Ссылка = Приходы.СтатьяРасходов
	|					И Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|				ПО Распределение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|					И Распределение.СтатьяРасходов = Приходы.СтатьяРасходов
	|					И Распределение.Проведен
	|					И Распределение.УправленческийУчет
	|					И Распределение.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|					И Распределение.Организация = Приходы.Организация
	|					И Распределение.Подразделение = Приходы.Подразделение
	|					И Распределение.АналитикаРасходов = Приходы.АналитикаРасходов
	|					И Распределение.НаправлениеДеятельности = Приходы.НаправлениеДеятельности
	|		ГДЕ
	|			Приходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|			И Приходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И НЕ Приходы.РасчетСебестоимости
	|			И Приходы.Активность
	|			И (&ПоВсемОрганизациям ИЛИ Приходы.Организация = &Организация)
	|			И (&ПоВсемПодразделениям ИЛИ Приходы.Подразделение = &Подразделение)
	|			И Распределение.Ссылка ЕСТЬ NULL
	|";
	
	ТекстПриходыРБПРегл = "
	|ВЫБРАТЬ &Первые,
	|			Приходы.Организация,
	|			Приходы.Подразделение,
	|			Приходы.СтатьяРасходов,
	|			Приходы.АналитикаРасходов,
	|			Приходы.НаправлениеДеятельности,
	|			0,
	|			0,
	|			Приходы.СуммаРегл,
	|			0,
	|			Приходы.СуммаРегл,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы КАК Приходы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|				ПО Статьи.Ссылка = Приходы.СтатьяРасходов
	|					И Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|				ПО Распределение.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|					И Распределение.СтатьяРасходов = Приходы.СтатьяРасходов
	|					И Распределение.Проведен
	|					И Распределение.РегламентированныйУчет
	|					И Распределение.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|					И Распределение.Организация = Приходы.Организация
	|					И Распределение.Подразделение = Приходы.Подразделение
	|					И Распределение.АналитикаРасходов = Приходы.АналитикаРасходов
	|					И Распределение.НаправлениеДеятельности = Приходы.НаправлениеДеятельности
	|		ГДЕ
	|			Приходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|			И Приходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И НЕ Приходы.РасчетСебестоимости
	|			И Приходы.Активность
	|			И (&ПоВсемОрганизациям ИЛИ Приходы.Организация = &Организация)
	|			И (&ПоВсемПодразделениям ИЛИ Приходы.Подразделение = &Подразделение)
	|			И Распределение.Ссылка ЕСТЬ NULL
	|";
	
	
	#КонецОбласти
	
	#Область ТекстРасходыРБП
	ТекстРасходыРБПУпр = "
	|		ВЫБРАТЬ &Первые,
	|			Расходы.Организация,
	|			Расходы.Подразделение,
	|			Расходы.СтатьяРасходов,
	|			Расходы.АналитикаРасходов,
	|			Расходы.НаправлениеДеятельности,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			Расходы.Сумма,
	|			Расходы.СуммаУпр,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы КАК Расходы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|				ПО (Статьи.Ссылка = Расходы.СтатьяРасходов)
	|					И (Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов))
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|				ПО Расходы.Регистратор = Распределение.Ссылка
	|		ГДЕ
	|			Расходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И Расходы.Период >= &НачалоПериода
	|			И Расходы.Активность
	|			И (&ПоВсемОрганизациям ИЛИ Расходы.Организация = &Организация)
	|			И (&ПоВсемПодразделениям ИЛИ Расходы.Подразделение = &Подразделение)
	|			И Распределение.УправленческийУчет
	|			И (Распределение.Дата <= &КонецПериода
	|				И НЕ Расходы.РасчетСебестоимости
	|				И НЕ Распределение.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|				ИЛИ Распределение.Дата < &НачалоПериода)
	|";
	
	ТекстРасходыРБПРегл = "
	|		ВЫБРАТЬ &Первые,
	|			Расходы.Организация,
	|			Расходы.Подразделение,
	|			Расходы.СтатьяРасходов,
	|			Расходы.АналитикаРасходов,
	|			Расходы.НаправлениеДеятельности,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			Расходы.СуммаРегл,
	|			0,
	|			Расходы.СуммаРегл,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы КАК Расходы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|				ПО (Статьи.Ссылка = Расходы.СтатьяРасходов)
	|					И (Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов))
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|				ПО Расходы.Регистратор = Распределение.Ссылка
	|		ГДЕ
	|			Расходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И Расходы.Период >= &НачалоПериода
	|			И Расходы.Активность
	|			И (&ПоВсемОрганизациям ИЛИ Расходы.Организация = &Организация)
	|			И (&ПоВсемПодразделениям ИЛИ Расходы.Подразделение = &Подразделение)
	|			И Распределение.РегламентированныйУчет
	|			И (Распределение.Дата <= &КонецПериода
	|				И НЕ Расходы.РасчетСебестоимости
	|				И НЕ Распределение.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|				ИЛИ Распределение.Дата < &НачалоПериода)
	|";
	
	
	#КонецОбласти
	
	#Область ТекстСписаниеМатериаловРаботНаРБП
	ТекстСписаниеМатериаловРаботНаРБПУпр = "
	|		ВЫБРАТЬ &Первые,
	|			ЕСТЬNULL(ОрганизацияПолучатель.Ссылка, Себестоимость.Организация),
	|			Себестоимость.Подразделение,
	|			Себестоимость.СтатьяРасходовСписания,
	|			Себестоимость.АналитикаРасходов,
	|			ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ИСТИНА КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|				ПО Статьи.Ссылка = Себестоимость.СтатьяРасходовСписания
	|					И Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|				ПО Назначения.Ссылка = Себестоимость.АналитикаУчетаНоменклатуры.Назначение
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияПолучатель
	|				ПО ОрганизацияПолучатель.Ссылка = Себестоимость.КорОрганизация
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|				ПО
	|					Распределение.Организация = Себестоимость.Организация
	|					И Распределение.Подразделение = Себестоимость.Подразделение
	|					И Распределение.СтатьяРасходов = Себестоимость.СтатьяРасходовСписания
	|					И Распределение.АналитикаРасходов = Себестоимость.АналитикаРасходов
	|					И Распределение.НаправлениеДеятельности = ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|					И Распределение.УправленческийУчет
	|					И Распределение.Проведен
	|					И Распределение.Дата >= &НачалоПериода 
	|					И Распределение.Дата <= &КонецПериода
	|		ГДЕ
	|			Себестоимость.Период >= &НачалоПериода
	|			И Себестоимость.Период <= &КонецПериода
	|			И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И (&ПоВсемОрганизациям ИЛИ Себестоимость.Организация = &Организация)
	|			И (&ПоВсемПодразделениям ИЛИ Себестоимость.Подразделение = &Подразделение)
	|			И Распределение.Ссылка ЕСТЬ NULL
	|			И ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА
	|				ИЗ РегистрСведений.ЗаданияКРасчетуСебестоимости КАК Задания
	|				ГДЕ
	|					Задания.Месяц = &НачалоПериода 
	|					И Задания.Организация = Себестоимость.Организация
	|				)
	|";
	ТекстСписаниеМатериаловРаботНаРБПРегл = "
	|		ВЫБРАТЬ &Первые,
	|			ЕСТЬNULL(ОрганизацияПолучатель.Ссылка, Себестоимость.Организация),
	|			Себестоимость.Подразделение,
	|			Себестоимость.СтатьяРасходовСписания,
	|			Себестоимость.АналитикаРасходов,
	|			ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ИСТИНА КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|				ПО Статьи.Ссылка = Себестоимость.СтатьяРасходовСписания
	|					И Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|				ПО Назначения.Ссылка = Себестоимость.АналитикаУчетаНоменклатуры.Назначение
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияПолучатель
	|				ПО ОрганизацияПолучатель.Ссылка = Себестоимость.КорОрганизация
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК Распределение
	|				ПО
	|					Распределение.Организация = Себестоимость.Организация
	|					И Распределение.Подразделение = Себестоимость.Подразделение
	|					И Распределение.СтатьяРасходов = Себестоимость.СтатьяРасходовСписания
	|					И Распределение.АналитикаРасходов = Себестоимость.АналитикаРасходов
	|					И Распределение.НаправлениеДеятельности = ЕСТЬNULL(Назначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|					И Распределение.РегламентированныйУчет
	|					И Распределение.Проведен
	|					И Распределение.Дата >= &НачалоПериода 
	|					И Распределение.Дата <= &КонецПериода
	|		ГДЕ
	|			Себестоимость.Период >= &НачалоПериода
	|			И Себестоимость.Период <= &КонецПериода
	|			И Себестоимость.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И (&ПоВсемОрганизациям ИЛИ Себестоимость.Организация = &Организация)
	|			И (&ПоВсемПодразделениям ИЛИ Себестоимость.Подразделение = &Подразделение)
	|			И ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА
	|				ИЗ РегистрСведений.ЗаданияКРасчетуСебестоимости КАК Задания
	|				ГДЕ
	|					Задания.Месяц = &НачалоПериода 
	|					И Задания.Организация = Себестоимость.Организация
	|				)
	|			И Распределение.Ссылка ЕСТЬ NULL
	|";
	
	
	#КонецОбласти
	
	
	#Область ТекстПереходящийОстатокРБП
	ТекстПереходящийОстатокРБПУпр = "
	|		ВЫБРАТЬ &Первые,
	|			Остатки.Организация,
	|			Остатки.Подразделение,
	|			Остатки.СтатьяРасходов,
	|			Остатки.АналитикаРасходов,
	|			Остатки.НаправлениеДеятельности,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			Остатки.СуммаОстаток,
	|			Остатки.СуммаУпрОстаток,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы.Остатки(
	|					&НачалоПериода, (&ПоВсемОрганизациям ИЛИ Организация = &Организация)
	|						И (&ПоВсемПодразделениям ИЛИ Подразделение = &Подразделение)
	|					И СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)) КАК Остатки
	|";

	ТекстПереходящийОстатокРБПРегл = "
	|		ВЫБРАТЬ &Первые,
	|			Остатки.Организация,
	|			Остатки.Подразделение,
	|			Остатки.СтатьяРасходов,
	|			Остатки.АналитикаРасходов,
	|			Остатки.НаправлениеДеятельности,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			Остатки.СуммаРеглОстаток,
	|			0,
	|			Остатки.СуммаРеглОстаток,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы.Остатки(
	|					&НачалоПериода, (&ПоВсемОрганизациям ИЛИ Организация = &Организация)
	|						И (&ПоВсемПодразделениям ИЛИ Подразделение = &Подразделение)
	|					И СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)) КАК Остатки
	|";

	
	#КонецОбласти
	
	#Область ТекстОстатокНераспределенныхРБП
	ТекстОстатокНераспределенныхРБПУпр = "
	|		ВЫБРАТЬ &Первые,
	|			Остатки.Организация,
	|			Остатки.Подразделение,
	|			Остатки.СтатьяРасходов,
	|			Остатки.АналитикаРасходов,
	|			Остатки.НаправлениеДеятельности,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			Остатки.СуммаОстаток,
	|			Остатки.СуммаУпрОстаток,
	|			0,
	|			0,
	|			0,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы.Остатки(
	|					ДАТАВРЕМЯ(3999, 1, 1), (&ПоВсемОрганизациям ИЛИ Организация = &Организация)
	|						И (&ПоВсемПодразделениям ИЛИ Подразделение = &Подразделение)
	|					И СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)) КАК Остатки
	|";

	ТекстОстатокНераспределенныхРБПРегл = "
	|		ВЫБРАТЬ &Первые,
	|			Остатки.Организация,
	|			Остатки.Подразделение,
	|			Остатки.СтатьяРасходов,
	|			Остатки.АналитикаРасходов,
	|			Остатки.НаправлениеДеятельности,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			Остатки.СуммаРеглОстаток,
	|			0,
	|			Остатки.СуммаРеглОстаток,
	|			ЛОЖЬ КАК БезСуммУпр,
	|			ЛОЖЬ КАК БезСуммРегл,
	|			ЛОЖЬ КАК БезСуммНУ,
	|			ЛОЖЬ
	|		ИЗ
	|			РегистрНакопления.ПрочиеРасходы.Остатки(
	|					ДАТАВРЕМЯ(3999, 1, 1), (&ПоВсемОрганизациям ИЛИ Организация = &Организация)
	|						И (&ПоВсемПодразделениям ИЛИ Подразделение = &Подразделение)
	|					И СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)) КАК Остатки
	|";

	
	#КонецОбласти
	
	
	ТекстыЗапроса = Новый Массив;
	
	ТекстыЗапроса.Добавить(ТекстПриходыРБПУпр);
	ТекстыЗапроса.Добавить(ТекстРасходыРБПУпр);
	ТекстыЗапроса.Добавить(ТекстСписаниеМатериаловРаботНаРБПУпр);
	ТекстыЗапроса.Добавить(ТекстПереходящийОстатокРБПУпр);
	ТекстыЗапроса.Добавить(ТекстОстатокНераспределенныхРБПУпр);
	
	ТекстыЗапроса.Добавить(ТекстПриходыРБПРегл);
	ТекстыЗапроса.Добавить(ТекстРасходыРБПРегл);
	ТекстыЗапроса.Добавить(ТекстСписаниеМатериаловРаботНаРБПРегл);
	ТекстыЗапроса.Добавить(ТекстПереходящийОстатокРБПРегл);
	ТекстыЗапроса.Добавить(ТекстОстатокНераспределенныхРБПРегл);

	
	Возврат СтрСоединить(ТекстыЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
КонецФункции

// Текст запроса расходы к распределению.
// 
// Параметры:
//  Первые - Булево - при Истина выбираются только первые записи
// 
// Возвращаемое значение:
//  Строка - Текст запроса расходы к распределению
Функция ТекстЗапросаРасходыКРаспределению(Первые = Ложь) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Данные.Организация КАК Организация,
		|	Данные.Подразделение КАК Подразделение,
		|	Данные.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	Данные.СтатьяРасходов КАК СтатьяРасходов,
		|	СтатьяДанных.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
		|	СтатьяДанных.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
		|	СтатьяДанных.ВариантРаспределенияРасходовНУ КАК ВариантРаспределенияРасходовНУ,
		|	Данные.АналитикаРасходов КАК АналитикаРасходов,
		|	Данные.СуммаОстаток + Данные.СуммаПриход - Данные.СуммаРасход КАК Сумма,
		|	Данные.СуммаУпрОстаток + Данные.СуммаУпрПриход - Данные.СуммаУпрРасход КАК СуммаУпр,
		|	Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход КАК СуммаРегл,
		|	Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход 
		|		- (Данные.ПостояннаяРазницаОстаток + Данные.ПостояннаяРазницаПриход - Данные.ПостояннаяРазницаРасход) 
		|		- (Данные.ВременнаяРазницаОстаток + Данные.ВременнаяРазницаПриход - Данные.ВременнаяРазницаРасход) КАК СуммаНУ,
		|	Данные.ПостояннаяРазницаОстаток + Данные.ПостояннаяРазницаПриход - Данные.ПостояннаяРазницаРасход КАК ПостояннаяРазница,
		|	Данные.ВременнаяРазницаОстаток + Данные.ВременнаяРазницаПриход - Данные.ВременнаяРазницаРасход КАК ВременнаяРазница,
		|	ВЫБОР 
		|		КОГДА СтатьяДанных.ВариантРаспределенияРасходовУпр 
		|			<> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) ТОГДА 1
		|		КОГДА Данные.БезСуммУпр ТОГДА 2
		|		КОГДА Данные.СуммаОстаток + Данные.СуммаПриход - Данные.СуммаРасход = 0 ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаСтатус,
		|	ВЫБОР 
		|		КОГДА СтатьяДанных.ВариантРаспределенияРасходовУпр 
		|			<> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) ТОГДА 1
		|		КОГДА Данные.БезСуммУпр ТОГДА 2
		|		КОГДА Данные.СуммаУпрОстаток + Данные.СуммаУпрПриход - Данные.СуммаУпрРасход = 0 ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрСтатус,
		|	ВЫБОР 
		|		КОГДА СтатьяДанных.ВариантРаспределенияРасходовРегл 
		|			<> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) ТОГДА 1
		|		КОГДА Данные.БезСуммРегл ТОГДА 2
		|		КОГДА Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход = 0 ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаРеглСтатус,
		|	ВЫБОР 
		|		КОГДА СтатьяДанных.ВариантРаспределенияРасходовНУ 
		|			<> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) ТОГДА 1
		|		КОГДА Данные.БезСуммНУ ТОГДА 2
		|		КОГДА Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход 
		|			- (Данные.ПостояннаяРазницаОстаток + Данные.ПостояннаяРазницаПриход - Данные.ПостояннаяРазницаРасход) 
		|			- (Данные.ВременнаяРазницаОстаток + Данные.ВременнаяРазницаПриход - Данные.ВременнаяРазницаРасход) = 0 ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНУСтатус,
		|	Данные.БезСуммУпр КАК РасчетСуммАвтоУпр,
		|	Данные.БезСуммРегл КАК РасчетСуммАвтоРегл,
		|	Данные.БезСуммНУ КАК РасчетСуммАвтоНУ,
		|	(Данные.СуммаОстаток + Данные.СуммаПриход - Данные.СуммаРасход) <> 0
		|		И ЕСТЬNULL(Данные.СуммаОстаток, 0) <> 0 КАК ЕстьОстаткиСумма,
		|	(Данные.СуммаУпрОстаток + Данные.СуммаУпрПриход - Данные.СуммаУпрРасход) <> 0
		|		И ЕСТЬNULL(Данные.СуммаУпрОстаток, 0) <> 0 КАК ЕстьОстаткиСуммаУпр,
		|	(Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход) <> 0
		|		И ЕСТЬNULL(Данные.СуммаРеглОстаток, 0) <> 0 КАК ЕстьОстаткиСуммаРегл,
		|	(Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход - (Данные.ПостояннаяРазницаОстаток + Данные.ПостояннаяРазницаПриход 
		|		- Данные.ПостояннаяРазницаРасход) - (Данные.ВременнаяРазницаОстаток + Данные.ВременнаяРазницаПриход - Данные.ВременнаяРазницаРасход)) <> 0
		|		И (ЕСТЬNULL(Данные.СуммаРеглОстаток, 0) 
		|			- ЕСТЬNULL(Данные.ПостояннаяРазницаОстаток, 0) 
		|			- ЕСТЬNULL(Данные.ВременнаяРазницаОстаток, 0)) <> 0 КАК ЕстьОстаткиСуммаНУ,
		|	ЕСТЬNULL(Данные.СуммаОстатокИтог, 0) = 0 КАК ВсеРаспределеноСумма,
		|	ЕСТЬNULL(Данные.СуммаУпрОстатокИтог, 0) = 0 КАК ВсеРаспределеноСуммаУпр,
		|	ЕСТЬNULL(Данные.СуммаРеглОстатокИтог, 0) = 0 КАК ВсеРаспределеноСуммаРегл,
		|	(ЕСТЬNULL(Данные.СуммаРеглОстатокИтог, 0) 
		|		- ЕСТЬNULL(Данные.ПостояннаяРазницаОстатокИтог, 0) 
		|		- ЕСТЬNULL(Данные.ВременнаяРазницаОстатокИтог, 0)) = 0 КАК ВсеРаспределеноСуммаНУ
		|ИЗ
		|	(ВЫБРАТЬ
		|		Данные.Организация КАК Организация,
		|		Данные.Подразделение КАК Подразделение,
		|		Данные.СтатьяРасходов КАК СтатьяРасходов,
		|		Данные.АналитикаРасходов КАК АналитикаРасходов,
		|		Данные.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|		СУММА(Данные.СуммаПриход) КАК СуммаПриход,
		|		СУММА(Данные.СуммаУпрПриход) КАК СуммаУпрПриход,
		|		СУММА(Данные.СуммаРеглПриход) КАК СуммаРеглПриход,
		|		СУММА(Данные.ПостояннаяРазницаПриход) КАК ПостояннаяРазницаПриход,
		|		СУММА(Данные.ВременнаяРазницаПриход) КАК ВременнаяРазницаПриход,
		|		СУММА(Данные.СуммаРасход) КАК СуммаРасход,
		|		СУММА(Данные.СуммаУпрРасход) КАК СуммаУпрРасход,
		|		СУММА(Данные.СуммаРеглРасход) КАК СуммаРеглРасход,
		|		СУММА(Данные.ПостояннаяРазницаРасход) КАК ПостояннаяРазницаРасход,
		|		СУММА(Данные.ВременнаяРазницаРасход) КАК ВременнаяРазницаРасход,
		|		СУММА(Данные.СуммаОстаток) КАК СуммаОстаток,
		|		СУММА(Данные.СуммаУпрОстаток) КАК СуммаУпрОстаток,
		|		СУММА(Данные.СуммаРеглОстаток) КАК СуммаРеглОстаток,
		|		СУММА(Данные.ПостояннаяРазницаОстаток) КАК ПостояннаяРазницаОстаток,
		|		СУММА(Данные.ВременнаяРазницаОстаток) КАК ВременнаяРазницаОстаток,
		|		СУММА(Данные.СуммаОстатокИтог) КАК СуммаОстатокИтог,
		|		СУММА(Данные.СуммаУпрОстатокИтог) КАК СуммаУпрОстатокИтог,
		|		СУММА(Данные.СуммаРеглОстатокИтог) КАК СуммаРеглОстатокИтог,
		|		СУММА(Данные.ПостояннаяРазницаОстатокИтог) КАК ПостояннаяРазницаОстатокИтог,
		|		СУММА(Данные.ВременнаяРазницаОстатокИтог) КАК ВременнаяРазницаОстатокИтог,
		|		МАКСИМУМ(Данные.БезСуммУпр) КАК БезСуммУпр,
		|		МАКСИМУМ(Данные.БезСуммРегл) КАК БезСуммРегл,
		|		МАКСИМУМ(Данные.БезСуммНУ) КАК БезСуммНУ
		|	ИЗ
		|		&ИсточникиРБП КАК Данные
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Данные.Организация,
		|		Данные.Подразделение,
		|		Данные.СтатьяРасходов,
		|		Данные.АналитикаРасходов,
		|		Данные.НаправлениеДеятельности) КАК Данные
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьяДанных
		|	ПО Данные.СтатьяРасходов = СтатьяДанных.Ссылка
		|ГДЕ
		|	(Данные.СуммаОстаток + Данные.СуммаПриход - Данные.СуммаРасход <> 0
		|			ИЛИ Данные.СуммаУпрОстаток + Данные.СуммаУпрПриход - Данные.СуммаУпрРасход <> 0
		|			ИЛИ Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход <> 0
		|			ИЛИ Данные.СуммаРеглОстаток + Данные.СуммаРеглПриход - Данные.СуммаРеглРасход 
		|				- (Данные.ПостояннаяРазницаОстаток + Данные.ПостояннаяРазницаПриход - Данные.ПостояннаяРазницаРасход) 
		|				- (Данные.ВременнаяРазницаОстаток + Данные.ВременнаяРазницаПриход - Данные.ВременнаяРазницаРасход) <> 0
		|			ИЛИ Данные.БезСуммУпр
		|			ИЛИ Данные.БезСуммРегл
		|			ИЛИ Данные.БезСуммНУ)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникиРБП", "("+ТекстЗапросаРасходыКРаспределениюИсточники()+")");
	
	Если Первые Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Первые,", "ПЕРВЫЕ 1");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Первые,", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	РаспределениеРасходовБудущихПериодовЛокализация.ДобавитьКомандыПечати(КомандыПечати);

КонецПроцедуры

#КонецОбласти

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;

	Запрос.УстановитьПараметр("Валюта", Константы.ВалютаУправленческогоУчета.Получить());
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
	// Проверим наличие даты запрета изменения по датам в строках документа.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Дата КАК Дата
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|ГДЕ
	|	Строки.Ссылка = &Ссылка
	|";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	ШаблонЗапретаДанных = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	СтрокаШаблона = ШаблонЗапретаДанных.Добавить();
	СтрокаШаблона.Раздел = "РегламентныеОперации";
	ПериодЗапретаИзмененияДанных = Дата(1,1,1);
	
	Пока РезультатЗапроса.Следующий() Цикл
		СтрокаШаблона.Дата = НачалоДня(РезультатЗапроса.Дата);
		Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ШаблонЗапретаДанных)
		 И ПериодЗапретаИзмененияДанных < РезультатЗапроса.Дата Тогда
			ПериодЗапретаИзмененияДанных = РезультатЗапроса.Дата;
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ПериодЗапретаИзмененияДанных", ПериодЗапретаИзмененияДанных);

КонецПроцедуры

Функция ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПрочиеРасходы";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Строки.Дата                             КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)  КАК ВидДвижения,
	|	ДанныеДокумента.Организация             КАК Организация,
	|	ДанныеДокумента.Подразделение           КАК Подразделение,
	|	ДанныеДокумента.СтатьяРасходов          КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов       КАК АналитикаРасходов,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                            КАК ВидДеятельностиНДС,
	|	ДанныеДокумента.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	Строки.Подразделение                    КАК КорПодразделение,
	|	Строки.СтатьяРасходов					КАК КорСтатьяРасходов,
	|	Строки.АналитикаРасходов				КАК КорАналитикаРасходов,
	|	СУММА(Строки.Сумма)                            КАК СуммаСНДС,
	|	СУММА(Строки.СуммаУпр)                         КАК СуммаБезНДС,
	|	СУММА(Строки.СуммаУпр)                         КАК СуммаБезНДСУпр,
	|	СУММА(Строки.СуммаРегл)                        КАК СуммаСНДСРегл,
	|	СУММА(Строки.СуммаРегл)                        КАК СуммаБезНДСРегл,
	|	СУММА(Строки.ПостояннаяРазница)                КАК ПостояннаяРазница,
	|	СУММА(Строки.ВременнаяРазница)                 КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП) КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	Строки.ИдентификаторСтроки                     КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРБП)  КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ВтИсходныеПрочиеРасходы
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДанныеДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО ДанныеДокумента.Ссылка = Строки.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (Строки.Сумма <> 0 ИЛИ Строки.СуммаУпр <> 0
	|		ИЛИ Строки.СуммаРегл <> 0
	|		ИЛИ Строки.ПостояннаяРазница <> 0
	|		ИЛИ Строки.ВременнаяРазница <> 0)
	// Двжения формируем по строкам, для которых нет запрета изменения данных.
	|	И Строки.Дата > &ПериодЗапретаИзмененияДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Подразделение,
	|	ДанныеДокумента.СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов,
	|	ДанныеДокумента.НаправлениеДеятельности,
	|	Строки.ИдентификаторСтроки, 
	|	Строки.Подразделение,
	|	Строки.СтатьяРасходов,
	|	Строки.АналитикаРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Строки.Дата								КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)	КАК ВидДвижения,
	|	ДанныеДокумента.Организация				КАК Организация,
	|	Строки.Подразделение                    КАК Подразделение,
	|	Строки.СтатьяРасходов					КАК СтатьяРасходов,
	|	Строки.АналитикаРасходов				КАК АналитикаРасходов,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                            КАК ВидДеятельностиНДС,
	|	ДанныеДокумента.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеДокумента.Подразделение           КАК КорПодразделение,
	|	ДанныеДокумента.СтатьяРасходов          КАК КорСтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов       КАК КорАналитикаРасходов,
	|	СУММА(Строки.Сумма)                     КАК СуммаСНДС,
	|	СУММА(Строки.СуммаУпр)                  КАК СуммаБезНДС,
	|	СУММА(Строки.СуммаУпр)                  КАК СуммаБезНДСУпр,
	|	СУММА(Строки.СуммаРегл)                 КАК СуммаСНДСРегл,
	|	СУММА(Строки.СуммаРегл)                 КАК СуммаБезНДСРегл,
	|	СУММА(Строки.ПостояннаяРазница)         КАК ПостояннаяРазница,
	|	СУММА(Строки.ВременнаяРазница)          КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП) КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	Строки.ИдентификаторСтроки              КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРБП)  КАК НастройкаХозяйственнойОперации
	|
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = Строки.Ссылка
	|ГДЕ
	|	Строки.Ссылка = &Ссылка
	|	И (Строки.Сумма <> 0 ИЛИ Строки.СуммаУпр <> 0
	|		ИЛИ Строки.СуммаРегл <> 0
	|		ИЛИ Строки.ПостояннаяРазница <> 0
	|		ИЛИ Строки.ВременнаяРазница <> 0)
	// Двжения формируем по строкам, для которых нет запрета изменения данных.
	|	И Строки.Дата > &ПериодЗапретаИзмененияДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Дата,
	|	ДанныеДокумента.Организация,
	|	Строки.Подразделение,
	|	Строки.СтатьяРасходов,
	|	Строки.АналитикаРасходов,
	|	ДанныеДокумента.НаправлениеДеятельности,
	|	Строки.ИдентификаторСтроки, 
	|	ДанныеДокумента.Подразделение,
	|	ДанныеДокумента.СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов
	|
	// Для периодов с установленной датой запрета изменения данных движения берем из регистра.
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Движения.Период,
	|	Движения.ВидДвижения,
	|	Движения.Организация,
	|	Движения.Подразделение,
	|	Движения.СтатьяРасходов,
	|	Движения.АналитикаРасходов,
	|	Движения.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	Движения.КорНаправлениеДеятельности,
	|	Движения.КорПодразделение,
	|	Движения.КорСтатьяРасходов,
	|	Движения.КорАналитикаРасходов,
	|	Движения.Сумма       КАК СуммаСНДС,
	|	Движения.СуммаБезНДС КАК СуммаБезНДС,
	|	Движения.СуммаУпр    КАК СуммаБезНДСУпр,
	|	Движения.СуммаРегл   КАК СуммаСНДСРегл,
	|	Движения.СуммаРегл   КАК СуммаБезНДСРегл,
	|	Движения.ПостояннаяРазница,
	|	Движения.ВременнаяРазница,
	|	Движения.ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	Движения.ИдентификаторФинЗаписи,
	|	Движения.НастройкаХозяйственнойОперации
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Движения
	|ГДЕ
	|	Движения.Регистратор = &Ссылка
	|	И Движения.Период <= &ПериодЗапретаИзмененияДанных
	|	И НЕ Движения.РасчетПартий
	|	И НЕ Движения.РасчетСебестоимости
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса) Экспорт
	
	ИмяРегистра = "ВтПрочиеРасходы";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ДополнительныеПоля = "КорНаправлениеДеятельности,КорПодразделение,КорСтатьяРасходов,КорАналитикаРасходов";
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаВтПрочиеРасходы(ДополнительныеПоля);
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ДополнительныеПоля = "КорНаправлениеДеятельности,КорПодразделение,КорСтатьяРасходов,КорАналитикаРасходов";
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаПрочиеРасходы(ДополнительныеПоля);
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПартииПрочихРасходов";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Строки.Дата                             КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	Строки.Ссылка.Организация               КАК Организация,
	|	ВЫБОР
	|		КОГДА Строки.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА Строки.Подразделение
	|		ИНАЧЕ Строки.Ссылка.Подразделение
	|	КОНЕЦ                                   КАК Подразделение,
	|	&Ссылка                                 КАК ДокументПоступленияРасходов,
	|	Строки.СтатьяРасходов                   КАК СтатьяРасходов,
	|	Строки.АналитикаРасходов                КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                            КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО                            КАК АналитикаУчетаПартий,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                            КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО                            КАК ВидДеятельностиНДС,
	|	
	|	Строки.Сумма                            КАК Стоимость,
	|	Строки.СуммаУпр                         КАК СтоимостьБезНДС,
	|	0                                       КАК НДСУпр,
	|	Строки.СуммаРегл                        КАК СтоимостьРегл,
	|	Строки.ПостояннаяРазница                КАК ПостояннаяРазница,
	|	Строки.ВременнаяРазница                 КАК ВременнаяРазница,
	|	0                                       КАК НДСРегл,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП) КАК ХозяйственнаяОперация,
	|	
	|	Строки.ИдентификаторСтроки              КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРБП)  КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ВтИсходныеПартииПрочихРасходов
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = Строки.Ссылка
	|ГДЕ
	|	Строки.Ссылка = &Ссылка
	|	И (Строки.Сумма <> 0 ИЛИ Строки.СуммаУпр <> 0
	|		ИЛИ Строки.СуммаРегл <> 0
	|		ИЛИ Строки.ПостояннаяРазница <> 0
	|		ИЛИ Строки.ВременнаяРазница <> 0)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаТаблицаВтПартииПрочихРасходов(Запрос, ТекстыЗапроса) Экспорт
	
	ИмяРегистра = "ВтПартииПрочихРасходов";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаВтПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПартииПрочихРасходов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПартииПрочихРасходов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПартииПрочихРасходов(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияДоходыРасходыПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ДвиженияДоходыРасходыПрочиеАктивыПассивы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Строки.НомерСтроки,
	|	Строки.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП) КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.СтатьяРасходов КАК Статья,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	Строки.Подразделение КАК КорПодразделение,
	|	Строки.СтатьяРасходов КАК КорСтатья,
	|	Строки.АналитикаРасходов КАК КорАналитикаРасходов,
	|
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|
	|	Строки.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|		 ИЛИ НЕ &УправленческийУчетОрганизаций
	|			ТОГДА 0
	|		ИНАЧЕ
	|			Строки.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	Строки.СуммаРегл КАК СуммаРегл,
	|
	|	&Валюта КАК Валюта,
	|	Строки.Сумма КАК СуммаВВалюте
	|
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДанныеДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (Строки.Сумма <> 0 ИЛИ Строки.СуммаУпр <> 0 ИЛИ Строки.СуммаРегл <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеАктивыПассивы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПартииПрочихРасходов(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеАктивыПассивы.ТекстЗапросаТаблицаПрочиеАктивыПассивы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

#Область Документы_РаспределениеРасходовБудущихПериодов_ОбработатьДанныеДляПереходаНаНовуюВерсию

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.РаспределениеРасходовБудущихПериодов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.7.228";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("173afe82-319c-4c13-91f4-d2ca087cdc11");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.РаспределениеРасходовБудущихПериодов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет поле ""Идентификатор строки"" в табличных частях.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.ПланыВидовХарактеристик.СтатьиРасходов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.РаспределениеРасходовБудущихПериодов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.РаспределениеРасходовБудущихПериодов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");

#КонецОбласти

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК Документ
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК ТабЧасть
	|		ГДЕ
	|			ТабЧасть.Ссылка = Документ.Ссылка
	|			И ТабЧасть.ИдентификаторСтроки = """")
	|			
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК Документ
	|ГДЕ
	|	Документ.Проведен
	|		И НЕ Документ.УправленческийУчет
	|		И НЕ Документ.РегламентированныйУчет
	|		И НЕ Документ.НалоговыйУчет
	|			
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК Документ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|	ПО Статьи.Ссылка = Документ.СтатьяРасходов
	|	
	|ГДЕ
	|	Документ.Проведен
	|		И Документ.РегламентированныйУчет
	|		И НЕ Документ.НалоговыйУчет
	|		И Статьи.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасходов,
	|	Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) КАК УправленческийУчет,
	|	Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) КАК РегламентированныйУчет,
	|	Статьи.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов) КАК НалоговыйУчет
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	НастройкиСтатей = Новый Соответствие();
	Пока Выборка.Следующий() Цикл
		НастройкиСтатей.Вставить(Выборка.СтатьяРасходов, Новый Структура("УправленческийУчет,РегламентированныйУчет,НалоговыйУчет", 
			Выборка.УправленческийУчет, Выборка.РегламентированныйУчет, Выборка.НалоговыйУчет));
	КонецЦикла;
	
	Для Каждого Документ Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			Ссылка = Документ.Ссылка;
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ДокументОбъект = Ссылка.ПолучитьОбъект();
			
			Если ДокументОбъект <> Неопределено Тогда
				ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ДокументОбъект, "РаспределениеРасходов");
				НастройкаСтатьи = НастройкиСтатей.Получить(ДокументОбъект.СтатьяРасходов);
				Если НЕ НастройкаСтатьи = Неопределено Тогда
					Если Не ДокументОбъект.УправленческийУчет И Не ДокументОбъект.РегламентированныйУчет И Не ДокументОбъект.НалоговыйУчет Тогда
						ДокументОбъект.УправленческийУчет = НастройкаСтатьи.УправленческийУчет;
						ДокументОбъект.РегламентированныйУчет = НастройкаСтатьи.РегламентированныйУчет;
						ДокументОбъект.НалоговыйУчет = НастройкаСтатьи.НалоговыйУчет;
					КонецЕсли;
					Если НастройкаСтатьи.НалоговыйУчет И ДокументОбъект.РегламентированныйУчет И Не ДокументОбъект.НалоговыйУчет Тогда
						ДокументОбъект.НалоговыйУчет = НастройкаСтатьи.НалоговыйУчет;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ДокументОбъект <> Неопределено И ДокументОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Ссылка);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Документ.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

#КонецОбласти

#Область ФормированиеГиперссылкиВЖурналеПроизводства

Функция СформироватьГиперссылкуКОформлению(Параметры) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.Документы.РаспределениеРасходовБудущихПериодов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРасходыКРаспределению(Истина);
	
	лНачалоПериода = ?(ЗначениеЗаполнено(Параметры.Период), НачалоМесяца(Параметры.Период), НачалоМесяца(ТекущаяДатаСеанса()));
	лКонецПериода = ?(ЗначениеЗаполнено(Параметры.Период), КонецМесяца(Параметры.Период), КонецМесяца(ТекущаяДатаСеанса()));
	
	Запрос.УстановитьПараметр("НачалоПериода", лНачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", лКонецПериода);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Не ЗначениеЗаполнено(Параметры.Организация));
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("ПоВсемПодразделениям", Не ЗначениеЗаполнено(Параметры.Подразделение));
	
	ТекстГиперссылки = НСтр("ru = 'Распределение расходов будущих периодов'");
	
	УстановитьПривилегированныйРежим(Истина);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Новый ФорматированнаяСтрока(ТекстГиперссылки,,ЦветаСтиля.НезаполненноеПолеТаблицы,,
			"Документ.РаспределениеРасходовБудущихПериодов.Форма.ФормаСпискаДокументов");
	Иначе
		Возврат Новый ФорматированнаяСтрока(ТекстГиперссылки,,,,
			"Документ.РаспределениеРасходовБудущихПериодов.Форма.ФормаСпискаДокументов");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
