#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Отчет.СебестоимостьТоваров.МодульОбъекта.ПриКомпоновкеРезультата");
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	КонтрольИспользованияАналитикиОборотов(КомпоновщикНастроек);
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	УдалитьПоказателиИзОтборовРасшифровки(КомпоновщикНастроек);
	УдалитьЦеновыеПоказателиИзВыбранныхПолейРасшифровки(КомпоновщикНастроек);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляНачальныйОстаток",
		НСтр("ru = 'Начальный остаток'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляВсегоПриход",
		НСтр("ru = 'Всего приход'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляВсегоРасход",
		НСтр("ru = 'Всего расход'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляКонечныйОстаток",
		НСтр("ru = 'Конечный остаток'"));
		
	ИсключаемыеХозОперации = Новый Массив();
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСПоступлениеИзТоваровВПути);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтХранителя);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПереработчику);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПереработчику2_5);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтПереработчика);
	ИсключаемыеХозОперации.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтПереработчика2_5);
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ИсключаемыеХозОперации", ИсключаемыеХозОперации);
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.СебестоимостьСДетализацией; // НаборДанныхОбъединениеСхемыКомпоновкиДанных
	НаборДанных.Запрос = ТекстЗапроса();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	// Проверим, используются ли оборотные аналитики
	КомпоновкаДанныхСервер.ОптимизацияИспользованияОборотнойАналитики(МакетКомпоновки, СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолей(), МакетКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроверяемыеПоля = Новый Массив;
	ПроверяемыеПоля.Добавить("Партнер");
	ПроверяемыеПоля.Добавить("Менеджер");
	ПроверяемыеПоля.Добавить("Подразделение");
	ПроверяемыеПоля.Добавить("Сделка");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьПредупреждениеОбОсобенностяхФормированияОтчета(
		ДокументРезультат,
		КомпоновщикНастроек,
		ПроверяемыеПоля,
		Ложь,  // Актуализировать партии
		"СтруктураПредприятия.Организация");
	
	РасчетСебестоимостиПрикладныеАлгоритмы.АктуализироватьПартииДляОтчетов(
		ДокументРезультат,
		КомпоновщикНастроек,
		"СтруктураПредприятия.Организация");
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьПредупреждениеОПредварительномЗакрытииМесяца(ДокументРезультат, КомпоновщикНастроек);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	КомпоновкаДанныхСервер.ОформитьДиаграммыОтчета(КомпоновщикНастроек, ДокументРезультат);
	
	ВспомогательныеПараметры = Новый Массив;
	КомпоновкаДанныхСервер.ДобавитьВспомогательныеПараметрыОтчетаПоФункциональнымОпциям(ВспомогательныеПараметры);
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(
		СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметры);
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(
		СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ДокументРезультат.ВысотаТаблицы);
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		НастроитьПараметрыОтчетаПоВариантуОтчета(Контекст.НастройкиОтчета, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольИспользованияАналитикиОборотов(КомпоновщикНастроек)
	Группировки = КомпоновкаДанныхКлиентСервер.ПолучитьГруппировки(КомпоновщикНастроек);
	
	Для Каждого Группировка Из Группировки Цикл
		ГруппировкаПоля = Группировка.Значение.ПоляГруппировки; // ПоляГруппировкиКомпоновкиДанных
		ПоляГруппировки = ГруппировкаПоля.Элементы;
		КоличествоПолейАналитикиОборотов = 0;
		Для Каждого ПолеГруппировки Из ПоляГруппировки Цикл 
			Если Найти(Строка(ПолеГруппировки.Поле), "АналитикаОборотов") >0 Тогда
				КоличествоПолейАналитикиОборотов = КоличествоПолейАналитикиОборотов + 1; 
			КонецЕсли;
			Если КоличествоПолейАналитикиОборотов > 1 Тогда
				ВызватьИсключение НСтр("ru= 'Множественное использование полей аналитики оборотов в группировках не поддерживается.'") ;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоПолейАналитикиОборотов >= 1 И ПоляГруппировки.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru= 'Совместное использование в группировках полей аналитики оборотов и других полей не поддерживается.'") ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура настройки параметров отчета.
//
// Параметры:
//	НастройкиОтчета - Структура - настройки отчета
//	НовыеНастройкиКД - НастройкиКомпоновкиДанных - настройки компоновки данных
//	НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных - пользовательские настройки 
//
Процедура НастроитьПараметрыОтчетаПоВариантуОтчета(НастройкиОтчета, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД)
	
	ПредопределенныйВариант = ПолучитьПредопределенныйВариант(НастройкиОтчета.ВариантСсылка);
	
	ПараметрДанныеОтчета = СхемаКомпоновкиДанных.Параметры.Найти("ДанныеОтчета");
	ПараметрПоПредприятию = СхемаКомпоновкиДанных.Параметры.Найти("ПоПредприятию");
	
	СписокВыбора = Новый СписокЗначений;
	
	Если ПредопределенныйВариант.КлючВарианта = "СебестоимостьТоваровПоПредприятию"
	 ИЛИ ПредопределенныйВариант.КлючВарианта = "СебестоимостьТоваровПоОперациямПоПредприятию"
	 ИЛИ ПредопределенныйВариант.КлючВарианта = "ДинамикаЗакупокПредприятия" Тогда
		
		СписокВыбора.Добавить(1, НСтр("ru = 'В валюте упр. учета с НДС'"));
		СписокВыбора.Добавить(2, НСтр("ru = 'В валюте упр. учета без НДС'"));
		ПараметрПоПредприятию.Значение = Истина;
		
	Иначе
		
		Если РасчетСебестоимостиПовтИсп.УправленческийУчетОрганизаций() Тогда
			СписокВыбора.Добавить(3, НСтр("ru = 'В валюте упр. учета'"));
		КонецЕсли;
		СписокВыбора.Добавить(4, НСтр("ru = 'В валюте регл. учета'"));
		ПараметрПоПредприятию.Значение = Ложь;
		
	КонецЕсли;
	
	ПараметрДанныеОтчета.УстановитьДоступныеЗначения(СписокВыбора);
	
	Если НовыеНастройкиКД = Неопределено
		Или НовыеПользовательскиеНастройкиКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметраДанныеОтчета = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДанныеОтчета"));
	НастройкаДанныеОтчета = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ЗначениеПараметраДанныеОтчета.ИдентификаторПользовательскойНастройки);
	Если Не НастройкаДанныеОтчета = Неопределено
		И СписокВыбора.НайтиПоЗначению(НастройкаДанныеОтчета.Значение) = Неопределено Тогда
		НастройкаДанныеОтчета.Значение = СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПредопределенныйВариант(Знач Вариант)
	
	КлючиВариантов = Новый Массив;
	КлючиВариантов.Добавить("СебестоимостьТоваровБазовая");
	КлючиВариантов.Добавить("СебестоимостьТоваровПоОперациямБазовая");
	КлючиВариантов.Добавить("ДинамикаЗакупокПредприятия");
	КлючиВариантов.Добавить("ДинамикаЗакупокОрганизаций");
	КлючиВариантов.Добавить("СебестоимостьТоваровПоОрганизациям");
	КлючиВариантов.Добавить("СебестоимостьТоваровПоОперациямПоОрганизациям");
	КлючиВариантов.Добавить("СебестоимостьТоваровПоПредприятию");
	КлючиВариантов.Добавить("СебестоимостьТоваровПоОперациямПоПредприятию");
	
	// Если вариант не задан, то возьмем первый из списка по умолчанию
	Если Вариант = Неопределено Тогда
		Возврат Новый Структура("КлючВарианта", КлючиВариантов[0]);
	КонецЕсли;
	
	Пока КлючиВариантов.Найти(Вариант.КлючВарианта) = Неопределено
		И ЗначениеЗаполнено(Вариант.Родитель) Цикл
		Вариант = Вариант.Родитель;
	КонецЦикла;
	
	Возврат Вариант;
	
КонецФункции

Функция ТекстЗапроса()
	
	#Область ОтборПоСегментуНоменклатуры
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сегменты.Номенклатура КАК Номенклатура,
	|	Сегменты.Характеристика КАК Характеристика,
	|	ИСТИНА КАК ИспользуетсяОтборПоСегментуНоменклатуры
	|ПОМЕСТИТЬ ОтборПоСегментуНоменклатуры
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК Сегменты
	|{ГДЕ
	|	Сегменты.Сегмент.* КАК СегментНоменклатуры,
	|	Сегменты.Номенклатура.* КАК Номенклатура,
	|	Сегменты.Характеристика.* КАК Характеристика}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ИспользуетсяОтборПоСегментуНоменклатуры
	|;";
	#КонецОбласти
	
	#Область ОстаткиИДвижения
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	0 КАК НаборДанных,
	|	СебестоимостьТоваровОстатки.ПериодСекунда КАК ПериодСекунда,
	|	СебестоимостьТоваровОстатки.ПериодДень КАК ПериодДень,
	|	СебестоимостьТоваровОстатки.ПериодНеделя КАК ПериодНеделя,
	|	СебестоимостьТоваровОстатки.ПериодДекада КАК ПериодДекада,
	|	СебестоимостьТоваровОстатки.ПериодМесяц КАК ПериодМесяц,
	|	СебестоимостьТоваровОстатки.ПериодКвартал КАК ПериодКвартал,
	|	СебестоимостьТоваровОстатки.ПериодПолугодие КАК ПериодПолугодие,
	|	СебестоимостьТоваровОстатки.ПериодГод КАК ПериодГод,
	|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	АналитикаНоменклатуры.Характеристика КАК Характеристика,
	|	АналитикаНоменклатуры.Серия КАК Серия,
	|	АналитикаНоменклатуры.МестоХранения КАК Склад,
	|	АналитикаНоменклатуры.Назначение КАК Назначение,
	|	АналитикаНоменклатуры.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СебестоимостьТоваровОстатки.ВидЗапасов КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА СебестоимостьТоваровОстатки.ВидЗапасов.ГруппаФинансовогоУчета
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	СебестоимостьТоваровОстатки.Организация КАК Организация,
	|	СебестоимостьТоваровОстатки.Партия КАК Партия,
	|	СебестоимостьТоваровОстатки.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	СебестоимостьТоваровОстатки.РазделУчета КАК РазделУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка) КАК СтатьяДоходов,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка) КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Партнер,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка) КАК Соглашение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка) КАК ТипЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка) КАК ХозяйственнаяОперацияСправочник,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперацияПрихода,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперацияРасхода,
	|	НЕОПРЕДЕЛЕНО КАК Документ,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличества = 1
	|			ТОГДА ВЫБОР
	|					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
	|						ТОГДА 1 / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|	КОНЕЦ * СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличества = 1
	|			ТОГДА ВЫБОР
	|					КОГДА АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов <> 0
	|						ТОГДА 1 / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|	КОНЕЦ * СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток * &ТекстЗапросаВесУпаковки КАК ВесНачальныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток * &ТекстЗапросаВесУпаковки КАК ВесКонечныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоНачальныйОстаток * &ТекстЗапросаОбъемУпаковки КАК ОбъемНачальныйОстаток,
	|	СебестоимостьТоваровОстатки.КоличествоКонечныйОстаток * &ТекстЗапросаОбъемУпаковки КАК ОбъемКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглНачальныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьПоступленияНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглКонечныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьПоступленияКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыРеглНачальныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ДопРасходыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ДопРасходыРеглКонечныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ДопРасходыКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыРеглНачальныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ТрудозатратыНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыРеглКонечныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ТрудозатратыКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглНачальныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглКонечныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглНачальныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ПостатейныеПеременныеНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглКонечныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК ПостатейныеПеременныеКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглНачальныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСНачальныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрНачальныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК СебестоимостьНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеСНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеСНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглКонечныйОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваровОстатки.СтоимостьБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеБезНДСКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеБезНДСКонечныйОстаток
	|				ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеУпрКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеУпрКонечныйОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК СебестоимостьКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглНачальныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглНачальныйОстаток - СебестоимостьТоваровОстатки.ПостояннаяРазницаНачальныйОстаток - СебестоимостьТоваровОстатки.ВременнаяРазницаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалоговыйУчетНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.СтоимостьРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ДопРасходыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглКонечныйОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглКонечныйОстаток - СебестоимостьТоваровОстатки.ПостояннаяРазницаКонечныйОстаток - СебестоимостьТоваровОстатки.ВременнаяРазницаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалоговыйУчетКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ПостояннаяРазницаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостояннаяРазницаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ПостояннаяРазницаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПостояннаяРазницаКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ВременнаяРазницаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазницаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваровОстатки.ВременнаяРазницаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазницаКонечныйОстаток,
	|	0 КАК КоличествоПриход,
	|	0 КАК КоличествоРасход,
	|	0 КАК ВесПриход,
	|	0 КАК ВесРасход,
	|	0 КАК ОбъемПриход,
	|	0 КАК ОбъемРасход,
	|	0 КАК СтоимостьПоступленияПриход,
	|	0 КАК СтоимостьПоступленияРасход,
	|	0 КАК ДопРасходыПриход,
	|	0 КАК ДопРасходыРасход,
	|	0 КАК ТрудозатратыПриход,
	|	0 КАК ТрудозатратыРасход,
	|	0 КАК ПостатейныеПостоянныеПриход,
	|	0 КАК ПостатейныеПостоянныеРасход,
	|	0 КАК ПостатейныеПеременныеПриход,
	|	0 КАК ПостатейныеПеременныеРасход,
	|	0 КАК СебестоимостьПриход,
	|	0 КАК СебестоимостьРасход,
	|	0 КАК НалоговыйУчетПриход,
	|	0 КАК НалоговыйУчетРасход,
	|	0 КАК ПостояннаяРазницаПриход,
	|	0 КАК ПостояннаяРазницаРасход,
	|	0 КАК ВременнаяРазницаПриход,
	|	0 КАК ВременнаяРазницаРасход
	|{ВЫБРАТЬ
	|	НаборДанных,
	|	ПериодСекунда,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	Серия.*,
	|	Склад.*,
	|	Назначение.*,
	|	НаправлениеДеятельности.*,
	|	ВидЗапасов.*,
	|	ГруппаФинансовогоУчета.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	РазделУчета.*,
	|	ХозяйственнаяОперация.*,
	|	СтатьяДоходов.*,
	|	СтатьяРасходов.*,
	|	СтатьяДоходовРасходов.*,
	|	АналитикаДоходов.*,
	|	АналитикаРасходов.*,
	|	АналитикаДоходовРасходов.*,
	|	Договор.*,
	|	Заказ.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Соглашение.*,
	|	ТипЗапасов.*,
	|	ХозяйственнаяОперацияСправочник.*,
	|	ХозяйственнаяОперацияПрихода.*,
	|	ХозяйственнаяОперацияРасхода.*,
	|	Документ.*,
	|	Регистратор,
	|	КоличествоНачальныйОстаток,
	|	КоличествоКонечныйОстаток,
	|	ВесНачальныйОстаток,
	|	ВесКонечныйОстаток,
	|	ОбъемНачальныйОстаток,
	|	ОбъемКонечныйОстаток,
	|	СтоимостьПоступленияНачальныйОстаток,
	|	СтоимостьПоступленияКонечныйОстаток,
	|	ДопРасходыНачальныйОстаток,
	|	ДопРасходыКонечныйОстаток,
	|	ТрудозатратыНачальныйОстаток,
	|	ТрудозатратыКонечныйОстаток,
	|	ПостатейныеПостоянныеНачальныйОстаток,
	|	ПостатейныеПостоянныеКонечныйОстаток,
	|	ПостатейныеПеременныеНачальныйОстаток,
	|	ПостатейныеПеременныеКонечныйОстаток,
	|	СебестоимостьНачальныйОстаток,
	|	СебестоимостьКонечныйОстаток,
	|	НалоговыйУчетНачальныйОстаток,
	|	НалоговыйУчетКонечныйОстаток,
	|	ПостояннаяРазницаНачальныйОстаток,
	|	ПостояннаяРазницаКонечныйОстаток,
	|	ВременнаяРазницаНачальныйОстаток,
	|	ВременнаяРазницаКонечныйОстаток,
	|	КоличествоПриход,
	|	КоличествоРасход,
	|	ВесПриход,
	|	ВесРасход,
	|	ОбъемПриход,
	|	ОбъемРасход,
	|	СтоимостьПоступленияПриход,
	|	СтоимостьПоступленияРасход,
	|	ДопРасходыПриход,
	|	ДопРасходыРасход,
	|	ТрудозатратыПриход,
	|	ТрудозатратыРасход,
	|	ПостатейныеПостоянныеПриход,
	|	ПостатейныеПостоянныеРасход,
	|	ПостатейныеПеременныеПриход,
	|	ПостатейныеПеременныеРасход,
	|	СебестоимостьПриход,
	|	СебестоимостьРасход,
	|	НалоговыйУчетПриход,
	|	НалоговыйУчетРасход,
	|	ПостояннаяРазницаПриход,
	|	ПостояннаяРазницаРасход,
	|	ВременнаяРазницаПриход,
	|	ВременнаяРазницаРасход}
	|ПОМЕСТИТЬ ОстаткиИДвижения
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода {(&НачалоПериода)}, 
	|			&КонецПериода {(&КонецПериода)}, 
	|			Авто, , 
	|			{
	|				((АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|					(ВЫБРАТЬ
	|						ОтборПоСегментуНоменклатуры.Номенклатура,
	|						ОтборПоСегментуНоменклатуры.Характеристика
	|					ИЗ
	|						ОтборПоСегментуНоменклатуры
	|					ГДЕ
	|						ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|				(АналитикаУчетаНоменклатуры.Номенклатура).* КАК Номенклатура, 
	|				(АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения).* КАК ЕдиницаИзмерения, 
	|				(АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов).* КАК ЕдиницаДляОтчетов, 
	|				(АналитикаУчетаНоменклатуры.Характеристика).* КАК Характеристика, 
	|				(АналитикаУчетаНоменклатуры.Серия).* КАК Серия, 
	|				(АналитикаУчетаНоменклатуры.МестоХранения).* КАК Склад, 
	|				(АналитикаУчетаНоменклатуры.Назначение).* КАК Назначение, 
	|				(АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности).* КАК НаправлениеДеятельности, 
	|				(Организация).* КАК Организация, 
	|				(ВидЗапасов).* КАК ВидЗапасов
	|			}
	|	) КАК СебестоимостьТоваровОстатки
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО (АналитикаПартий.Ссылка = СебестоимостьТоваровОстатки.АналитикаУчетаПартий)}
	|{ГДЕ
	|	СебестоимостьТоваровОстатки.ПериодДень КАК ПериодДень,
	|	СебестоимостьТоваровОстатки.ПериодНеделя КАК ПериодНеделя,
	|	СебестоимостьТоваровОстатки.ПериодДекада КАК ПериодДекада,
	|	СебестоимостьТоваровОстатки.ПериодМесяц КАК ПериодМесяц,
	|	СебестоимостьТоваровОстатки.ПериодКвартал КАК ПериодКвартал,
	|	СебестоимостьТоваровОстатки.ПериодПолугодие КАК ПериодПолугодие,
	|	СебестоимостьТоваровОстатки.ПериодГод КАК ПериодГод,
	|	(ВЫБОР
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|				ТОГДА СебестоимостьТоваровОстатки.ВидЗапасов.ГруппаФинансовогоУчета
	|			ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|		КОНЕЦ).* КАК ГруппаФинансовогоУчета}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	СебестоимостьТоваров.Период,
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, НЕДЕЛЯ),
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕКАДА),
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, КВАРТАЛ),
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ПОЛУГОДИЕ),
	|	НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ГОД),
	|	СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|	АналитикаНоменклатуры.Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов,
	|	АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов,
	|	АналитикаНоменклатуры.Характеристика,
	|	АналитикаНоменклатуры.Серия,
	|	АналитикаНоменклатуры.МестоХранения,
	|	АналитикаНоменклатуры.Назначение,
	|	АналитикаНоменклатуры.Назначение.НаправлениеДеятельности,
	|	СебестоимостьТоваров.ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА СебестоимостьТоваров.ВидЗапасов.ГруппаФинансовогоУчета
	|		ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ,
	|	СебестоимостьТоваров.Организация,
	|	СебестоимостьТоваров.Партия,
	|	СебестоимостьТоваров.АналитикаУчетаПартий,
	|	СебестоимостьТоваров.РазделУчета,
	|	СебестоимостьТоваров.ХозяйственнаяОперация,
	|	СебестоимостьТоваров.СтатьяДоходов,
	|	СебестоимостьТоваров.СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА НЕ СебестоимостьТоваров.СтатьяДоходов.Ссылка ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.СтатьяДоходов
	|		КОГДА НЕ СебестоимостьТоваров.СтатьяРасходовСписания.Ссылка ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.СтатьяРасходовСписания
	|	КОНЕЦ,
	|	СебестоимостьТоваров.АналитикаДоходов,
	|	СебестоимостьТоваров.АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.АналитикаДоходов) ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.АналитикаДоходов
	|		КОГДА НЕ ТИПЗНАЧЕНИЯ(СебестоимостьТоваров.АналитикаРасходов) ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.АналитикаРасходов
	|	КОНЕЦ,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	(ВЫБОР
	|		КОГДА НЕ Реестр.Партнер ЕСТЬ NULL ТОГДА Реестр.Партнер
	|		ИНАЧЕ АналитикаПартнеров.Партнер КОНЕЦ) КАК Партнер,
	|	(ВЫБОР
	|		КОГДА НЕ Реестр.Контрагент ЕСТЬ NULL ТОГДА Реестр.Контрагент
	|		ИНАЧЕ АналитикаПартнеров.Контрагент КОНЕЦ) КАК Контрагент,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	НастройкиХозопераций.Ссылка,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров
	|				ИЛИ СебестоимостьТоваров.РасчетСебестоимости)
	|				И НЕ СебестоимостьТоваров.ХозяйственнаяОперация.Ссылка ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.ДокументДвижения
	|		ИНАЧЕ СебестоимостьТоваров.Регистратор
	|	КОНЕЦ,
	|	СебестоимостьТоваров.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|			ТОГДА 1
	|		ИНАЧЕ 1 / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ * СебестоимостьТоваров.Количество,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ЕдиницыКоличества = 0
	|			ТОГДА 1
	|		ИНАЧЕ 1 / АналитикаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ * СебестоимостьТоваров.Количество,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * СебестоимостьТоваров.Количество * &ТекстЗапросаВесУпаковки,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * СебестоимостьТоваров.Количество * &ТекстЗапросаВесУпаковки,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * СебестоимостьТоваров.Количество * &ТекстЗапросаОбъемУпаковки,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * СебестоимостьТоваров.Количество * &ТекстЗапросаОбъемУпаковки,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|				ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.СтоимостьЗабалансовая
	|				ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.СтоимостьЗабалансовая
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.ДопРасходы
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ДопРасходыУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ДопРасходыРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.ДопРасходыУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.ДопРасходы
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ДопРасходыУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ДопРасходыРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.ДопРасходыБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.ДопРасходыУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.Трудозатраты
	|				ИНАЧЕ СебестоимостьТоваров.ТрудозатратыУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.Трудозатраты
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ТрудозатратыУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ТрудозатратыРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.Трудозатраты
	|				ИНАЧЕ СебестоимостьТоваров.ТрудозатратыУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.ПостатейныеПостоянныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеСНДС + СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА СебестоимостьТоваров.Стоимость + СебестоимостьТоваров.ДопРасходы + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеСНДС + СебестоимостьТоваров.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА СебестоимостьТоваров.СтоимостьБезНДС + СебестоимостьТоваров.ДопРасходыБезНДС + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.Трудозатраты + СебестоимостьТоваров.ПостатейныеПостоянныеБезНДС + СебестоимостьТоваров.ПостатейныеПеременныеБезНДС
	|				ИНАЧЕ СебестоимостьТоваров.СтоимостьУпр + СебестоимостьТоваров.ДопРасходыУпр + СебестоимостьТоваров.СтоимостьЗабалансовая + СебестоимостьТоваров.ТрудозатратыУпр + СебестоимостьТоваров.ПостатейныеПостоянныеУпр + СебестоимостьТоваров.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл - СебестоимостьТоваров.ПостояннаяРазница - СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл - СебестоимостьТоваров.ПостояннаяРазница - СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|				ИЛИ &ДанныеОтчета = 2
	|				ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА СебестоимостьТоваров.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО (АналитикаПартий.Ссылка = СебестоимостьТоваров.АналитикаУчетаПартий)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ПО СебестоимостьТоваров.ИдентификаторФинЗаписи = ВыручкаИСебестоимостьПродаж.ИдентификаторФинЗаписи}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПартнеров
	|		ПО СебестоимостьТоваров.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Реестр.Ссылка = СебестоимостьТоваров.Регистратор
	|			И НЕ Реестр.ДополнительнаяЗапись
	|			И СебестоимостьТоваров.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнешнееПоступление)
	|		}
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозопераций
	|		ПО (НастройкиХозопераций.ХозяйственнаяОперация = СебестоимостьТоваров.ХозяйственнаяОперация)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИсключатьХозОперации = ИСТИНА
	|				ТОГДА НЕ СебестоимостьТоваров.ХозяйственнаяОперация В (&ИсключаемыеХозОперации)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|{ГДЕ
	|	(СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода),
	|	((АналитикаНоменклатуры.Номенклатура, АналитикаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	АналитикаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	АналитикаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	АналитикаНоменклатуры.Характеристика.* КАК Характеристика,
	|	АналитикаНоменклатуры.Серия.* КАК Серия,
	|	АналитикаНоменклатуры.МестоХранения.* КАК Склад,
	|	АналитикаНоменклатуры.Назначение.* КАК Назначение,
	|	АналитикаНоменклатуры.Назначение.НаправлениеДеятельности.* КАК НаправлениеДеятельности,
	|	СебестоимостьТоваров.Организация.* КАК Организация,
	|	СебестоимостьТоваров.ВидЗапасов.* КАК ВидЗапасов,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕНЬ)) КАК ПериодДень,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ДЕКАДА)) КАК ПериодДекада,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, МЕСЯЦ)) КАК ПериодМесяц,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, КВАРТАЛ)) КАК ПериодКвартал,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	|	(НАЧАЛОПЕРИОДА(СебестоимостьТоваров.Период, ГОД)) КАК ПериодГод,
	|	(ВЫБОР
	|			КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|				ТОГДА СебестоимостьТоваров.ВидЗапасов.ГруппаФинансовогоУчета
	|			ИНАЧЕ АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|		КОНЕЦ).* КАК ГруппаФинансовогоУчета}
	|;";
	#КонецОбласти
		
	#Область ДетализацияИсходныхЗатрат
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодИсходныхЗатрат,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.Номенклатура КАК Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика КАК Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов КАК ВидЗапасов,
	|	ДетализацияСебестоимости.Организация КАК Организация,
	|	ДетализацияСебестоимости.Партия КАК Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходовИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура КАК НоменклатураИсходная,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика КАК ХарактеристикаИсходная,
	|	ДетализацияСебестоимости.ДокументПоступления КАК ДокументПоступленияИсходный,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 1
	|			ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|		КОГДА &ДанныеОтчета = 2
	|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|		КОГДА &ДанныеОтчета = 3
	|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|		КОГДА &ДанныеОтчета = 4
	|			ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|	КОНЕЦ КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	0 КАК ИсходныеДопРасходыНаЕдиницу,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	0 КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	0 КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	0 КАК КоличествоПартии
	|ПОМЕСТИТЬ ДетализацияИсходныхЗатрат
	|{ВЫБРАТЬ
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	ВидЗапасов.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	СтатьяРасходовИсходная.*,
	|	АналитикаУчетаПартийДокументаПоступления.*,
	|	НоменклатураИсходная.*,
	|	ХарактеристикаИсходная.*,
	|	ДокументПоступленияИсходный.*}
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваров КАК ДетализацияСебестоимости
	|ГДЕ
	|	(ДетализацияСебестоимости.Номенклатура, ДетализацияСебестоимости.Характеристика, ДетализацияСебестоимости.ВидЗапасов, ДетализацияСебестоимости.Организация, ДетализацияСебестоимости.Партия, ДетализацияСебестоимости.АналитикаУчетаПартий) В
	|			(ВЫБРАТЬ
	|				ОстаткиИДвижения.Номенклатура,
	|				ОстаткиИДвижения.Характеристика,
	|				ОстаткиИДвижения.ВидЗапасов,
	|				ОстаткиИДвижения.Организация,
	|				ОстаткиИДвижения.Партия,
	|				ОстаткиИДвижения.АналитикаУчетаПартий
	|			ИЗ
	|				ОстаткиИДвижения)
	|{ГДЕ
	|	ДетализацияСебестоимости.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО,
	|	ДетализацияСебестоимости.Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Номенклатура.КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов,
	|	ДетализацияСебестоимости.Организация,
	|	ДетализацияСебестоимости.Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходов,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности КАК ВидЦенности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ДетализацияСебестоимости.ДокументПоступления,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиПартииТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|{ГДЕ
	|	(ДетализацияСебестоимости.ПериодРегистрации <= КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)) КАК Поле2,
	|	((ДетализацияСебестоимости.Номенклатура, ДетализацияСебестоимости.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов,
	|	ДетализацияСебестоимости.Организация,
	|	ДетализацияСебестоимости.Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий,
	|	ДетализацияСебестоимости.СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика,
	|	ДетализацияСебестоимости.ДокументПоступления,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ДетализацияСебестоимости.КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|ГДЕ
	|	ДетализацияСебестоимости.Период МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1), МЕСЯЦ)
	|{ГДЕ
	|	((ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов,
	|	ДетализацияСебестоимости.Организация,
	|	ДетализацияСебестоимости.Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий,
	|	ДетализацияСебестоимости.СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика,
	|	ДетализацияСебестоимости.ДокументПоступления,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ДетализацияСебестоимости.КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|ГДЕ
	|	ДетализацияСебестоимости.Период МЕЖДУ НАЧАЛОПЕРИОДА(&КонецПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|{ГДЕ
	|	((ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДетализацияСебестоимости.Период, МЕСЯЦ),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика,
	|	ДетализацияСебестоимости.ВидЗапасов,
	|	ДетализацияСебестоимости.Организация,
	|	ДетализацияСебестоимости.Партия,
	|	ДетализацияСебестоимости.АналитикаУчетаПартий,
	|	ДетализацияСебестоимости.СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ДетализацияСебестоимости.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|			ТОГДА ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления.ВидЦенности
	|		ИНАЧЕ ДетализацияСебестоимости.СтатьяРасходов
	|	КОНЕЦ КАК ВидЦенности,
	|	ДетализацияСебестоимости.АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатурыДокументаПоступления.Характеристика,
	|	ДетализацияСебестоимости.ДокументПоступления,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(&ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|						ИЛИ НЕ &ДанныеОтчета = 4
	|							И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|				И 
	|					ЛОЖЬ
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовРегл, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|				ИЛИ НЕ &ДанныеОтчета = 4
	|					И ЕСТЬNULL(ДетализацияСебестоимости.СтатьяРасходов.ВариантРаспределенияРасходовУпр, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеОтчета = 1
	|						ТОГДА ДетализацияСебестоимости.СтоимостьСНДС
	|					КОГДА &ДанныеОтчета = 2
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДС
	|					КОГДА &ДанныеОтчета = 3
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСУпр
	|					КОГДА &ДанныеОтчета = 4
	|						ТОГДА ДетализацияСебестоимости.СтоимостьБезНДСРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДетализацияСебестоимости.КоличествоПартии
	|ИЗ
	|	РегистрСведений.ДетализацияСебестоимостиТоваровПостатейныеЗатраты КАК ДетализацияСебестоимости
	|ГДЕ
	|	ДетализацияСебестоимости.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|{ГДЕ
	|	((ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура, ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика) В
	|			(ВЫБРАТЬ
	|				ОтборПоСегментуНоменклатуры.Номенклатура,
	|				ОтборПоСегментуНоменклатуры.Характеристика
	|			ИЗ
	|				ОтборПоСегментуНоменклатуры
	|			ГДЕ
	|				ОтборПоСегментуНоменклатуры.ИспользуетсяОтборПоСегментуНоменклатуры = &ИспользуетсяОтборПоСегментуНоменклатуры)),
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.* КАК Номенклатура,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаДляОтчетов.* КАК ЕдиницаДляОтчетов,
	|	ДетализацияСебестоимости.АналитикаУчетаНоменклатуры.Характеристика.* КАК Характеристика,
	|	ДетализацияСебестоимости.Организация.* КАК Организация,
	|	ДетализацияСебестоимости.ВидЗапасов.* КАК ВидЗапасов}
	|
	|;";
	#КонецОбласти
	
	#Область ДетализацияСгруппированная
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ДетализацияИсходныхЗатрат.ПериодИсходныхЗатрат КАК ПериодИсходныхЗатрат,
	|	ДетализацияИсходныхЗатрат.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДетализацияИсходныхЗатрат.Номенклатура КАК Номенклатура,
	|	ДетализацияИсходныхЗатрат.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ДетализацияИсходныхЗатрат.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ДетализацияИсходныхЗатрат.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ДетализацияИсходныхЗатрат.Характеристика КАК Характеристика,
	|	ДетализацияИсходныхЗатрат.ВидЗапасов КАК ВидЗапасов,
	|	ДетализацияИсходныхЗатрат.Организация КАК Организация,
	|	ДетализацияИсходныхЗатрат.Партия КАК Партия,
	|	ДетализацияИсходныхЗатрат.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДетализацияИсходныхЗатрат.СтатьяРасходовИсходная КАК СтатьяРасходовИсходная,
	|	ДетализацияИсходныхЗатрат.ВидЦенности КАК ВидЦенности,
	|	ДетализацияИсходныхЗатрат.АналитикаУчетаПартийДокументаПоступления КАК АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияИсходныхЗатрат.НоменклатураИсходная КАК НоменклатураИсходная,
	|	ДетализацияИсходныхЗатрат.ХарактеристикаИсходная КАК ХарактеристикаИсходная,
	|	ДетализацияИсходныхЗатрат.ДокументПоступленияИсходный КАК ДокументПоступленияИсходный,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеМатериальныеЗатратыНаЕдиницу) КАК ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПостоянныеНаЕдиницу) КАК ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПеременныеНаЕдиницу) КАК ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеДопРасходыНаЕдиницу) КАК ИсходныеДопРасходыНаЕдиницу,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало) КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало) КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало) КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеДопРасходыНаЕдиницуНаНачало) КАК ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец) КАК ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец) КАК ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец) КАК ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеДопРасходыНаЕдиницуНаКонец) КАК ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод) КАК ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод) КАК ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод) КАК ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	СУММА(ДетализацияИсходныхЗатрат.ИсходныеДопРасходыНаЕдиницуЗаПериод) КАК ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	СУММА(ДетализацияИсходныхЗатрат.КоличествоПартии) КАК КоличествоПартии
	|ПОМЕСТИТЬ ДетализацияСгруппированная
	|{ВЫБРАТЬ
	|	ПериодИсходныхЗатрат,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	ВидЗапасов.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	СтатьяРасходовИсходная.*,
	|	ВидЦенности.*,
	|	АналитикаУчетаПартийДокументаПоступления.*,
	|	НоменклатураИсходная.*,
	|	ХарактеристикаИсходная.*,
	|	ДокументПоступленияИсходный.*,
	|	ИсходныеМатериальныеЗатратыНаЕдиницу,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницу,
	|	ИсходныеПостатейныеПеременныеНаЕдиницу,
	|	ИсходныеДопРасходыНаЕдиницу,
	|	ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало,
	|	ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало,
	|	ИсходныеДопРасходыНаЕдиницуНаНачало,
	|	ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец,
	|	ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец,
	|	ИсходныеДопРасходыНаЕдиницуНаКонец,
	|	ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод,
	|	ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод,
	|	ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод,
	|	ИсходныеДопРасходыНаЕдиницуЗаПериод,
	|	КоличествоПартии}
	|ИЗ
	|	ДетализацияИсходныхЗатрат КАК ДетализацияИсходныхЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетализацияИсходныхЗатрат.ЕдиницаХранения,
	|	ДетализацияИсходныхЗатрат.ЕдиницаДляОтчетов,
	|	ДетализацияИсходныхЗатрат.ХарактеристикаИсходная,
	|	ДетализацияИсходныхЗатрат.СтатьяРасходовИсходная,
	|	ДетализацияИсходныхЗатрат.ВидЦенности,
	|	ДетализацияИсходныхЗатрат.АналитикаУчетаНоменклатуры,
	|	ДетализацияИсходныхЗатрат.ПериодИсходныхЗатрат,
	|	ДетализацияИсходныхЗатрат.Партия,
	|	ДетализацияИсходныхЗатрат.Характеристика,
	|	ДетализацияИсходныхЗатрат.ВидЗапасов,
	|	ДетализацияИсходныхЗатрат.Организация,
	|	ДетализацияИсходныхЗатрат.ДокументПоступленияИсходный,
	|	ДетализацияИсходныхЗатрат.Номенклатура,
	|	ДетализацияИсходныхЗатрат.АналитикаУчетаПартийДокументаПоступления,
	|	ДетализацияИсходныхЗатрат.АналитикаУчетаПартий,
	|	ДетализацияИсходныхЗатрат.НоменклатураИсходная,
	|	ДетализацияИсходныхЗатрат.КоэффициентЕдиницыДляОтчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ВидЗапасов,
	|	Организация,
	|	Партия,
	|	АналитикаУчетаПартий,
	|	ПериодИсходныхЗатрат,
	|	АналитикаУчетаНоменклатуры
	|;";
	#КонецОбласти
	
	#Область НаборДанных
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ОстаткиИДвижения.НаборДанных КАК НаборДанных,
	|	ОстаткиИДвижения.ПериодСекунда КАК ПериодСекунда,
	|	ОстаткиИДвижения.ПериодДень КАК ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя КАК ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада КАК ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал КАК ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие КАК ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод КАК ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиИДвижения.Номенклатура КАК Номенклатура,
	|	ОстаткиИДвижения.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика КАК Характеристика,
	|	ОстаткиИДвижения.Серия КАК Серия,
	|	ОстаткиИДвижения.Склад КАК Склад,
	|	ОстаткиИДвижения.Назначение КАК Назначение,
	|	ОстаткиИДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОстаткиИДвижения.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ОстаткиИДвижения.Организация КАК Организация,
	|	ОстаткиИДвижения.Партия КАК Партия,
	|	ОстаткиИДвижения.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ОстаткиИДвижения.РазделУчета КАК РазделУчета,
	|	ОстаткиИДвижения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ОстаткиИДвижения.СтатьяДоходов КАК СтатьяДоходов,
	|	ОстаткиИДвижения.СтатьяРасходов КАК СтатьяРасходов,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ОстаткиИДвижения.АналитикаДоходов КАК АналитикаДоходов,
	|	ОстаткиИДвижения.АналитикаРасходов КАК АналитикаРасходов,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов КАК АналитикаДоходовРасходов,
	|	ОстаткиИДвижения.Договор КАК Договор,
	|	ОстаткиИДвижения.Заказ КАК Заказ,
	|	ОстаткиИДвижения.Партнер КАК Партнер,
	|	ОстаткиИДвижения.Контрагент КАК Контрагент,
	|	ОстаткиИДвижения.Соглашение КАК Соглашение,
	|	ОстаткиИДвижения.ТипЗапасов КАК ТипЗапасов,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник КАК ХозяйственнаяОперацияСправочник,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода КАК ХозяйственнаяОперацияПрихода,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода КАК ХозяйственнаяОперацияРасхода,
	|	(ВЫБОР
	|		КОГДА ОстаткиИДвижения.Документ = НЕОПРЕДЕЛЕНО ТОГДА NULL
	|		ИНАЧЕ ОстаткиИДвижения.Документ КОНЕЦ) КАК Документ,
	|	ОстаткиИДвижения.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ОстаткиИДвижения.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ОстаткиИДвижения.ВесНачальныйОстаток КАК ВесНачальныйОстаток,
	|	ОстаткиИДвижения.ВесКонечныйОстаток КАК ВесКонечныйОстаток,
	|	ОстаткиИДвижения.ОбъемНачальныйОстаток КАК ОбъемНачальныйОстаток,
	|	ОстаткиИДвижения.ОбъемКонечныйОстаток КАК ОбъемКонечныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияНачальныйОстаток КАК СтоимостьПоступленияНачальныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияКонечныйОстаток КАК СтоимостьПоступленияКонечныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыНачальныйОстаток КАК ДопРасходыНачальныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыКонечныйОстаток КАК ДопРасходыКонечныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыНачальныйОстаток КАК ТрудозатратыНачальныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыКонечныйОстаток КАК ТрудозатратыКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеНачальныйОстаток КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеКонечныйОстаток КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеНачальныйОстаток КАК ПостатейныеПеременныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеКонечныйОстаток КАК ПостатейныеПеременныеКонечныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьНачальныйОстаток КАК СебестоимостьНачальныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьКонечныйОстаток КАК СебестоимостьКонечныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетНачальныйОстаток КАК НалоговыйУчетНачальныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетКонечныйОстаток КАК НалоговыйУчетКонечныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаНачальныйОстаток КАК ПостояннаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаКонечныйОстаток КАК ПостояннаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаНачальныйОстаток КАК ВременнаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаКонечныйОстаток КАК ВременнаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.КоличествоПриход КАК КоличествоПриход,
	|	ОстаткиИДвижения.КоличествоРасход КАК КоличествоРасход,
	|	ОстаткиИДвижения.ВесПриход КАК ВесПриход,
	|	ОстаткиИДвижения.ВесРасход КАК ВесРасход,
	|	ОстаткиИДвижения.ОбъемПриход КАК ОбъемПриход,
	|	ОстаткиИДвижения.ОбъемРасход КАК ОбъемРасход,
	|	ОстаткиИДвижения.СтоимостьПоступленияПриход КАК СтоимостьПоступленияПриход,
	|	ОстаткиИДвижения.СтоимостьПоступленияРасход КАК СтоимостьПоступленияРасход,
	|	ОстаткиИДвижения.ДопРасходыПриход КАК ДопРасходыПриход,
	|	ОстаткиИДвижения.ДопРасходыРасход КАК ДопРасходыРасход,
	|	ОстаткиИДвижения.ТрудозатратыПриход КАК ТрудозатратыПриход,
	|	ОстаткиИДвижения.ТрудозатратыРасход КАК ТрудозатратыРасход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеПриход КАК ПостатейныеПостоянныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеРасход КАК ПостатейныеПостоянныеРасход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеПриход КАК ПостатейныеПеременныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеРасход КАК ПостатейныеПеременныеРасход,
	|	ОстаткиИДвижения.СебестоимостьПриход КАК СебестоимостьПриход,
	|	ОстаткиИДвижения.СебестоимостьРасход КАК СебестоимостьРасход,
	|	ОстаткиИДвижения.НалоговыйУчетПриход КАК НалоговыйУчетПриход,
	|	ОстаткиИДвижения.НалоговыйУчетРасход КАК НалоговыйУчетРасход,
	|	ОстаткиИДвижения.ПостояннаяРазницаПриход КАК ПостояннаяРазницаПриход,
	|	ОстаткиИДвижения.ПостояннаяРазницаРасход КАК ПостояннаяРазницаРасход,
	|	ОстаткиИДвижения.ВременнаяРазницаПриход КАК ВременнаяРазницаПриход,
	|	ОстаткиИДвижения.ВременнаяРазницаРасход КАК ВременнаяРазницаРасход,
	|
	|	NULL КАК СтатьяРасходовИсходная,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка) КАК ВидЦенности,
	|	NULL КАК НоменклатураИсходная,
	|	NULL КАК ХарактеристикаИсходная,
	|	NULL КАК ДокументПоступленияИсходный,
	|
	|	0 КАК ДетализацияСтоимостьПоступленияНачальныйОстаток,
	|	0 КАК ДетализацияСтоимостьПоступленияКонечныйОстаток,
	|	0 КАК ДетализацияДопРасходыНачальныйОстаток,
	|	0 КАК ДетализацияДопРасходыКонечныйОстаток,
	|	0 КАК ДетализацияПостатейныеПостоянныеНачальныйОстаток,
	|	0 КАК ДетализацияПостатейныеПостоянныеКонечныйОстаток,
	|	0 КАК ДетализацияПостатейныеПеременныеНачальныйОстаток,
	|	0 КАК ДетализацияПостатейныеПеременныеКонечныйОстаток,
	|	0 КАК ДетализацияСебестоимостьНачальныйОстаток,
	|	0 КАК ДетализацияСебестоимостьКонечныйОстаток,
	|	0 КАК ДетализацияСтоимостьПоступленияПриход,
	|	0 КАК ДетализацияСтоимостьПоступленияРасход,
	|	0 КАК ДетализацияДопРасходыПриход,
	|	0 КАК ДетализацияДопРасходыРасход,
	|	0 КАК ДетализацияПостатейныеПостоянныеПриход,
	|	0 КАК ДетализацияПостатейныеПостоянныеРасход,
	|	0 КАК ДетализацияПостатейныеПеременныеПриход,
	|	0 КАК ДетализацияПостатейныеПеременныеРасход,
	|	0 КАК ДетализацияСебестоимостьПриход,
	|	0 КАК ДетализацияСебестоимостьРасход
	|{ВЫБРАТЬ
	|	НаборДанных,
	|	ПериодСекунда,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	АналитикаУчетаНоменклатуры.*,
	|	Номенклатура.*,
	|	ЕдиницаХранения.*,
	|	ЕдиницаДляОтчетов.*,
	|	КоэффициентЕдиницыДляОтчетов,
	|	Характеристика.*,
	|	Серия.*,
	|	Склад.*,
	|	Назначение.*,
	|	НаправлениеДеятельности.*,
	|	ВидЗапасов.*,
	|	ГруппаФинансовогоУчета.*,
	|	Организация.*,
	|	Партия.*,
	|	АналитикаУчетаПартий.*,
	|	РазделУчета.*,
	|	ХозяйственнаяОперация.*,
	|	ВидЦенности.*,
	|	СтатьяДоходов.*,
	|	СтатьяРасходов.*,
	|	СтатьяДоходовРасходов.*,
	|	АналитикаДоходов.*,
	|	АналитикаРасходов.*,
	|	АналитикаДоходовРасходов.*,
	|	Договор.*,
	|	Заказ.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Соглашение.*,
	|	ТипЗапасов.*,
	|	ХозяйственнаяОперацияСправочник.*,
	|	ХозяйственнаяОперацияПрихода.*,
	|	ХозяйственнаяОперацияРасхода.*,
	|	Документ.*,
	|	КоличествоНачальныйОстаток,
	|	КоличествоКонечныйОстаток,
	|	ВесНачальныйОстаток,
	|	ВесКонечныйОстаток,
	|	ОбъемНачальныйОстаток,
	|	ОбъемКонечныйОстаток,
	|	СтоимостьПоступленияНачальныйОстаток,
	|	СтоимостьПоступленияКонечныйОстаток,
	|	ДопРасходыНачальныйОстаток,
	|	ДопРасходыКонечныйОстаток,
	|	ТрудозатратыНачальныйОстаток,
	|	ТрудозатратыКонечныйОстаток,
	|	ПостатейныеПостоянныеНачальныйОстаток,
	|	ПостатейныеПостоянныеКонечныйОстаток,
	|	ПостатейныеПеременныеНачальныйОстаток,
	|	ПостатейныеПеременныеКонечныйОстаток,
	|	СебестоимостьНачальныйОстаток,
	|	СебестоимостьКонечныйОстаток,
	|	НалоговыйУчетНачальныйОстаток,
	|	НалоговыйУчетКонечныйОстаток,
	|	ПостояннаяРазницаНачальныйОстаток,
	|	ПостояннаяРазницаКонечныйОстаток,
	|	ВременнаяРазницаНачальныйОстаток,
	|	ВременнаяРазницаКонечныйОстаток,
	|	КоличествоПриход,
	|	КоличествоРасход,
	|	ВесПриход,
	|	ВесРасход,
	|	ОбъемПриход,
	|	ОбъемРасход,
	|	СтоимостьПоступленияПриход,
	|	СтоимостьПоступленияРасход,
	|	ДопРасходыПриход,
	|	ДопРасходыРасход,
	|	ТрудозатратыПриход,
	|	ТрудозатратыРасход,
	|	ПостатейныеПостоянныеПриход,
	|	ПостатейныеПостоянныеРасход,
	|	ПостатейныеПеременныеПриход,
	|	ПостатейныеПеременныеРасход,
	|	СебестоимостьПриход,
	|	СебестоимостьРасход,
	|	НалоговыйУчетПриход,
	|	НалоговыйУчетРасход,
	|	ПостояннаяРазницаПриход,
	|	ПостояннаяРазницаРасход,
	|	ВременнаяРазницаПриход,
	|	ВременнаяРазницаРасход,
	|	СтатьяРасходовИсходная.*,
	|	НоменклатураИсходная.*,
	|	ХарактеристикаИсходная.*,
	|	ДокументПоступленияИсходный.*,
	|	ДетализацияСтоимостьПоступленияНачальныйОстаток,
	|	ДетализацияСтоимостьПоступленияКонечныйОстаток,
	|	ДетализацияДопРасходыНачальныйОстаток,
	|	ДетализацияДопРасходыКонечныйОстаток,
	|	ДетализацияПостатейныеПостоянныеНачальныйОстаток,
	|	ДетализацияПостатейныеПостоянныеКонечныйОстаток,
	|	ДетализацияПостатейныеПеременныеНачальныйОстаток,
	|	ДетализацияПостатейныеПеременныеКонечныйОстаток,
	|	ДетализацияСебестоимостьНачальныйОстаток,
	|	ДетализацияСебестоимостьКонечныйОстаток,
	|	ДетализацияСтоимостьПоступленияПриход,
	|	ДетализацияСтоимостьПоступленияРасход,
	|	ДетализацияДопРасходыПриход,
	|	ДетализацияДопРасходыРасход,
	|	ДетализацияПостатейныеПостоянныеПриход,
	|	ДетализацияПостатейныеПостоянныеРасход,
	|	ДетализацияПостатейныеПеременныеПриход,
	|	ДетализацияПостатейныеПеременныеРасход,
	|	ДетализацияСебестоимостьПриход,
	|	ДетализацияСебестоимостьРасход
	|	}
	|ИЗ
	|	ОстаткиИДвижения КАК ОстаткиИДвижения
	|{ГДЕ
	|	ОстаткиИДвижения.ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры.*,
	|	ОстаткиИДвижения.Номенклатура.*,
	|	ОстаткиИДвижения.ЕдиницаХранения.*,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов.*,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика.*,
	|	ОстаткиИДвижения.Серия.*,
	|	ОстаткиИДвижения.Склад.*,
	|	ОстаткиИДвижения.Назначение.*,
	|	ОстаткиИДвижения.НаправлениеДеятельности.*,
	|	ОстаткиИДвижения.ВидЗапасов.*,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета.*,
	|	ОстаткиИДвижения.Организация.*,
	|	ОстаткиИДвижения.Партия.*,
	|	ОстаткиИДвижения.АналитикаУчетаПартий.*,
	|	ОстаткиИДвижения.РазделУчета.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперация.*,
	|	ОстаткиИДвижения.СтатьяДоходов.*,
	|	ОстаткиИДвижения.СтатьяРасходов.*,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов.*,
	|	ОстаткиИДвижения.АналитикаДоходов.*,
	|	ОстаткиИДвижения.АналитикаРасходов.*,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов.*,
	|	ОстаткиИДвижения.Договор.*,
	|	ОстаткиИДвижения.Заказ.*,
	|	ОстаткиИДвижения.Партнер.*,
	|	ОстаткиИДвижения.Контрагент.*,
	|	ОстаткиИДвижения.Соглашение.*,
	|	ОстаткиИДвижения.ТипЗапасов.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода.*,
	|	ОстаткиИДвижения.Документ.*,
	|	ОстаткиИДвижения.КоличествоНачальныйОстаток,
	|	ОстаткиИДвижения.КоличествоКонечныйОстаток,
	|	ОстаткиИДвижения.ВесНачальныйОстаток,
	|	ОстаткиИДвижения.ВесКонечныйОстаток,
	|	ОстаткиИДвижения.ОбъемНачальныйОстаток,
	|	ОстаткиИДвижения.ОбъемКонечныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияНачальныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияКонечныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыНачальныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыКонечныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыНачальныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеКонечныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьНачальныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьКонечныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетНачальныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетКонечныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.КоличествоПриход,
	|	ОстаткиИДвижения.КоличествоРасход,
	|	ОстаткиИДвижения.ВесПриход,
	|	ОстаткиИДвижения.ВесРасход,
	|	ОстаткиИДвижения.ОбъемПриход,
	|	ОстаткиИДвижения.ОбъемРасход,
	|	ОстаткиИДвижения.СтоимостьПоступленияПриход,
	|	ОстаткиИДвижения.СтоимостьПоступленияРасход,
	|	ОстаткиИДвижения.ДопРасходыПриход,
	|	ОстаткиИДвижения.ДопРасходыРасход,
	|	ОстаткиИДвижения.ТрудозатратыПриход,
	|	ОстаткиИДвижения.ТрудозатратыРасход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеРасход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеРасход,
	|	ОстаткиИДвижения.СебестоимостьПриход,
	|	ОстаткиИДвижения.СебестоимостьРасход,
	|	ОстаткиИДвижения.НалоговыйУчетПриход,
	|	ОстаткиИДвижения.НалоговыйУчетРасход,
	|	ОстаткиИДвижения.ПостояннаяРазницаПриход,
	|	ОстаткиИДвижения.ПостояннаяРазницаРасход,
	|	ОстаткиИДвижения.ВременнаяРазницаПриход,
	|	ОстаткиИДвижения.ВременнаяРазницаРасход
	|	}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиИДвижения.НаборДанных + 2 КАК НаборДанных,
	|	ОстаткиИДвижения.ПериодСекунда КАК ПериодСекунда,
	|	ОстаткиИДвижения.ПериодДень КАК ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя КАК ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада КАК ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц КАК ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал КАК ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие КАК ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод КАК ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиИДвижения.Номенклатура КАК Номенклатура,
	|	ОстаткиИДвижения.ЕдиницаХранения КАК ЕдиницаХранения,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетов,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов КАК КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика КАК Характеристика,
	|	ОстаткиИДвижения.Серия КАК Серия,
	|	ОстаткиИДвижения.Склад КАК Склад,
	|	ОстаткиИДвижения.Назначение КАК Назначение,
	|	ОстаткиИДвижения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОстаткиИДвижения.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ОстаткиИДвижения.Организация КАК Организация,
	|	ОстаткиИДвижения.Партия КАК Партия,
	|	ОстаткиИДвижения.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ОстаткиИДвижения.РазделУчета КАК РазделУчета,
	|	ОстаткиИДвижения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ОстаткиИДвижения.СтатьяДоходов КАК СтатьяДоходов,
	|	ОстаткиИДвижения.СтатьяРасходов КАК СтатьяРасходов,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ОстаткиИДвижения.АналитикаДоходов КАК АналитикаДоходов,
	|	ОстаткиИДвижения.АналитикаРасходов КАК АналитикаРасходов,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов КАК АналитикаДоходовРасходов,
	|	ОстаткиИДвижения.Договор КАК Договор,
	|	ОстаткиИДвижения.Заказ КАК Заказ,
	|	ОстаткиИДвижения.Партнер КАК Партнер,
	|	ОстаткиИДвижения.Контрагент КАК Контрагент,
	|	ОстаткиИДвижения.Соглашение КАК Соглашение,
	|	ОстаткиИДвижения.ТипЗапасов КАК ТипЗапасов,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник КАК ХозяйственнаяОперацияСправочник,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода КАК ХозяйственнаяОперацияПрихода,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода КАК ХозяйственнаяОперацияРасхода,
	|	(ВЫБОР
	|		КОГДА ОстаткиИДвижения.Документ = НЕОПРЕДЕЛЕНО ТОГДА NULL
	|		ИНАЧЕ ОстаткиИДвижения.Документ КОНЕЦ) КАК Документ,
	|	0 КАК КоличествоНачальныйОстаток,
	|	0 КАК КоличествоКонечныйОстаток,
	|	0 КАК ВесНачальныйОстаток,
	|	0 КАК ВесКонечныйОстаток,
	|	0 КАК ОбъемНачальныйОстаток,
	|	0 КАК ОбъемКонечныйОстаток,
	|	0 КАК СтоимостьПоступленияНачальныйОстаток,
	|	0 КАК СтоимостьПоступленияКонечныйОстаток,
	|	0 КАК ДопРасходыНачальныйОстаток,
	|	0 КАК ДопРасходыКонечныйОстаток,
	|	0 КАК ТрудозатратыНачальныйОстаток,
	|	0 КАК ТрудозатратыКонечныйОстаток,
	|	0 КАК ПостатейныеПостоянныеНачальныйОстаток,
	|	0 КАК ПостатейныеПостоянныеКонечныйОстаток,
	|	0 КАК ПостатейныеПеременныеНачальныйОстаток,
	|	0 КАК ПостатейныеПеременныеКонечныйОстаток,
	|	0 КАК СебестоимостьНачальныйОстаток,
	|	0 КАК СебестоимостьКонечныйОстаток,
	|	0 КАК НалоговыйУчетНачальныйОстаток,
	|	0 КАК НалоговыйУчетКонечныйОстаток,
	|	0 КАК ПостояннаяРазницаНачальныйОстаток,
	|	0 КАК ПостояннаяРазницаКонечныйОстаток,
	|	0 КАК ВременнаяРазницаНачальныйОстаток,
	|	0 КАК ВременнаяРазницаКонечныйОстаток,
	|	0 КАК КоличествоПриход,
	|	0 КАК КоличествоРасход,
	|	0 КАК ВесПриход,
	|	0 КАК ВесРасход,
	|	0 КАК ОбъемПриход,
	|	0 КАК ОбъемРасход,
	|	0 КАК СтоимостьПоступленияПриход,
	|	0 КАК СтоимостьПоступленияРасход,
	|	0 КАК ДопРасходыПриход,
	|	0 КАК ДопРасходыРасход,
	|	0 КАК ТрудозатратыПриход,
	|	0 КАК ТрудозатратыРасход,
	|	0 КАК ПостатейныеПостоянныеПриход,
	|	0 КАК ПостатейныеПостоянныеРасход,
	|	0 КАК ПостатейныеПеременныеПриход,
	|	0 КАК ПостатейныеПеременныеРасход,
	|	0 КАК СебестоимостьПриход,
	|	0 КАК СебестоимостьРасход,
	|	0 КАК НалоговыйУчетПриход,
	|	0 КАК НалоговыйУчетРасход,
	|	0 КАК ПостояннаяРазницаПриход,
	|	0 КАК ПостояннаяРазницаРасход,
	|	0 КАК ВременнаяРазницаПриход,
	|	0 КАК ВременнаяРазницаРасход,
	|
	|	ДетализацияСгруппированная.СтатьяРасходовИсходная КАК СтатьяРасходовИсходная,
	|	ДетализацияСгруппированная.ВидЦенности КАК ВидЦенности,
	|	ДетализацияСгруппированная.НоменклатураИсходная КАК НоменклатураИсходная,
	|	ДетализацияСгруппированная.ХарактеристикаИсходная КАК ХарактеристикаИсходная,
	|	ДетализацияСгруппированная.ДокументПоступленияИсходный КАК ДокументПоступленияИсходный,
	|
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало)
	|		* ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияСтоимостьПоступленияНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец)
	|		* ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияСтоимостьПоступленияКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаНачало)
	|		* ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияДопРасходыНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаКонец)
	|		* ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияДопРасходыКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало)
	|		* ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияПостатейныеПостоянныеНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец)
	|		* ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияПостатейныеПостоянныеКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало)
	|		* ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияПостатейныеПеременныеНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец)
	|		* ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияПостатейныеПеременныеКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаНачало
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаНачало
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаНачало
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаНачало)
	|		* ОстаткиИДвижения.КоличествоНачальныйОстаток КАК ДетализацияСебестоимостьНачальныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуНаКонец
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуНаКонец
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуНаКонец
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуНаКонец)
	|		* ОстаткиИДвижения.КоличествоКонечныйОстаток КАК ДетализацияСебестоимостьКонечныйОстаток,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоПриход КАК ДетализацияСтоимостьПоступленияПриход,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоРасход КАК ДетализацияСтоимостьПоступленияРасход,
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоПриход КАК ДетализацияДопРасходыПриход,
	|	(ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоРасход КАК ДетализацияДопРасходыРасход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоПриход КАК ДетализацияПостатейныеПостоянныеПриход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоРасход КАК ДетализацияПостатейныеПостоянныеРасход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоПриход КАК ДетализацияПостатейныеПеременныеПриход,
	|	(ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоРасход КАК ДетализацияПостатейныеПеременныеРасход,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоПриход КАК ДетализацияСебестоимостьПриход,
	|	(ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеМатериальныеЗатратыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеДопРасходыНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПостоянныеНаЕдиницуЗаПериод
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницу
	|	+ ДетализацияСгруппированная.ИсходныеПостатейныеПеременныеНаЕдиницуЗаПериод)
	|		* ОстаткиИДвижения.КоличествоРасход КАК ДетализацияСебестоимостьРасход
	|ИЗ
	|	ОстаткиИДвижения КАК ОстаткиИДвижения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДетализацияСгруппированная КАК ДетализацияСгруппированная
	|		ПО ОстаткиИДвижения.Номенклатура = ДетализацияСгруппированная.Номенклатура
	|			И ОстаткиИДвижения.Характеристика = ДетализацияСгруппированная.Характеристика
	|			И ОстаткиИДвижения.ВидЗапасов = ДетализацияСгруппированная.ВидЗапасов
	|			И ОстаткиИДвижения.Организация = ДетализацияСгруппированная.Организация
	|			И ОстаткиИДвижения.Партия = ДетализацияСгруппированная.Партия
	|			И ОстаткиИДвижения.АналитикаУчетаПартий = ДетализацияСгруппированная.АналитикаУчетаПартий
	|			И (ВЫБОР
	|				КОГДА ДетализацияСгруппированная.ПериодИсходныхЗатрат = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ОстаткиИДвижения.ПериодМесяц = ДетализацияСгруппированная.ПериодИсходныхЗатрат
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ДетализацияСгруппированная.АналитикаУчетаНоменклатуры = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ОстаткиИДвижения.АналитикаУчетаНоменклатуры = ДетализацияСгруппированная.АналитикаУчетаНоменклатуры
	|			КОНЕЦ)
	|{ГДЕ
	|	ОстаткиИДвижения.ПериодДень,
	|	ОстаткиИДвижения.ПериодНеделя,
	|	ОстаткиИДвижения.ПериодДекада,
	|	ОстаткиИДвижения.ПериодМесяц,
	|	ОстаткиИДвижения.ПериодКвартал,
	|	ОстаткиИДвижения.ПериодПолугодие,
	|	ОстаткиИДвижения.ПериодГод,
	|	ОстаткиИДвижения.АналитикаУчетаНоменклатуры.*,
	|	ОстаткиИДвижения.Номенклатура.*,
	|	ОстаткиИДвижения.ЕдиницаХранения.*,
	|	ОстаткиИДвижения.ЕдиницаДляОтчетов.*,
	|	ОстаткиИДвижения.КоэффициентЕдиницыДляОтчетов,
	|	ОстаткиИДвижения.Характеристика.*,
	|	ОстаткиИДвижения.Серия.*,
	|	ОстаткиИДвижения.Склад.*,
	|	ОстаткиИДвижения.Назначение.*,
	|	ОстаткиИДвижения.НаправлениеДеятельности.*,
	|	ОстаткиИДвижения.ВидЗапасов.*,
	|	ОстаткиИДвижения.ГруппаФинансовогоУчета.*,
	|	ОстаткиИДвижения.Организация.*,
	|	ОстаткиИДвижения.Партия.*,
	|	ОстаткиИДвижения.АналитикаУчетаПартий.*,
	|	ОстаткиИДвижения.РазделУчета.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперация.*,
	|	ОстаткиИДвижения.СтатьяДоходов.*,
	|	ОстаткиИДвижения.СтатьяРасходов.*,
	|	ОстаткиИДвижения.СтатьяДоходовРасходов.*,
	|	ОстаткиИДвижения.АналитикаДоходов.*,
	|	ОстаткиИДвижения.АналитикаРасходов.*,
	|	ОстаткиИДвижения.АналитикаДоходовРасходов.*,
	|	ОстаткиИДвижения.Договор.*,
	|	ОстаткиИДвижения.Заказ.*,
	|	ОстаткиИДвижения.Партнер.*,
	|	ОстаткиИДвижения.Контрагент.*,
	|	ОстаткиИДвижения.Соглашение.*,
	|	ОстаткиИДвижения.ТипЗапасов.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияСправочник.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияПрихода.*,
	|	ОстаткиИДвижения.ХозяйственнаяОперацияРасхода.*,
	|	ОстаткиИДвижения.Документ.*,
	|	ОстаткиИДвижения.КоличествоНачальныйОстаток,
	|	ОстаткиИДвижения.КоличествоКонечныйОстаток,
	|	ОстаткиИДвижения.ВесНачальныйОстаток,
	|	ОстаткиИДвижения.ВесКонечныйОстаток,
	|	ОстаткиИДвижения.ОбъемНачальныйОстаток,
	|	ОстаткиИДвижения.ОбъемКонечныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияНачальныйОстаток,
	|	ОстаткиИДвижения.СтоимостьПоступленияКонечныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыНачальныйОстаток,
	|	ОстаткиИДвижения.ДопРасходыКонечныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыНачальныйОстаток,
	|	ОстаткиИДвижения.ТрудозатратыКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеКонечныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеНачальныйОстаток,
	|	ОстаткиИДвижения.ПостатейныеПеременныеКонечныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьНачальныйОстаток,
	|	ОстаткиИДвижения.СебестоимостьКонечныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетНачальныйОстаток,
	|	ОстаткиИДвижения.НалоговыйУчетКонечныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ПостояннаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаНачальныйОстаток,
	|	ОстаткиИДвижения.ВременнаяРазницаКонечныйОстаток,
	|	ОстаткиИДвижения.КоличествоПриход,
	|	ОстаткиИДвижения.КоличествоРасход,
	|	ОстаткиИДвижения.ВесПриход,
	|	ОстаткиИДвижения.ВесРасход,
	|	ОстаткиИДвижения.ОбъемПриход,
	|	ОстаткиИДвижения.ОбъемРасход,
	|	ОстаткиИДвижения.СтоимостьПоступленияПриход,
	|	ОстаткиИДвижения.СтоимостьПоступленияРасход,
	|	ОстаткиИДвижения.ДопРасходыПриход,
	|	ОстаткиИДвижения.ДопРасходыРасход,
	|	ОстаткиИДвижения.ТрудозатратыПриход,
	|	ОстаткиИДвижения.ТрудозатратыРасход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПостоянныеРасход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеПриход,
	|	ОстаткиИДвижения.ПостатейныеПеременныеРасход,
	|	ОстаткиИДвижения.СебестоимостьПриход,
	|	ОстаткиИДвижения.СебестоимостьРасход,
	|	ОстаткиИДвижения.НалоговыйУчетПриход,
	|	ОстаткиИДвижения.НалоговыйУчетРасход,
	|	ОстаткиИДвижения.ПостояннаяРазницаПриход,
	|	ОстаткиИДвижения.ПостояннаяРазницаРасход,
	|	ОстаткиИДвижения.ВременнаяРазницаПриход,
	|	ОстаткиИДвижения.ВременнаяРазницаРасход,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.НоменклатураИсходная, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))).* КАК НоменклатураИсходная,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.ХарактеристикаИсходная, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))).* КАК ХарактеристикаИсходная,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.ДокументПоступленияИсходный, НЕОПРЕДЕЛЕНО)).* КАК ДокументПоступленияИсходный,
	|	(ЕСТЬNULL(ДетализацияСгруппированная.СтатьяРасходовИсходная, ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка))).* КАК СтатьяРасходовИсходная}
	|";
	#КонецОбласти
	
	Возврат ТекстЗапроса;
	
КонецФункции

#Область НастройкаПараметровОтчета

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
	ВидыЗапасовПоГФУ = Константы.ФормироватьВидыЗапасовПоГруппамФинансовогоУчета.Получить();
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
	КомпоновщикНастроек, 
	"ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", 
	ВидыЗапасовПоГФУ);
	
КонецПроцедуры

Функция ВспомогательныеПараметрыОтчета()
	ВспомогательныеПараметры = Новый Массив;
	
	КлючТекущегоВарианта = "";
	Если КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("КлючТекущегоВарианта", КлючТекущегоВарианта) Тогда
		Если Не КлючТекущегоВарианта = "ДинамикаЗакупок" Тогда
			ВспомогательныеПараметры.Добавить("Периодичность");
		КонецЕсли;
	КонецЕсли;
	
	ВспомогательныеПараметры.Добавить("КоличественныеИтогиПоЕдИзм");
	
	ВспомогательныеПараметры.Добавить("МаксимумСерийКоличество");
	ВспомогательныеПараметры.Добавить("ВыделениеСерийДиаграмм");
	ВспомогательныеПараметры.Добавить("ОтслеживаемыеАналитики");
	ВспомогательныеПараметры.Добавить("ГрадиентСерийДиаграмм");
	ВспомогательныеПараметры.Добавить("ОтображениеМаркеровТочекДиаграмм");
	
	КомпоновкаДанныхСервер.ДобавитьВспомогательныеПараметрыОтчетаПоФункциональнымОпциям(ВспомогательныеПараметры);
	
	Возврат ВспомогательныеПараметры;
КонецФункции

Функция СтруктураЗаголовковПолей()
	СтруктураЗаголовковПолей = Новый Структура;
	
	СтруктуруЗаголовковПолейЕдиницИзмерений = КомпоновкаДанныхСервер.ЗаголовкиПолейЕдиницИзмерений(КомпоновщикНастроек);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураЗаголовковПолей, СтруктуруЗаголовковПолейЕдиницИзмерений, Ложь);
	
	Возврат СтруктураЗаголовковПолей;
КонецФункции

Процедура УдалитьПоказателиИзОтборовРасшифровки(КомпоновщикНастроек)
	Если КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.Свойство("РежимРасшифровки")
		И КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.РежимРасшифровки Тогда
		Показатели = Новый Массив;
		Показатели.Добавить("Показатели.Количество.КоличествоНачальныйОстаток");
		Показатели.Добавить("Показатели.Количество.КоличествоПриход");
		Показатели.Добавить("Показатели.Количество.КоличествоРасход");
		Показатели.Добавить("Показатели.Количество.КоличествоКонечныйОстаток");
		Показатели.Добавить("Показатели.Вес.ВесНачальныйОстаток");
		Показатели.Добавить("Показатели.Вес.ВесПриход");
		Показатели.Добавить("Показатели.Вес.ВесРасход");
		Показатели.Добавить("Показатели.Вес.ВесКонечныйОстаток");
		Показатели.Добавить("Показатели.Объем.ОбъемНачальныйОстаток");
		Показатели.Добавить("Показатели.Объем.ОбъемПриход");
		Показатели.Добавить("Показатели.Объем.ОбъемРасход");
		Показатели.Добавить("Показатели.Объем.ОбъемКонечныйОстаток");
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияНачальныйОстаток");
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияПриход");
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияРасход");
		Показатели.Добавить("Показатели.СтоимостьПоступления.СтоимостьПоступленияКонечныйОстаток");
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыНачальныйОстаток");
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыПриход");
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыРасход");
		Показатели.Добавить("Показатели.ДопРасходы.ДопРасходыКонечныйОстаток");
		Показатели.Добавить("Показатели.Трудозатраты.ТрудозатратыНачальныйОстаток");
		Показатели.Добавить("Показатели.Трудозатраты.ТрудозатратыПриход");
		Показатели.Добавить("Показатели.Трудозатраты.ТрудозатратыРасход");
		Показатели.Добавить("Показатели.Трудозатраты.ТрудозатратыКонечныйОстаток");
		Показатели.Добавить("Показатели.ПостатейныеПостоянные.ПостатейныеПостоянныеНачальныйОстаток");
		Показатели.Добавить("Показатели.ПостатейныеПостоянные.ПостатейныеПостоянныеПриход");
		Показатели.Добавить("Показатели.ПостатейныеПостоянные.ПостатейныеПостоянныеРасход");
		Показатели.Добавить("Показатели.ПостатейныеПостоянные.ПостатейныеПостоянныеКонечныйОстаток");
		Показатели.Добавить("Показатели.ПостатейныеПеременные.ПостатейныеПеременныеНачальныйОстаток");
		Показатели.Добавить("Показатели.ПостатейныеПеременные.ПостатейныеПеременныеПриход");
		Показатели.Добавить("Показатели.ПостатейныеПеременные.ПостатейныеПеременныеРасход");
		Показатели.Добавить("Показатели.ПостатейныеПеременные.ПостатейныеПеременныеКонечныйОстаток");
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьНачальныйОстаток");
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьПриход");
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьРасход");
		Показатели.Добавить("Показатели.Себестоимость.СебестоимостьКонечныйОстаток");
		Показатели.Добавить("Показатели.НалоговыйУчет.НалоговыйУчетНачальныйОстаток");
		Показатели.Добавить("Показатели.НалоговыйУчет.НалоговыйУчетПриход");
		Показатели.Добавить("Показатели.НалоговыйУчет.НалоговыйУчетРасход");
		Показатели.Добавить("Показатели.НалоговыйУчет.НалоговыйУчетКонечныйОстаток");
		Показатели.Добавить("Показатели.ПостояннаяРазница.ПостояннаяРазницаНачальныйОстаток");
		Показатели.Добавить("Показатели.ПостояннаяРазница.ПостояннаяРазницаПриход");
		Показатели.Добавить("Показатели.ПостояннаяРазница.ПостояннаяРазницаРасход");
		Показатели.Добавить("Показатели.ПостояннаяРазница.ПостояннаяРазницаКонечныйОстаток");
		Показатели.Добавить("Показатели.ВременнаяРазница.ВременнаяРазницаНачальныйОстаток");
		Показатели.Добавить("Показатели.ВременнаяРазница.ВременнаяРазницаПриход");
		Показатели.Добавить("Показатели.ВременнаяРазница.ВременнаяРазницаРасход");
		Показатели.Добавить("Показатели.ВременнаяРазница.ВременнаяРазницаКонечныйОстаток");
		
		Для Каждого Показатель Из Показатели Цикл 
			КомпоновкаДанныхСервер.УдалитьЭлементОтбораИзВсехНастроекОтчета(КомпоновщикНастроек, Показатель);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьЦеновыеПоказателиИзВыбранныхПолейРасшифровки(КомпоновщикНастроек)
	Если КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.Свойство("РежимРасшифровки")
		И КомпоновщикНастроек.ФиксированныеНастройки.ДополнительныеСвойства.РежимРасшифровки Тогда
		Показатели = Новый Массив;
		Показатели.Добавить("Показатели.ЦенаПоступления.ЦенаПоступленияНачальныйОстаток");
		Показатели.Добавить("Показатели.ЦенаПоступления.ЦенаПоступленияПриход");
		Показатели.Добавить("Показатели.ЦенаПоступления.ЦенаПоступленияРасход");
		Показатели.Добавить("Показатели.ЦенаПоступления.ЦенаПоступленияКонечныйОстаток");
		Показатели.Добавить("Показатели.СредняяЦена.СредняяЦенаНачальныйОстаток");
		Показатели.Добавить("Показатели.СредняяЦена.СредняяЦенаПриход");
		Показатели.Добавить("Показатели.СредняяЦена.СредняяЦенаРасход");
		Показатели.Добавить("Показатели.СредняяЦена.СредняяЦенаКонечныйОстаток");
		
		Для Каждого Показатель Из Показатели Цикл 
			КомпоновкаДанныхСервер.УдалитьВыбранноеПолеИзВсехНастроекОтчета(КомпоновщикНастроек, Показатель);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#КонецЕсли
