//////////////////////////////////////////////////////////////////////////////////
//// Модуль команды открытия обработки "КР_ОприходованиеМежскладскихПеремещенийТоваровСТСД"
//// Создан: 22.03.2023 Федоров Д.Е., КРОК, JIRA№A2105505-1260
//// Разработка по ФДР С31.013, Загрузка номенклатуры через ТСД

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Обработка.КР_ОприходованиеМежскладскихПеремещенийТоваровСТСД.Форма.Форма");
	
КонецПроцедуры

#КонецОбласти