#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует описание реквизитов объекта, заполняемых по статистике их использования.
//
// Параметры:
//  ОписаниеРеквизитов - Структура - описание реквизитов, для которых необходимо получить значения по статистике
//
//
Процедура ЗадатьОписаниеЗаполняемыхРеквизитовПоСтатистике(ОписаниеРеквизитов) Экспорт
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Ответственный";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Ответственный";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(
		ОписаниеРеквизитов, "Организация", Параметры);
	
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Сотрудник";
	Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Сотрудник";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(
		ОписаниеРеквизитов, "Подразделение", Параметры);
		
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Организация, ТипУслуги";
	ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(
		ОписаниеРеквизитов, "СтатьяДвиженияДенежныхСредств", Параметры);
	
КонецПроцедуры

// Определяет свойства полей формы в зависимости от данных
//
// Параметры:
//	Настройки - ТаблицаЗначений - таблица с колонками:
//		* Поля - Массив - поля, для которых определяются настройки отображения
//		* Условие - ОтборКомпоновкиДанных - условия применения настройки
//		* Свойства - Структура - имена и значения свойств
//
Процедура ЗаполнитьНастройкиПолейФормы(Настройки) Экспорт
	
	Финансы = ФинансоваяОтчетностьСервер;
	
	#Область Реквизиты
	// Заявка на командировку
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДокументОснование");
	Финансы.НовыйОтбор(Элемент.Условие, "ДокументОснование",,, ВидСравненияКомпоновкиДанных.Заполнено);
	Элемент.Свойства.Вставить("Видимость");
	
	// Номер
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НомерБилета");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.ЭлектронныйБилет);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Номер билета'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("НомерБилета");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.Бронирование);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Номер'"));
	
	// Порядок покупки
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ХозяйственнаяОперация");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.ЭлектронныйБилет);
	Элемент.Свойства.Вставить("Видимость");
	
	// Контрагент
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Агент");
	Элемент.Поля.Добавить("КонтрагентАгент");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ПодотчетноеЛицо");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ТекстАвансовыйОтчет");
	Финансы.НовыйОтбор(Элемент.Условие, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо);
	Финансы.НовыйОтбор(Элемент.Условие, "Дополнительно.ПечатьЕдиногоАвансовогоОтчета", Истина);
	Элемент.Свойства.Вставить("Видимость");
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Договор");
	ГруппаИли = Финансы.НовыйОтбор(Элемент.Условие,,, Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента);
	Финансы.НовыйОтбор(ГруппаИли, "ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.БронированиеУПоставщика);
	Элемент.Свойства.Вставить("Видимость");
	
	// Перевозчик
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("Перевозчик");
	Элемент.Поля.Добавить("КонтрагентПеревозчик");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.ЭлектронныйБилет);
	Элемент.Свойства.Вставить("Видимость");
	
	// Реквизиты
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДатаОтправления");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.ЭлектронныйБилет);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Дата отправления'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДатаПрибытия");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.ЭлектронныйБилет);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Дата прибытия'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДеталиПоездки");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.ЭлектронныйБилет);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Детали поездки'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДатаОтправления");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.Бронирование);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Дата начала'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДатаПрибытия");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.Бронирование);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Дата окончания'"));
	
	Элемент = Настройки.Добавить();
	Элемент.Поля.Добавить("ДеталиПоездки");
	Финансы.НовыйОтбор(Элемент.Условие, "ТипБронирования", Перечисления.ТипыБронирования.Бронирование);
	Элемент.Свойства.Вставить("Заголовок", НСтр("ru = 'Детали бронирования'"));
	#КонецОбласти
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Добавляет команду создания документа "Бронирование".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  
// Возвращаемое значение:
//    Неопределено
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.Бронирование) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Бронирование.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.Бронирование);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст = "РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ЗначениеРазрешено(Агент)
	|	И ЗначениеРазрешено(Перевозчик)
	|";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("РеестрДокументов");
	МеханизмыДокумента.Добавить("Взаиморасчеты");
	МеханизмыДокумента.Добавить("ОборотныеРегистрыУправленческогоУчета");
	МеханизмыДокумента.Добавить("РасчетыСПодотчетниками");
	МеханизмыДокумента.Добавить("УчетДоходовРасходов");
	МеханизмыДокумента.Добавить("УчетПрочихАктивовПассивов");
	МеханизмыДокумента.Добавить("СуммыДокументовВВалютахУчета");
	
	БронированиеЛокализация.ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента);
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов - таблиц значений - данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		СформироватьСуммыДокументаВВалютахУчета(Запрос, ТекстыЗапроса, Регистры);
		
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
		
		ТекстЗапросаТаблицаДенежныеСредстваУПодотчетныхЛиц(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПартииПрочихРасходов(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияДенежныеСредстваКонтрагент(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияКонтрагентКонтрагент(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(Запрос, ТекстыЗапроса, Регистры);
		ОтразитьВУчетеНДС(Запрос, ТекстыЗапроса, Регистры);
		
		БронированиеЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;
	
	ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры);

	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

// Возвращает параметры механизма взаиморасчетов.
//
// Параметры:
// 	ДанныеЗаполнения - ДокументОбъект, СправочникОбъект, ДокументСсылка, СправочникСсылка, Структура, ДанныеФормыСтруктура - Объект или коллекция для
//              расчета параметров взаиморасчетов.
//
// Возвращаемое значение:
// 	Массив из см. ВзаиморасчетыСервер.ПараметрыМеханизма - Массив параметров функций механизма взаиморасчетов
//
Функция ПараметрыВзаиморасчеты(ДанныеЗаполнения = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ДанныеЗаполнения) Тогда
		СтруктураДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "ХозяйственнаяОперация");
		Операция = СтруктураДанныеЗаполнения.ХозяйственнаяОперация;
	ИначеЕсли ДанныеЗаполнения = Неопределено Тогда
		Операция = Неопределено;
	Иначе
		Операция = ДанныеЗаполнения.ХозяйственнаяОперация;
	КонецЕсли;
	
	МассивСтруктур = Новый Массив;
	
	#Область РасчетыСПеревозчиком
	
	СтруктураПараметров = ВзаиморасчетыСервер.ПараметрыМеханизма();
	
	// Определяет какой регистр двигают параметры, какие общие формы, перечисления и справочники использовать.
	СтруктураПараметров.ТипРасчетов                      = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	
	СтруктураПараметров.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;
	
	СтруктураПараметров.ИзменяетПланОплаты               = Истина;
	СтруктураПараметров.ИзменяетПланОтгрузкиПоставки     = Ложь;
	
	СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС          = "Сумма";
	СтруктураПараметров.Соглашение                       = "";
	СтруктураПараметров.БанковскийСчетОрганизации        = "";
	СтруктураПараметров.БанковскийСчетКонтрагента        = "";
	СтруктураПараметров.Касса                            = "";
	СтруктураПараметров.ФормаОплаты                      = "";
	СтруктураПараметров.ОплатаВВалюте                    = "";
	СтруктураПараметров.ИдентификаторПлатежа             = "";
	СтруктураПараметров.НалогообложениеНДС               = "";
	СтруктураПараметров.ГруппаФинансовогоУчета           = "";
	
	// Используются для генерации объектов расчетов и аналитики.
	СтруктураПараметров.Партнер                          = "Объект.Перевозчик";
	СтруктураПараметров.Контрагент                       = "Объект.КонтрагентПеревозчик";
	
	СтруктураПараметров.Договор                          = "";
	
	СтруктураПараметров.ОбъектРасчетов                   = "Объект.ОбъектРасчетов";
	
	МассивСтруктур.Добавить(СтруктураПараметров);
	
	#КонецОбласти
	
	#Область РасчетыСПеревозчикомИлиАгентомПоДоговоруВЦелом
	
	Если Операция = Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента
		Или Операция = Перечисления.ХозяйственныеОперации.БронированиеУПоставщика Тогда
	
		СтруктураПараметров = ВзаиморасчетыСервер.ПараметрыМеханизма();
		
		// Определяет какой регистр двигают параметры, какие общие формы, перечисления и справочники использовать.
		СтруктураПараметров.ТипРасчетов                      = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
		
		СтруктураПараметров.ПорядокРасчетов                  = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
		
		СтруктураПараметров.ИзменяетПланОплаты               = Истина;
		СтруктураПараметров.ИзменяетПланОтгрузкиПоставки     = Ложь;
		
		СтруктураПараметров.ИмяРеквизитаТЧСуммаСНДС          = "Сумма";
		СтруктураПараметров.Соглашение                       = "";
		СтруктураПараметров.БанковскийСчетОрганизации        = "";
		СтруктураПараметров.БанковскийСчетКонтрагента        = "";
		СтруктураПараметров.Касса                            = "";
		СтруктураПараметров.ФормаОплаты                      = "";
		СтруктураПараметров.ОплатаВВалюте                    = "";
		СтруктураПараметров.ИдентификаторПлатежа             = "";
		СтруктураПараметров.НалогообложениеНДС               = "";
		СтруктураПараметров.ГруппаФинансовогоУчета           = "";
		
		// Используются для генерации объектов расчетов и аналитики.
		Если Операция = Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента Тогда
			СтруктураПараметров.Партнер                          = "Объект.Агент";
			СтруктураПараметров.Контрагент                       = "Объект.КонтрагентАгент";
		Иначе
			СтруктураПараметров.Партнер                          = "Объект.Перевозчик";
			СтруктураПараметров.Контрагент                       = "Объект.КонтрагентПеревозчик";
		КонецЕсли;
		
		СтруктураПараметров.ОбъектРасчетов                   = "Объект.ОбъектРасчетовДоговор";
		
		МассивСтруктур.Добавить(СтруктураПараметров);
		
	КонецЕсли;
	
	#КонецОбласти
	
	Возврат МассивСтруктур;
	
КонецФункции

// Возвращает параметры выбора статей и аналитик.
// 
// Возвращаемое значение:
//  Структура - Параметры выбора статей и аналитик (См. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики).
//
Функция ПараметрыВыбораСтатейИАналитик() Экспорт 
	
	МассивПараметров = Новый Массив;
	
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект.Операции";
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	
	ТипыОперации = Новый Массив;
	ТипыОперации.Добавить(Перечисления.ТипыОперацийСБилетами.Возврат);
	ПараметрыВыбора.УсловияДоступностиСтатьиВСтроках.Вставить("ТипОперации", ТипыОперации);
	
	МассивПараметров.Добавить(ПараметрыВыбора);
	
	Возврат МассивПараметров;

КонецФункции

// Возвращает параметры выбора статей и аналитик.
// 
// Параметры:
//     ТипОперации - ПеречислениеСсылка.ТипыОперацийСБилетами - Тип операции с билетом
// 
// Возвращаемое значение:
//  Структура - Параметры выбора статей и аналитик (См. ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики).
//
Функция ПараметрыВыбораСтатейИАналитикВФормеВводаКорректировки(ТипОперации) Экспорт 

	МассивПараметровВыбора = Новый Массив;
	
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	ПараметрыВыбора.ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.ТипСтатьи = "ТипСтатьи";
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("СтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("АналитикаРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("АналитикаАктивовПассивов");
	ПараметрыВыбора.ДоступностьПоОперации = (ТипОперации = Перечисления.ТипыОперацийСБилетами.Возврат);
	
	МассивПараметровВыбора.Добавить(ПараметрыВыбора);
	
	Возврат МассивПараметровВыбора;
	
КонецФункции


// Инициализирует параметры регистрации счетов-фактур (полученных)
//
// Параметры:
//  Объект - ДокументОбъект.Бронирование, ДанныеФормыСтруктура- документ, для которого необходимо получить параметры.
//
// Возвращаемое значение:
//  Структура - структура параметров, см. УчетНДСУПКлиентСервер.ПараметрыРегистрацииСчетовФактурПолученных().
//
Функция ПараметрыРегистрацииСчетовФактурПолученных(Объект) Экспорт
	
	ПараметрыРегистрации = УчетНДСУПКлиентСервер.ПараметрыРегистрацииСчетовФактурПолученных();
	ПараметрыРегистрации.Ссылка = Объект.Ссылка;
	ПараметрыРегистрации.Дата = Объект.Дата;
	ПараметрыРегистрации.Организация = Объект.Организация;
	ПараметрыРегистрации.Контрагент = Объект.КонтрагентПеревозчик;
	ПараметрыРегистрации.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ПараметрыРегистрации.ИнойДокументПодтвержденияНДС = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("НомерБилета");
	Поля.Добавить("Дата");
	Поля.Добавить("ТипУслуги");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон(НСтр("ru = '%1 %2 от %3'"), Строка(Данные.ТипУслуги), Данные.НомерБилета, Данные.Дата);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата                                     КАК Период,
	|	ДанныеДокумента.ХозяйственнаяОперация                    КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.ДатаПрибытия                             КАК ДатаПрибытия,
	|	ДанныеДокумента.Организация                              КАК Организация,
	|	ДанныеДокумента.Подразделение                            КАК Подразделение,
	|	ДанныеДокумента.Сотрудник                                КАК Сотрудник,
	|	ДанныеДокумента.ПодотчетноеЛицо                          КАК ПодотчетноеЛицо,
	|	ДанныеДокумента.КонтрагентАгент                          КАК КонтрагентАгент,
	|	ДанныеДокумента.Агент                                    КАК Агент,
	|	ДанныеДокумента.КонтрагентПеревозчик                     КАК КонтрагентПеревозчик,
	|	ДанныеДокумента.Перевозчик                               КАК Перевозчик,
	|	ДанныеДокумента.Договор                                  КАК Договор,
	|	ДанныеДокумента.Валюта                                   КАК Валюта,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств            КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.АвансовыйОтчет                           КАК АвансовыйОтчет,
	|
	|	ДанныеДокумента.НомерБилета                              КАК Номер,
	|	ДанныеДокумента.Комментарий                              КАК Комментарий,
	|	ДанныеДокумента.Проведен                                 КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления                          КАК ПометкаУдаления,
	|	ДанныеДокумента.СуммаДокумента                           КАК СуммаДокумента,
	|	ДанныеДокумента.СуммаКВыдаче                             КАК СуммаКВыдаче,
	|	ДанныеДокумента.Ответственный                            КАК Ответственный,
	|	ДанныеДокумента.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	НастройкиХозяйственныхОпераций.Ссылка                    КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	Документ.Бронирование КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|		ПО ДанныеДокумента.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Для каждого КлючИЗначение Из ЗначенияПараметровПроведения(Реквизиты) Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт
	
	Запрос = Новый Запрос();
	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента = "Документ.Бронирование";
	
	ПереопределениеРасчетаПараметров = Новый Структура;
	ПереопределениеРасчетаПараметров.Вставить("НомерНаПечать", """""");
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "ДанныеДокумента";
		
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
			ТекстЗапроса, ПолноеИмяДокумента, СинонимТаблицыДокумента, Истина, ПереопределениеРасчетаПараметров);
	Иначе
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
			ТекстЗапроса, ПолноеИмяДокумента, СинонимТаблицыДокумента);
	КонецЕсли;
	
	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметровПроведения();
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначенияПараметровПроведения(Реквизиты = Неопределено)
	
	Значения = Новый Структура;
	Значения.Вставить("ИдентификаторМетаданных",                         ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.Бронирование"));
	Значения.Вставить("КонтролироватьВыдачуПодОтчетВРазрезеЦелей",       ПолучитьФункциональнуюОпцию("КонтролироватьВыдачуПодОтчетВРазрезеЦелей"));
	Значения.Вставить("ИспользоватьУчетПрочихДоходовРасходов",           ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов"));
	Значения.Вставить("ИспользоватьУчетПрочихАктивовПассивов",           ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихАктивовПассивов"));
	Значения.Вставить("ИдентификаторНеиспользуемойФинЗаписи",            ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	Значения.Вставить("ВалютаУправленческогоУчета",                      Константы.ВалютаУправленческогоУчета.Получить());
	
	Если Реквизиты <> Неопределено Тогда
		
		Коэффициенты = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
			Реквизиты.Валюта, Реквизиты.Валюта, Реквизиты.Период, Реквизиты.Организация);
			
		Значения.Вставить("КоэффициентПересчетаВВалютуУпр",              Коэффициенты.КоэффициентПересчетаВВалютуУпр);
		Значения.Вставить("КоэффициентПересчетаВВалютуРегл",             Коэффициенты.КоэффициентПересчетаВВалютуРегл);
		
		Значения.Вставить("НомерНаПечать",       ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	КонецЕсли;
	
	Возврат Значения;
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&ИдентификаторМетаданных                КАК ТипСсылки,
	|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
	|	&Организация                            КАК Организация,
	|	ВЫБОР
	|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента)
	|		ТОГДА &Агент
	|		ИНАЧЕ &Перевозчик
	|	КОНЕЦ                                   КАК Партнер,
	|	&Сотрудник                              КАК МестоХранения,
	|	ВЫБОР &ХозяйственнаяОперация
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|			ТОГДА &ПодотчетноеЛицо
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента)
	|			ТОГДА &КонтрагентАгент
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
	|			ТОГДА &КонтрагентПеревозчик
	|	КОНЕЦ                                   КАК Контрагент,
	|	
	|	&Подразделение                          КАК Подразделение,
	|	&Период                                 КАК ДатаДокументаИБ,
	|	&Ссылка                                 КАК Ссылка,
	|	
	|	ДанныеДокумента.Номер                   КАК НомерДокументаИБ,
	|	НЕОПРЕДЕЛЕНО                            КАК Статус,
	|	&Ответственный                          КАК Ответственный,
	|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
	|	НЕОПРЕДЕЛЕНО                            КАК Дополнительно,
	|	&Комментарий                            КАК Комментарий,
	|	&Проведен                               КАК Проведен,
	|	&ПометкаУдаления                        КАК ПометкаУдаления,
	|	&Период                                 КАК ДатаПервичногоДокумента,
	|	&Номер                                  КАК НомерПервичногоДокумента,
	|	&СуммаДокумента                         КАК Сумма,
	|	&Валюта                                 КАК Валюта,
	|	&Договор                                КАК Договор,
	|	НЕОПРЕДЕЛЕНО                            КАК НаправлениеДеятельности,
	|	&Период                                 КАК ДатаОтраженияВУчете,
	|	НЕОПРЕДЕЛЕНО                            КАК Приоритет
	|ИЗ
	|	Документ.Бронирование КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДенежныеСредстваУПодотчетныхЛиц(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДенежныеСредстваУПодотчетныхЛиц";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ // Отнесение суммы билета на аванс датой прибытия
	|	&ДатаПрибытия                          КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация                           КАК Организация,
	|	&Сотрудник                             КАК ПодотчетноеЛицо,
	|	&Подразделение                         КАК Подразделение,
	|	&Валюта                                КАК Валюта,
	
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК ЦельВыдачи,
	|	
	|	ДанныеДокумента.Сумма                  КАК Сумма,
	|	ДанныеДокумента.Сумма* &КоэффициентПересчетаВВалютуУпр КАК СуммаУпр,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.Сумма                  КАК КОтчету,
	|	0                                      КАК СуммаЗакупки,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.УникальныйИдентификатор КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ИспользованиеБронированияПодотчетнымЛицом) КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Сторно отнесения суммы билета на аванс датой прибытия
	|	ДанныеДокумента.Дата                   КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация                           КАК Организация,
	|	&Сотрудник                             КАК ПодотчетноеЛицо,
	|	&Подразделение                         КАК Подразделение,
	|	&Валюта                                КАК Валюта,
	
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК ЦельВыдачи,
	|	
	|	-ДанныеДокумента.Сумма                 КАК Сумма,
	|	-ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК СуммаУпр,
	|	-ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	-ДанныеДокумента.Сумма                 КАК КОтчету,
	|	0                                      КАК СуммаЗакупки,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.УникальныйИдентификатор КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ИспользованиеБронированияПодотчетнымЛицом) КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ // Закупка через подотчетное лицо
	|	ДанныеДокумента.Дата                   КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация                           КАК Организация,
	|	&ПодотчетноеЛицо                       КАК ПодотчетноеЛицо,
	|	&Подразделение                         КАК Подразделение,
	|	&Валюта                                КАК Валюта,
	
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК ЦельВыдачи,
	|	
	|	ДанныеДокумента.Сумма                  КАК Сумма,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК СуммаУпр,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.Сумма                  КАК КОтчету,
	|	0                                      КАК СуммаЗакупки,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ДанныеДокумента.ИдентификаторСтроки    КАК ИдентификаторФинЗаписи,
	|	&НастройкаХозяйственнойОперации        КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|	)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ // Закупка через подотчетное лицо
	|	ДанныеДокумента.Дата                   КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация                           КАК Организация,
	|	&ПодотчетноеЛицо                       КАК ПодотчетноеЛицо,
	|	&Подразделение                         КАК Подразделение,
	|	&Валюта                                КАК Валюта,
	
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК ЦельВыдачи,
	|	
	|	0                                      КАК Сумма,
	|	0                                      КАК СуммаУпр,
	|	0                                      КАК СуммаРегл,
	|	0                                      КАК КОтчету,
	|	ДанныеДокумента.Сумма                  КАК СуммаЗакупки,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	&ИдентификаторНеиспользуемойФинЗаписи  КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО                           КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|	)
	|	И &АвансовыйОтчет = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ // Возврат при закупке через подотчетное лицо
	|	ДанныеДокумента.Дата                   КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация                           КАК Организация,
	|	&ПодотчетноеЛицо                       КАК ПодотчетноеЛицо,
	|	&Подразделение                         КАК Подразделение,
	|	&Валюта                                КАК Валюта,
	
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК ЦельВыдачи,
	|	
	|	ДанныеДокумента.Сумма                  КАК Сумма,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК СуммаУпр,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.Сумма                  КАК КОтчету,
	|	0                                      КАК СуммаЗакупки,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратБронирования) КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ДанныеДокумента.ИдентификаторСтроки    КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВозвратБронирования) КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ // Штраф
	|	ДанныеДокумента.Дата                   КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация                           КАК Организация,
	|	&ПодотчетноеЛицо                       КАК ПодотчетноеЛицо,
	|	&Подразделение                         КАК Подразделение,
	|	&Валюта                                КАК Валюта,
	
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК ЦельВыдачи,
	|	
	|	ДанныеДокумента.СуммаШтрафа            КАК Сумма,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаУпр,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.СуммаШтрафа            КАК КОтчету,
	|	0                                      КАК СуммаЗакупки,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронированияПодотчетногоЛица) КАК ХозяйственнаяОперация,
	|	ВЫБОР КОГДА &КонтролироватьВыдачуПодОтчетВРазрезеЦелей ТОГДА
	|		&СтатьяДвиженияДенежныхСредств
	|	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ДанныеДокумента.ИдентификаторСтроки    КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронированияПодотчетногоЛица) КАК НастройкаХозяйственнойОперации
	|	
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры)
	
	#Область ЗадолженностьПеревозчикаПоБилету
	
	ТекстЗадолженностьПоставщика = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                                 КАК Ссылка,
		|	ДанныеДокумента.Дата                                                   КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                           КАК НомерРегистратора,
		|
		|	ДанныеДокумента.Ссылка.Организация                                     КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                      КАК Партнер,
		|
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                                  КАК ОбъектРасчетов,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаВзаиморасчетов,
		|	ДанныеДокумента.Сумма                                                  КАК Сумма,
		|	ДанныеДокумента.Сумма                                                  КАК СуммаВзаиморасчетов,
		|	0                                                                      КАК УменьшениеОплачивается,
		|	0                                                                      КАК УвеличениеОплачивается,
		|
		|	ДанныеДокумента.Ссылка.ХозяйственнаяОперация                           КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Ссылка.СтатьяДвиженияДенежныхСредств                   КАК СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО                                                           КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                         КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаДокумента,
		|	ДанныеДокумента.Дата                                                   КАК ДатаКурса,
		|	НЕОПРЕДЕЛЕНО                                                           КАК СвязанныйДокумент,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
		|			ТОГДА ДанныеДокумента.ИдентификаторСтроки
		|		ИНАЧЕ ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.УникальныйИдентификатор
		|	КОНЕЦ                                                                  КАК ИдентификаторФинЗаписи,
		|	НастройкиХозяйственныхОпераций.Ссылка                                  КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
		|		ПО ДанныеДокумента.Ссылка.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
		|	)
		|";
	
	ВзаиморасчетыСервер.ПроведениеОплатыПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстЗадолженностьПоставщика);
	
	#КонецОбласти
	
	#Область ЗадолженностьПеревозчикуИлиАгентуПоДоговору
	
	#Область Закупка
	
	ТекстЗакупка = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                                 КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                     КАК Организация,
		|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|		ТОГДА ДанныеДокумента.Ссылка.Перевозчик
		|		ИНАЧЕ ДанныеДокумента.Ссылка.Агент
		|	КОНЕЦ                                                                  КАК Партнер,
		|	ДанныеДокумента.Дата                                                   КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                           КАК НомерРегистратора,
		|
		|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор                           КАК ОбъектРасчетов,
		|	ДанныеДокумента.Дата                                                   КАК ДатаПлатежа,
		|	НЕОПРЕДЕЛЕНО                                                           КАК ВариантОплаты,
		|	Неопределено                                                           КАК ЗаказЗакупки,
		|	
		|	ДанныеДокумента.Сумма                                                  КАК Сумма,
		|	ДанныеДокумента.Сумма                                                  КАК СуммаВзаиморасчетов,
		|	0                                                                      КАК СуммаВзаиморасчетовПоТаре,
		|	0                                                                      КАК КПоступлению,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)         КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                   КАК НакладнаяПоЗаказам,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаВзаиморасчетов,
		|	ДанныеДокумента.Ссылка.ХозяйственнаяОперация                           КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                         КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаДокумента,
		|	ДанныеДокумента.Дата                                                   КАК ДатаКурса,
		|	Неопределено                                                           КАК СвязанныйДокумент,
		|	ДанныеДокумента.ИдентификаторСтроки                                    КАК ИдентификаторФинЗаписи,
		|	НастройкиХозяйственныхОпераций.Ссылка                                  КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
		|		ПО ДанныеДокумента.Ссылка.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|	)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
		|	)
		|";
	
	#КонецОбласти
	
	#Область УвеличениеПланаОплаты
	
	ТекстПланОплаты = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                                 КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                     КАК Организация,
		|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|		ТОГДА ДанныеДокумента.Ссылка.Перевозчик
		|		ИНАЧЕ ДанныеДокумента.Ссылка.Агент
		|	КОНЕЦ                                                                  КАК Партнер,
		|	ДанныеДокумента.Дата                                                   КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                           КАК НомерРегистратора,
		|	ДанныеДокумента.Дата                                                   КАК ДатаПлатежа,
		|	
		|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор                           КАК ОбъектРасчетов,
		|	
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)         КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                   КАК НакладнаяПоЗаказам,
		|	ЛОЖЬ                                                                   КАК СверхЗаказа,
		|	Неопределено                                                           КАК ЗаказЗакупки,
		|	ДанныеДокумента.Сумма                                                  КАК КОплате,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаВзаиморасчетов,
		|	ДанныеДокумента.Ссылка.ХозяйственнаяОперация                           КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                         КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаДокумента,
		|	Неопределено                                                           КАК ВариантОплаты,
		|	Неопределено                                                           КАК СвязанныйДокумент,
		|	ДанныеДокумента.ИдентификаторСтроки                                    КАК ИдентификаторФинЗаписи,
		|	НастройкиХозяйственныхОпераций.Ссылка                                  КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
		|		ПО ДанныеДокумента.Ссылка.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|	)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
		|	)
		|";
	
	ВзаиморасчетыСервер.ПроведениеЗакупки(Запрос, ТекстыЗапроса, Регистры, ТекстЗакупка, ТекстПланОплаты);
	
	#КонецОбласти
	
	#Область ЗакупкаУПеревозчикаДатойПрибытия
	
	ТекстЗакупка = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                              КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                  КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                   КАК Партнер,
		|	ДанныеДокумента.Ссылка.ДатаПрибытия                                 КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                        КАК НомерРегистратора,
		|
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                               КАК ОбъектРасчетов,
		|	ДанныеДокумента.Ссылка.ДатаПрибытия                                 КАК ДатаПлатежа,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	Неопределено                                                        КАК ЗаказЗакупки,
		|	
		|	ДанныеДокумента.Сумма                                               КАК Сумма,
		|	ДанныеДокумента.Сумма                                               КАК СуммаВзаиморасчетов,
		|	0                                                                   КАК СуммаВзаиморасчетовПоТаре,
		|	0                                                                   КАК КПоступлению,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)                  КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                КАК НакладнаяПоЗаказам,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                      КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаДокумента,
		|	ДанныеДокумента.Ссылка.ДатаПрибытия                                 КАК ДатаКурса,
		|	Неопределено                                                        КАК СвязанныйДокумент,
		|	""""                                                                КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ИспользованиеБронированияПодотчетнымЛицом) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
		|	)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                              КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                  КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                   КАК Партнер,
		|	ДанныеДокумента.Дата                                                КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                        КАК НомерРегистратора,
		|
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                               КАК ОбъектРасчетов,
		|	ДанныеДокумента.Дата                                                КАК ДатаПлатежа,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	Неопределено                                                        КАК ЗаказЗакупки,
		|	
		|	-ДанныеДокумента.Сумма                                              КАК Сумма,
		|	-ДанныеДокумента.Сумма                                              КАК СуммаВзаиморасчетов,
		|	0                                                                   КАК СуммаВзаиморасчетовПоТаре,
		|	0                                                                   КАК КПоступлению,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)                  КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                КАК НакладнаяПоЗаказам,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                      КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаДокумента,
		|	ДанныеДокумента.Дата                                                КАК ДатаКурса,
		|	Неопределено                                                        КАК СвязанныйДокумент,
		|	""""                                                                КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ИспользованиеБронированияПодотчетнымЛицом) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
	
	#КонецОбласти
	
	#Область УвеличениеПланаОплатыДатойПрибытия
	
	ТекстПланОплаты = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                              КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                  КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                   КАК Партнер,
		|	ДанныеДокумента.Ссылка.ДатаПрибытия                                 КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                        КАК НомерРегистратора,
		|	ДанныеДокумента.Ссылка.ДатаПрибытия                                 КАК ДатаПлатежа,
		|	
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                               КАК ОбъектРасчетов,
		|	
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)                  КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                КАК НакладнаяПоЗаказам,
		|	ЛОЖЬ                                                                КАК СверхЗаказа,
		|	Неопределено                                                        КАК ЗаказЗакупки,
		|	ДанныеДокумента.Сумма                                               КАК КОплате,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                      КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаДокумента,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	Неопределено                                                        КАК СвязанныйДокумент,
		|	""""                                                                КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ИспользованиеБронированияПодотчетнымЛицом) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
		|	)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                              КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                  КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                   КАК Партнер,
		|	ДанныеДокумента.Дата                                                КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                        КАК НомерРегистратора,
		|	ДанныеДокумента.Дата                                                КАК ДатаПлатежа,
		|	
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                               КАК ОбъектРасчетов,
		|	
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)                  КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                КАК НакладнаяПоЗаказам,
		|	ЛОЖЬ                                                                КАК СверхЗаказа,
		|	Неопределено                                                        КАК ЗаказЗакупки,
		|	-ДанныеДокумента.Сумма                                              КАК КОплате,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                      КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаДокумента,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	Неопределено                                                        КАК СвязанныйДокумент,
		|	""""                                                                КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ИспользованиеБронированияПодотчетнымЛицом) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
	
	ВзаиморасчетыСервер.ПроведениеЗакупки(Запрос, ТекстыЗапроса, Регистры, ТекстЗакупка, ТекстПланОплаты);
	
	#КонецОбласти
	
	#КонецОбласти
	
	#Область ВозвратАгентуИлиПеревозчику
	
	ТекстВозврат = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                                 КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                     КАК Организация,
		|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|		ТОГДА ДанныеДокумента.Ссылка.Перевозчик
		|		ИНАЧЕ ДанныеДокумента.Ссылка.Агент
		|	КОНЕЦ                                                                  КАК Партнер,
		|	ДанныеДокумента.Дата                                                   КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                           КАК НомерРегистратора,
		|
		|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор                           КАК ОбъектРасчетов,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаВзаиморасчетов,
		|	ДанныеДокумента.Сумма                                                  КАК Сумма,
		|	ДанныеДокумента.Сумма                                                  КАК СуммаВзаиморасчетов,
		|
		|	0                                                                      КАК УменьшениеОплачивается,
		|	0                                                                      КАК УвеличениеОплачивается,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратБронирования)       КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Ссылка.СтатьяДвиженияДенежныхСредств                   КАК СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО                                                           КАК ЗаявкаНаРасходованиеДенежныхСредств,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                         КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаДокумента,
		|	ДанныеДокумента.Ссылка.Дата                                            КАК ДатаКурса,
		|	НЕОПРЕДЕЛЕНО                                                           КАК СвязанныйДокумент,
		|	ДанныеДокумента.ИдентификаторСтроки                                    КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВозвратБронирования) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|	)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
		
	// Не используется
	ТекстПереносРасчетов = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                                 КАК Ссылка,
		|
		|	ДанныеДокумента.Ссылка.Организация                                     КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                      КАК Партнер,
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                                  КАК ОбъектРасчетов,
		|
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                                  КАК ОбъектРасчетовИсточник,
		|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор                           КАК ОбъектРасчетовПриемник,
		|	
		|	ДанныеДокумента.Сумма                                                  КАК Сумма,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаДокумента,
		|	ДанныеДокумента.Сумма                                                  КАК СуммаВзаиморасчетов,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаВзаиморасчетов,
		|	ДанныеДокумента.Дата                                                   КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                           КАК НомерРегистратора,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)  КАК ХозяйственнаяОперация,
		|	ДанныеДокумента.Дата                                                   КАК ДатаКурса,
		|	ДанныеДокумента.ИдентификаторСтроки                                    КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВозвратБронирования) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ЛОЖЬ
		|	И ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|	)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
	
	ВзаиморасчетыСервер.ПроведениеВозвратаПоставщику(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат, ТекстПереносРасчетов);
	
	ТекстВозврат = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                                 КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                     КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                      КАК Партнер,
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                                  КАК ОбъектРасчетов,
		|	
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаВзаиморасчетов,
		|	ДанныеДокумента.Сумма                                                  КАК СуммаВзаиморасчетов,
		|	ДанныеДокумента.Сумма                                                  КАК Сумма,
		|	
		|	ДанныеДокумента.Дата                                                   КАК ДатаРегистратора,
		|	ДанныеДокумента.Дата                                                   КАК ДатаКурса,
		|	ДанныеДокумента.Ссылка.Номер                                           КАК НомерРегистратора,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратБронирования)       КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                         КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.СтатьяДвиженияДенежныхСредств                   КАК СтатьяДвиженияДенежныхСредств,
		|	ДанныеДокумента.Ссылка.Валюта                                          КАК ВалютаДокумента,
		|	ДанныеДокумента.ИдентификаторСтроки                                    КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВозвратБронирования) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
	
	// Не используется
	ТекстПереносЗадолженности = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                                   КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                       КАК Организация,
		|	ДанныеДокумента.Ссылка.Перевозчик                                        КАК Партнер,
		|	ДанныеДокумента.Ссылка.ОбъектРасчетов                                    КАК ОбъектРасчетовИсточник,
		|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор                             КАК ОбъектРасчетовПриемник,
		|	
		|	ДанныеДокумента.Ссылка.Валюта                                            КАК ВалютаВзаиморасчетов,
		|	ДанныеДокумента.Ссылка.Валюта                                            КАК ВалютаДокумента,
		|	ДанныеДокумента.Сумма                                                    КАК СуммаВзаиморасчетов,
		|	ДанныеДокумента.Сумма                                                    КАК Сумма,
		|	
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)               КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                           КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Номер                                             КАК НомерРегистратора,
		|	ДанныеДокумента.Ссылка.Дата                                              КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Дата                                              КАК ДатаКурса,
		|	ДанныеДокумента.Ссылка.СтатьяДвиженияДенежныхСредств                     КАК СтатьяДвиженияДенежныхСредств,
		|	ДанныеДокумента.ИдентификаторСтроки                                      КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВозвратБронирования)  КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ЛОЖЬ
		|	И ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
	
	ВзаиморасчетыСервер.ПроведениеВозвратаОплатыОтПоставщика(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат, ТекстПереносЗадолженности);
	
	#КонецОбласти
	
	#Область Штраф
	
	ТекстЗакупка = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                              КАК Ссылка,
		|	ДанныеДокумента.Ссылка.Организация                                  КАК Организация,
		|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|		ТОГДА ДанныеДокумента.Ссылка.Перевозчик
		|		ИНАЧЕ ДанныеДокумента.Ссылка.Агент
		|	КОНЕЦ                                                               КАК Партнер,
		|	ДанныеДокумента.Дата                                                КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                        КАК НомерРегистратора,
		|
		|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор                        КАК ОбъектРасчетов,
		|	ДанныеДокумента.Дата                                                КАК ДатаПлатежа,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	Неопределено                                                        КАК ЗаказЗакупки,
		|	
		|	ДанныеДокумента.СуммаШтрафа                                         КАК Сумма,
		|	ДанныеДокумента.СуммаШтрафа                                         КАК СуммаВзаиморасчетов,
		|	0                                                                   КАК СуммаВзаиморасчетовПоТаре,
		|	0                                                                   КАК КПоступлению,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)      КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                КАК НакладнаяПоЗаказам,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                      КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаДокумента,
		|	ДанныеДокумента.Дата                                                КАК ДатаКурса,
		|	Неопределено                                                        КАК СвязанныйДокумент,
		|	ДанныеДокумента.ИдентификаторСтроки                                 КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронирования) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|	)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
	
	ТекстПланОплаты = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка                                              КАК Ссылка,
		|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|		ТОГДА ДанныеДокумента.Ссылка.Перевозчик
		|		ИНАЧЕ ДанныеДокумента.Ссылка.Агент
		|	КОНЕЦ                                                               КАК Партнер,
		|	ДанныеДокумента.Дата                                                КАК ДатаРегистратора,
		|	ДанныеДокумента.Ссылка.Номер                                        КАК НомерРегистратора,
		|	ДанныеДокумента.Дата                                                КАК ДатаПлатежа,
		|	
		|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор                        КАК ОбъектРасчетов,
		|	
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов)      КАК ПорядокРасчетов,
		|	ЛОЖЬ                                                                КАК НакладнаяПоЗаказам,
		|	ЛОЖЬ                                                                КАК СверхЗаказа,
		|	Неопределено                                                        КАК ЗаказЗакупки,
		|	ДанныеДокумента.СуммаШтрафа                                         КАК КОплате,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаВзаиморасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Взаимозачет)                      КАК ФормаОплаты,
		|	ДанныеДокумента.Ссылка.Валюта                                       КАК ВалютаДокумента,
		|	Неопределено                                                        КАК ВариантОплаты,
		|	Неопределено                                                        КАК СвязанныйДокумент,
		|	ДанныеДокумента.ИдентификаторСтроки                                 КАК ИдентификаторФинЗаписи,
		|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронирования) КАК НастройкаХозяйственнойОперации
		|ИЗ
		|	Документ.Бронирование.Операции КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка В (&Ссылка)
		|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
		|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
		|	)
		|	И ДанныеДокумента.ТипОперации В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
		|	)
		|";
	
	ВзаиморасчетыСервер.ПроведениеЗакупки(Запрос, ТекстыЗапроса, Регистры, ТекстЗакупка, ТекстПланОплаты);
	
	#КонецОбласти
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаДвиженияДенежныеСредстваКонтрагент(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияДенежныеСредстваКонтрагент";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ // Отнесение суммы билета на аванс датой прибытия
	|	&ДатаПрибытия КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|
	|	&Сотрудник КАК ДенежныеСредства,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|	&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&Валюта КАК ВалютаПлатежа,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
	|
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК СуммаОплаты,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаОплатыРегл,
	|	ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПостоплаты,
	|	0 КАК СуммаПостоплатыРегл,
	|	0 КАК СуммаПостоплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПредоплаты,
	|	0 КАК СуммаПредоплатыРегл,
	|	0 КАК СуммаПредоплатыВВалютеПлатежа,
	|
	|	&Валюта КАК ВалютаВзаиморасчетов,
	|
	|	ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПостоплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПредоплатыВВалютеВзаиморасчетов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДенежныхСредств,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ИсточникГФУРасчетов,
	|	ЛОЖЬ КАК ОтложенноеПроведение
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Сторно на сумму возврата
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом) КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|
	|	&Сотрудник КАК ДенежныеСредства,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|	&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&Валюта КАК ВалютаПлатежа,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
	|
	|	-ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК СуммаОплаты,
	|	-ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаОплатыРегл,
	|	-ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПостоплаты,
	|	0 КАК СуммаПостоплатыРегл,
	|	0 КАК СуммаПостоплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПредоплаты,
	|	0 КАК СуммаПредоплатыРегл,
	|	0 КАК СуммаПредоплатыВВалютеПлатежа,
	|
	|	&Валюта КАК ВалютаВзаиморасчетов,
	|
	|	-ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПостоплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПредоплатыВВалютеВзаиморасчетов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДенежныхСредств,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ИсточникГФУРасчетов,
	|	ЛОЖЬ КАК ОтложенноеПроведение
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Закупка через подотчетное лицо
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|
	|	&ПодотчетноеЛицо КАК ДенежныеСредства,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|	&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&Валюта КАК ВалютаПлатежа,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
	|
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК СуммаОплаты,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаОплатыРегл,
	|	ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПостоплаты,
	|	0 КАК СуммаПостоплатыРегл,
	|	0 КАК СуммаПостоплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПредоплаты,
	|	0 КАК СуммаПредоплатыРегл,
	|	0 КАК СуммаПредоплатыВВалютеПлатежа,
	|
	|	&Валюта КАК ВалютаВзаиморасчетов,
	|
	|	ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПостоплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПредоплатыВВалютеВзаиморасчетов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДенежныхСредств,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ИсточникГФУРасчетов,
	|	ЛОЖЬ КАК ОтложенноеПроведение
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Возврат при закупке через подотчетное лицо
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратБронированияПодотчетногоЛица) КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|
	|	&ПодотчетноеЛицо КАК ДенежныеСредства,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|	&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&Валюта КАК ВалютаПлатежа,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов,
	|	НЕОПРЕДЕЛЕНО КАК РасчетныйДокумент,
	|
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК СуммаОплаты,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаОплатыРегл,
	|	ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПостоплаты,
	|	0 КАК СуммаПостоплатыРегл,
	|	0 КАК СуммаПостоплатыВВалютеПлатежа,
	|
	|	0 КАК СуммаПредоплаты,
	|	0 КАК СуммаПредоплатыРегл,
	|	0 КАК СуммаПредоплатыВВалютеПлатежа,
	|
	|	&Валюта КАК ВалютаВзаиморасчетов,
	|
	|	ДанныеДокумента.Сумма КАК СуммаОплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПостоплатыВВалютеВзаиморасчетов,
	|	0 КАК СуммаПредоплатыВВалютеВзаиморасчетов,
	|
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДенежныхСредств,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ИсточникГФУРасчетов,
	|	ЛОЖЬ КАК ОтложенноеПроведение
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияКонтрагентКонтрагент(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияКонтрагентКонтрагент";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Ссылка.Организация КАК Организация,
	|	ДанныеДокумента.Ссылка.Подразделение КАК Подразделение,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК ОбъектРасчетов,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК КорПартнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК КорКонтрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.Договор КАК КорДоговор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК КорОбъектРасчетов,
	|
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК Сумма,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.Сумма КАК СуммаВВалюте,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК СуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК КорВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК КорСуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК ИсточникГФУРасчетов,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК КорИсточникГФУРасчетов
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Ссылка.Организация КАК Организация,
	|	ДанныеДокумента.Ссылка.Подразделение КАК Подразделение,
	|
	|	ДанныеДокумента.Ссылка.Агент КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентАгент КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК ОбъектРасчетов,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК КорПартнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК КорКонтрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК КорДоговор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК КорОбъектРасчетов,
	|
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК Сумма,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.Сумма КАК СуммаВВалюте,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК СуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК КорВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК КорСуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК ИсточникГФУРасчетов,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК КорИсточникГФУРасчетов
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Покупка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Доплата)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ // Возвраты
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратБронирования) КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Ссылка.Организация КАК Организация,
	|	ДанныеДокумента.Ссылка.Подразделение КАК Подразделение,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК КорПартнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК КорКонтрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК КорДоговор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК КорОбъектРасчетов,
	|
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК Сумма,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.Сумма КАК СуммаВВалюте,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК СуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК КорВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК КорСуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ИсточникГФУРасчетов,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК КорИсточникГФУРасчетов
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратБронирования) КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Ссылка.Организация КАК Организация,
	|	ДанныеДокумента.Ссылка.Подразделение КАК Подразделение,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов,
	|
	|	ДанныеДокумента.Ссылка.Агент КАК КорПартнер,
	|	ДанныеДокумента.Ссылка.КонтрагентАгент КАК КорКонтрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеДокумента.Ссылка.Договор КАК КорДоговор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК КорОбъектРасчетов,
	|
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуУпр КАК Сумма,
	|	ДанныеДокумента.Сумма * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.Сумма КАК СуммаВВалюте,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК СуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК КорВалютаВзаиморасчетов,
	|	ДанныеДокумента.Сумма КАК КорСуммаВВалютеВзаиморасчетов,
	|
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ИсточникГФУРасчетов,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК КорИсточникГФУРасчетов
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента)
	|	И ДанныеДокумента.ТипОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияКонтрагентДоходыРасходы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияКонтрагентДоходыРасходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования) КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеДокумента.Ссылка.Агент КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентАгент КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор КАК ОбъектРасчетов,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеДокумента.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК Сумма,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаБезНДС,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаРеглБезНДС,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК Валюта,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаВВалюте,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаБезНДСВВалюте,
	|	ДанныеДокумента.Ссылка.Валюта КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаВВалютеВзаиморасчетов,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	ДанныеДокумента.ИдентификаторСтроки КАК ИдентификаторФинЗаписи
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезАгента)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования) КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеДокумента.Ссылка.Перевозчик КАК Партнер,
	|	ДанныеДокумента.Ссылка.КонтрагентПеревозчик КАК Контрагент,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.Договор КАК Договор,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеДокумента.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК Сумма,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаБезНДС,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаРеглБезНДС,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК Валюта,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаВВалюте,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаБезНДСВВалюте,
	|	ДанныеДокумента.Ссылка.Валюта КАК ВалютаВзаиморасчетов,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаВВалютеВзаиморасчетов,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
	|	ДанныеДокумента.ИдентификаторСтроки КАК ИдентификаторФинЗаписи
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеУПоставщика)
	|	)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияДенежныеСредстваДоходыРасходы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияДенежныеСредстваДоходыРасходы";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронированияПодотчетногоЛица) КАК ХозяйственнаяОперация,
	|	&Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Ссылка.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиДС,
	|
	|	&ПодОтчетноеЛицо КАК ДенежныеСредства,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ДенежныеСредстваУПодотчетногоЛица) КАК ТипДенежныхСредств,
	|	&СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяДоходовРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаДоходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеДокумента.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК Сумма,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|
	|	ДанныеДокумента.Ссылка.Валюта КАК Валюта,
	|	ДанныеДокумента.СуммаШтрафа КАК СуммаВВалюте,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУДоходовРасходов,
	|	ДанныеДокумента.ИдентификаторСтроки КАК ИдентификаторФинЗаписи
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	И ДанныеДокумента.Ссылка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|	)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПрочиеАктивыПассивы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.СтатьяРасходов КАК Статья,
	|	ДанныеДокумента.АналитикаАктивовПассивов КАК Аналитика,
	|	СУММА(ВЫРАЗИТЬ(ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(31,2))) КАК Сумма
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|	И ДанныеДокумента.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.СтатьяРасходов,
	|	ДанныеДокумента.АналитикаАктивовПассивов,
	|	ДанныеДокумента.НаправлениеДеятельности,
	|	ДанныеДокумента.Подразделение
	|";
	ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ"
		+ РегистрыНакопления.ПрочиеАктивыПассивы.ТекстЗапросаТаблицаПрочиеАктивыПассивы(Ложь);
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПартииПрочихРасходов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПартииПрочихРасходов";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПартииПрочихРасходов(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПрочиеРасходы";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаБезНДС,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаБезНДСУпр,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаСНДСРегл,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаБезНДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронированияПодотчетногоЛица)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|			ТОГДА ДанныеДокумента.ИдентификаторСтроки
	|		ИНАЧЕ ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.УникальныйИдентификатор
	|	КОНЕЦ КАК ИдентификаторФинЗаписи,
	|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) ТОГДА
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронированияПодотчетногоЛица)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронирования)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ВтИсходныеПрочиеРасходы
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|	ПО
	|		ДанныеДокумента.СтатьяРасходов = СтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|	И ДанныеДокумента.Ссылка.ТипБронирования = ЗНАЧЕНИЕ(Перечисление.ТипыБронирования.ЭлектронныйБилет)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПрочиеРасходы(Запрос, ТекстыЗапроса) Экспорт
	
	ИмяРегистра = "ВтПрочиеРасходы";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаВтПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПартииПрочихРасходов";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК Стоимость,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СтоимостьБезНДС,
	|	0 КАК НДСУпр,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СтоимостьРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	0 КАК НДСРегл,
	|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронированияПодотчетногоЛица)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|			ТОГДА ДанныеДокумента.ИдентификаторСтроки
	|		ИНАЧЕ ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.УникальныйИдентификатор
	|	КОНЕЦ КАК ИдентификаторФинЗаписи,
	|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) ТОГДА
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронированияПодотчетногоЛица)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронирования)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|
	|ПОМЕСТИТЬ ВтИсходныеПартииПрочихРасходов
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

Функция ТекстЗапросаТаблицаВтПартииПрочихРасходов(Запрос, ТекстыЗапроса) Экспорт
	
	ИмяРегистра = "ВтПартииПрочихРасходов";
	
	Если Не ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтИсходныеПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаВтПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДвиженияПоПрочимАктивамПассивам";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДокумента.СтатьяРасходов КАК Статья,
	|	ДанныеДокумента.АналитикаАктивовПассивов КАК Аналитика,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПрочихАктивовПассивов.Дебет) КАК ДебетКредит,
	|
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуРегл КАК СуммаРегл,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаУпр,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаШтрафа * &КоэффициентПересчетаВВалютуУпр КАК СуммаБезНДС,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо)
	|			ТОГДА ДанныеДокумента.ИдентификаторСтроки
	|		ИНАЧЕ ДанныеДокумента.Ссылка.ОбъектРасчетовДоговор.УникальныйИдентификатор
	|	КОНЕЦ КАК ИдентификаторФинЗаписи,
	|	ВЫБОР КОГДА ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо) ТОГДА
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронированияПодотчетногоЛица)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ШтрафыПриВозвратеБронирования)
	|	КОНЕЦ КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	Документ.Бронирование.Операции КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И ДанныеДокумента.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	И ДанныеДокумента.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийСБилетами.Возврат)
	|	И ДанныеДокумента.СуммаШтрафа <> 0
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ОтразитьВУчетеНДС(Запрос, ТекстыЗапроса, Регистры)
	
	Если Не УчетНДСУП.ТребуетсяПроведениеПоРегистрамНДС(Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЦенности = "
	|ВЫБРАТЬ
	|	Операция.Дата                                КАК Период,
	|	Операция.Ссылка                              КАК Ссылка,
	|	Операция.Организация                         КАК Организация,
	|	Операция.Подразделение                       КАК Подразделение,
	|	Операция.КонтрагентПеревозчик                КАК Контрагент,
	|	Операция.Договор                             КАК Договор,
	|	Операция.КонтрагентПеревозчик                КАК Грузоотправитель,
	|	Операция.Ссылка                              КАК ДокументПриобретения,
	|	Операция.Ссылка                              КАК ИсходныйТорговыйДокумент,
	|	ЛОЖЬ                                         КАК ИсправлениеОшибок,
	|	ЛОЖЬ                                         КАК КорректировкаПоСогласованиюСторон,
	|	НЕОПРЕДЕЛЕНО                                 КАК ДокументКорректировкиПриобретения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС) КАК НалогообложениеНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС) КАК ВидДеятельностиНДС,
	|	Операция.СтавкаНДС                           КАК СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО                                 КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО                                 КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО                                 КАК НомерГТД,
	|	Операция.Подразделение                       КАК ПодразделениеУчета,
	|	Операция.НаправлениеДеятельности             КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО 								 КАК СписатьНаРасходы,
	|	НЕОПРЕДЕЛЕНО                                 КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО                                 КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                                 КАК СтатьяПрочихАктивов,
	|	НЕОПРЕДЕЛЕНО                                 КАК АналитикаПрочихАктивов,
	|	НЕОПРЕДЕЛЕНО                                 КАК Назначение,
	|	""""                                         КАК ИдентификаторСтроки,
	|	&ИдентификаторФинЗаписи                      КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВходящийНДСПоПриобретению) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	Документ.Бронирование КАК Операция
	|ГДЕ
	|	Операция.Ссылка В (&Ссылка)
	|";
	
	ТекстЦенности = СтрЗаменить(ТекстЦенности, "&ИдентификаторФинЗаписи", ПроведениеДокументов.ИдентификаторНеиспользуемойФинЗаписи());
	УчетНДСУП.ОтразитьПриобретениеУПоставщика(Запрос, ТекстыЗапроса, Регистры, ТекстЦенности);
	
КонецПроцедуры

Процедура СформироватьСуммыДокументаВВалютахУчета(Запрос, ТекстыЗапроса, Регистры = Неопределено) Экспорт
	
	ТекстЗапросаДанных = "
	|ВЫБРАТЬ
	|	""ДанныеДокумента""                                   КАК ИсточникДанных,
	|	ЛОЖЬ                                                  КАК РаспределятьОбщуюСумму,
	|	Операции.Ссылка                                       КАК Ссылка,
	|	Операции.Ссылка.Дата                                  КАК Дата,
	|	Операции.Ссылка.Организация                           КАК Организация,
	|	Операции.Ссылка.Валюта                                КАК ВалютаДокумента,
	|	Операции.Ссылка.Валюта                                КАК ВалютаВзаиморасчетов,
	|	Операции.НомерСтроки                                  КАК НомерСтроки,
	|	Операции.ИдентификаторСтроки                          КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО                                          КАК ПериодБазыНДС,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)           КАК СтавкаНДС,
	|	Операции.Сумма                                        КАК СуммаСНДС,
	|	0                                                     КАК СуммаНДС,
	|	Операции.Сумма - Операции.СуммаНДС                    КАК СуммаБезНДС,
	|	Операции.Сумма                                        КАК СуммаВзаиморасчетов,
	|	0                                                     КАК СуммаНДСВзаиморасчетов,
	|	Операции.Сумма                                        КАК СуммаСНДСУпр,
	|	0                                                     КАК СуммаНДСУпр,
	|	Операции.Сумма - Операции.СуммаНДС                    КАК СуммаБезНДСУпр,
	|	Операции.Сумма                                        КАК СуммаСНДСРегл,
	|	0                                                     КАК СуммаНДСРегл,
	|	Операции.Сумма - Операции.СуммаНеОблагаемаяНДС - Операции.СуммаНДС КАК БазаНДСРегл,
	|	Операции.Сумма - Операции.СуммаНДС                    КАК СуммаБезНДСРегл,
	|
	|	ЛОЖЬ КАК ОтражаетсяВРасчетах,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|	ЛОЖЬ КАК ПересчитыватьПоДаннымРасчетов
	|ИЗ
	|	Документ.Бронирование.Операции КАК Операции
	|ГДЕ
	|	Операции.Ссылка В (&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ДанныеДокумента""                                   КАК ИсточникДанных,
	|	ЛОЖЬ                                                  КАК РаспределятьОбщуюСумму,
	|	Операции.Ссылка                                       КАК Ссылка,
	|	Операции.Ссылка.Дата                                  КАК Дата,
	|	Операции.Ссылка.Организация                           КАК Организация,
	|	Операции.Ссылка.Валюта                                КАК ВалютаДокумента,
	|	Операции.Ссылка.Валюта                                КАК ВалютаВзаиморасчетов,
	|	Операции.НомерСтроки                                  КАК НомерСтроки,
	|	Операции.ИдентификаторСтрокиШтрафа                    КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО                                          КАК ПериодБазыНДС,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)           КАК СтавкаНДС,
	|	Операции.СуммаШтрафа                                  КАК СуммаСНДС,
	|	0                                                     КАК СуммаНДС,
	|	Операции.СуммаШтрафа                                  КАК СуммаБезНДС,
	|	Операции.СуммаШтрафа                                  КАК СуммаВзаиморасчетов,
	|	0                                                     КАК СуммаНДСВзаиморасчетов,
	|	Операции.СуммаШтрафа                                  КАК СуммаСНДСУпр,
	|	0                                                     КАК СуммаНДСУпр,
	|	Операции.СуммаШтрафа                                  КАК СуммаБезНДСУпр,
	|	Операции.СуммаШтрафа                                  КАК СуммаСНДСРегл,
	|	0                                                     КАК СуммаНДСРегл,
	|	Операции.СуммаШтрафа                                  КАК БазаНДСРегл,
	|	Операции.СуммаШтрафа                                  КАК СуммаБезНДСРегл,
	|
	|	ЛОЖЬ КАК ОтражаетсяВРасчетах,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|	ЛОЖЬ КАК ПересчитыватьПоДаннымРасчетов
	|ИЗ
	|	Документ.Бронирование.Операции КАК Операции
	|ГДЕ
	|	Операции.Ссылка В (&Ссылка)
	|	И Операции.СуммаШтрафа <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ДанныеДокумента""                                   КАК ИсточникДанных,
	|	ЛОЖЬ                                                  КАК РаспределятьОбщуюСумму,
	|	Операция.Ссылка                                       КАК Ссылка,
	|	Операция.Дата                                         КАК Дата,
	|	Операция.Организация                                  КАК Организация,
	|	Операция.Валюта                                       КАК ВалютаДокумента,
	|	Операция.Валюта                                       КАК ВалютаВзаиморасчетов,
	|	0                                                     КАК НомерСтроки,
	|	Операция.ИдентификаторДокумента                       КАК ИдентификаторСтроки,
	|	НЕОПРЕДЕЛЕНО                                          КАК ПериодБазыНДС,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)           КАК СтавкаНДС,
	|	Операция.СуммаДокумента                               КАК СуммаСНДС,
	|	0                                                     КАК СуммаНДС,
	|	Операция.СуммаДокумента - Операция.СуммаНДС           КАК СуммаБезНДС,
	|	Операция.СуммаДокумента                               КАК СуммаВзаиморасчетов,
	|	0                                                     КАК СуммаНДСВзаиморасчетов,
	|	Операция.СуммаДокумента                               КАК СуммаСНДСУпр,
	|	0                                                     КАК СуммаНДСУпр,
	|	Операция.СуммаДокумента - Операция.СуммаНДС           КАК СуммаБезНДСУпр,
	|	Операция.СуммаДокумента                               КАК СуммаСНДСРегл,
	|	0                                                     КАК СуммаНДСРегл,
	|	Операция.СуммаДокумента - Операция.СуммаНеОблагаемаяНДС - Операция.СуммаНДС КАК БазаНДСРегл,
	|	Операция.СуммаДокумента - Операция.СуммаНДС           КАК СуммаБезНДСРегл,
	|
	|	ЛОЖЬ КАК ОтражаетсяВРасчетах,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|	ЛОЖЬ КАК ПересчитыватьПоДаннымРасчетов
	|ИЗ
	|	Документ.Бронирование КАК Операция
	|ГДЕ
	|	Операция.Ссылка В (&Ссылка)
	|";
	
	РегистрыСведений.СуммыДокументовВВалютахУчета.СформироватьПоДаннымДокумента(
		Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаДанных);
		
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.Бронирование.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.6.25";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("34db78d0-0d6c-4ae2-929e-38ab74fc2693");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.Бронирование.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизит ""Настройка счетов учета"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.Бронирование.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.Бронирование.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Документы.Бронирование.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Бронирование КАК Документ
	|ГДЕ
	|	ЛОЖЬ
	|";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Для Каждого Документ Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			Ссылка = Документ.Ссылка;
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = Ссылка.ПолучитьОбъект();
			
			Если ДокументОбъект <> Неопределено Тогда
			КонецЕсли;
			
			Если ДокументОбъект <> Неопределено И ДокументОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Ссылка);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Документ.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
