///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет необходимость выполнения замеров.
//
// Возвращаемое значение:
//  Булево - Истина выполнять, Ложь не выполнять.
//
Функция ВыполнятьЗамерыПроизводительности() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВыполнятьЗамерыПроизводительности.Получить();
	
КонецФункции

// --> Евлахов Игорь Николаевич (Начало) 31.08.2023
// Задача #3069

// Функция определяет необходимость выполнения замеров.
//
// Возвращаемое значение:
//  Булево - Истина выполнять, Ложь не выполнять.
//
Функция ВыполнятьЗамерыПроизводительностиОткрытияФорм() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ВыполнятьЗамерыПроизводительностиОткрытияФорм = Ложь;
	ВыполнятьЗамерыПроизводительности = Константы.ВыполнятьЗамерыПроизводительности.Получить();
	Если ВыполнятьЗамерыПроизводительности Тогда
		ВыполнятьЗамерыПроизводительностиОткрытияФорм = Константы.злВыполнятьЗамерыПроизводительностиОткрытияФорм.Получить();
	КонецЕсли;
	
	Возврат ВыполнятьЗамерыПроизводительностиОткрытияФорм;
	
КонецФункции
// <-- Евлахов Игорь Николаевич (Конец) 31.08.2023

#КонецОбласти
