#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
//	СтрокаТаблицыЗначений, Неопределено - сформированная команда для вывода в подменю.
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Результат = Неопределено;
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ВедомостьРасчетовПоФинансовымИнструментам) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		КомандаОтчет.Менеджер = Метаданные.Отчеты.ВедомостьРасчетовПоФинансовымИнструментам.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Ведомость расчетов'");
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.КлючВарианта = "ВедомостьРасчетовПоФинансовымИнструментамКонтекст";
		Результат = КомандаОтчет;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли