
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьНастройки();
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда		
		СохранитьНастройкиНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИЗакрыть(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда		
		СохранитьНастройкиНаСервере();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьНастройки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ключи = "ОбработкаИнвентаризации, ОбработкаОтгрузки, ОбработкаПриемки, ПарольДоступаКФормеНастроек";
		  
	ИмяНастройки = "НастройкаРабочееМестоСотрудникаМагазина";	  
	
	Настройки = КР_ОбщегоНазначениеСервер.ПрочитатьДанныеИзХранилищаНастроек(ИмяНастройки, Ключи);
	
	// Все настройки сохраняются по названию реквизитов на форме.
	Для каждого Настройка Из Настройки Цикл
		Если Настройка.Значение <> Неопределено Тогда
			ЭтотОбъект[Настройка.Ключ] = Настройка.Значение;
		КонецЕсли;
	КонецЦикла; 
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	УстановитьПривилегированныйРежим(Истина);
			  
	ИмяНастройки = "НастройкаРабочееМестоСотрудникаМагазина";
		
	КР_ОбщегоНазначениеСервер.ЗаписатьДанныеВХранилищеНастроек(ИмяНастройки, ОбработкаИнвентаризации,				"ОбработкаИнвентаризации");
	КР_ОбщегоНазначениеСервер.ЗаписатьДанныеВХранилищеНастроек(ИмяНастройки, ОбработкаОтгрузки,						"ОбработкаОтгрузки");
	КР_ОбщегоНазначениеСервер.ЗаписатьДанныеВХранилищеНастроек(ИмяНастройки, ОбработкаПриемки, 						"ОбработкаПриемки");
	КР_ОбщегоНазначениеСервер.ЗаписатьДанныеВХранилищеНастроек(ИмяНастройки, СокрЛП(ПарольДоступаКФормеНастроек), 	"ПарольДоступаКФормеНастроек");
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

#КонецОбласти

