#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры);

	УстановитьРеквизитыЦенообразования = Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИспользуетсяЦенообразование25", УстановитьРеквизитыЦенообразования) Тогда
		УстановитьРеквизитыЦенообразования =	ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	КонецЕсли;
	
	Для Каждого Реквизит Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл
		Если Не Реквизит.Использование Тогда
			ЭтотОбъект[Реквизит.ИмяРеквизита] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Номер = СокрЛП(Номер);
	
	Если НастройкиИспользованияСерий.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ГоденДо = НачалоЧаса(ГоденДо);
	ИначеЕсли НастройкиИспользованияСерий.ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоМесяцев Тогда
		ГоденДо = НачалоМесяца(ГоденДо);
	Иначе
		ГоденДо = НачалоДня(ГоденДо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиИспользованияСерий.ШаблонРабочегоНаименованияСерии) Тогда
		Наименование = НоменклатураСервер.НаименованиеПоШаблону(НастройкиИспользованияСерий.ШаблонРабочегоНаименованияСерии, ЭтотОбъект);
	Иначе
		Наименование = НоменклатураКлиентСервер.ПредставлениеСерииБезРасчетаПоШаблонуНаименования(НастройкиИспользованияСерий, ЭтотОбъект);
	КонецЕсли;
	
	Если УстановитьРеквизитыЦенообразования И ЗначениеЗаполнено(НастройкиИспользованияСерий.НастройкиКлючаЦенПоСерии) Тогда
		Если НастройкиИспользованияСерий.НастройкиКлючаЦенПоСерии = Перечисления.ВариантОтбораДляКлючаЦен.Использовать 
			Или НастройкиИспользованияСерий.НастройкиКлючаЦенПоСерии = Перечисления.ВариантОтбораДляКлючаЦен.ИспользоватьПоРеквизитам Тогда
			СерияНоменклатурыДляЦенообразования = ПолучитьСериюНоменклатурыДляЦенообразования(НастройкиИспользованияСерий);
		КонецЕсли;		
	КонецЕсли;		
	
	ОбщегоНазначенияУТ.ПодготовитьДанныеДляСинхронизацииКлючей(ЭтотОбъект, ПараметрыСинхронизацииКлючей());	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ОбщегоНазначенияУТ.СинхронизироватьКлючи(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры);

	Для Каждого Реквизит Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл
		Если Не Реквизит.Использование
			Или Не Реквизит.ПроверятьЗаполнение Тогда
			МассивНепроверяемыхРеквизитов.Добавить(Реквизит.ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = "АвтоТест" Тогда
		Возврат;
	КонецЕсли;
	
	ВидНоменклатуры = ДанныеЗаполнения.ВидНоменклатуры;
	НастройкиИспользованияСерий = Новый ФиксированнаяСтруктура(Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры));
	
	СтруктураПолей = Новый Структура;
	
	Для Каждого Реквизит Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл
		Если Реквизит.Использование Тогда
			СтруктураПолей.Вставить(Реквизит.ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
			
	ЗаполнитьЗначенияСвойств(СтруктураПолей, ДанныеЗаполнения);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураПолей);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыСинхронизацииКлючей()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Справочник.КлючиАналитикиУчетаНоменклатуры", "ПометкаУдаления");
	
	Возврат Результат;
	
КонецФункции

// Получить серию номенклатуры для ценообразования.
// 
// Параметры:
//  НастройкиИспользованияСерий - Структура - Настройки использования серий:
// * Ошибка - Булево -
// * ОписаниеОшибки - Строка -
// * УказыватьПриПоступлении - Булево -
// * УказыватьПриОтгрузке - Булево -
// * УказыватьПриПланированииОтгрузки - Булево -
// 
// Возвращаемое значение:
//  СправочникСсылка.СерииНоменклатурыДляЦенообразования, Произвольный - Получить серию номенклатуры для ценообразования
Функция ПолучитьСериюНоменклатурыДляЦенообразования(Знач НастройкиИспользованияСерий)
//	получить список доп реквизитов по которым искать серию

	РеквизитыДляКлючаЦен = Справочники.ВидыНоменклатуры.ПолучитьРеквизитыДляКлючаЦен(ВидНоменклатуры, "Серии");
	
	Если НастройкиИспользованияСерий.НастройкиКлючаЦенПоСерии = Перечисления.ВариантОтбораДляКлючаЦен.ИспользоватьПоРеквизитам Тогда
		ДанныеПоДополнительнымРеквизитам = ДополнительныеРеквизиты.Выгрузить(); 
		
		Для Каждого СтрокаРеквизитаДляКлючаЦен Из РеквизитыДляКлючаЦен Цикл
			Если СтрокаРеквизитаДляКлючаЦен.ЭтоДопРеквизит Тогда
				НайденнаяСтрока = ДанныеПоДополнительнымРеквизитам.Найти(СтрокаРеквизитаДляКлючаЦен.Свойство, "Свойство");
				СтрокаРеквизитаДляКлючаЦен.Значение = НайденнаяСтрока.Значение;
			Иначе
				СтрокаРеквизитаДляКлючаЦен.Значение = ЭтотОбъект[СтрокаРеквизитаДляКлючаЦен.ИмяРеквизита];
			КонецЕсли;
		КонецЦикла;
	Иначе // по всем реквизитам для ценообразования
		МассивНаименованийРеквизитов = Справочники.СерииНоменклатурыДляЦенообразования.ПолучитьНаборРеквизитовДляКонтроля();
	
		Для Каждого Описание Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл
			Если Описание.Использование И МассивНаименованийРеквизитов.Найти(Описание.ИмяРеквизита) <> Неопределено Тогда

				СтрокаРеквизитаДляКлючаЦен = РеквизитыДляКлючаЦен.Добавить();
				СтрокаРеквизитаДляКлючаЦен.ИмяРеквизита   = Описание.ИмяРеквизита;
				СтрокаРеквизитаДляКлючаЦен.ЭтоДопРеквизит = Ложь;
				СтрокаРеквизитаДляКлючаЦен.Используется   = Истина;
				СтрокаРеквизитаДляКлючаЦен.Значение = ЭтотОбъект[Описание.ИмяРеквизита];
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка Из ДополнительныеРеквизиты Цикл
			СтрокаРеквизитаДляКлючаЦен = РеквизитыДляКлючаЦен.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРеквизитаДляКлючаЦен, Строка);
			СтрокаРеквизитаДляКлючаЦен.ИмяРеквизита = Строка.Свойство;
			СтрокаРеквизитаДляКлючаЦен.ЭтоДопРеквизит = Истина;
			СтрокаРеквизитаДляКлючаЦен.Используется = Истина;
		КонецЦикла;
		
		СтрокаРеквизитаДляКлючаЦен = РеквизитыДляКлючаЦен.Добавить();
		СтрокаРеквизитаДляКлючаЦен.ИмяРеквизита   = "Наименование";
		СтрокаРеквизитаДляКлючаЦен.Значение       = Наименование;
		СтрокаРеквизитаДляКлючаЦен.ЭтоДопРеквизит = Ложь;
		СтрокаРеквизитаДляКлючаЦен.Используется   = Истина;
		
	КонецЕсли;
	
	РеквизитыДляПоиска = новый Структура;	
	РеквизитыДляПоиска.Вставить("ВидНоменклатуры",      ВидНоменклатуры);
	РеквизитыДляПоиска.Вставить("РеквизитыДляКлючаЦен", РеквизитыДляКлючаЦен);
	
	Возврат Справочники.СерииНоменклатурыДляЦенообразования.ПолучитьСериюНоменклатурыДляЦенообразования(РеквизитыДляПоиска, НастройкиИспользованияСерий);
	
КонецФункции 

#КонецОбласти
#КонецЕсли