////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые в модуле ПодключаемоеОборудованиеOffline
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьВТекстЗапросаИдентификациюАкцизныхМарок(Запрос, ТекстЗапроса, ЗагрузкаАкцизныхМарок, КлючиЕГАИС) Экспорт

	//++ Локализация	
	ОрганизацияЕГАИС = ИнтеграцияЕГАИСУТ.ОрганизацияЕГАИСПоОрганизацииИСкладу(КлючиЕГАИС.Организация, КлючиЕГАИС.Склад);
	ЗагрузкаАкцизныхМарок = ЗначениеЗаполнено(ОрганизацияЕГАИС);
	
	Если ЗагрузкаАкцизныхМарок Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КодыТоваровПодключаемогоОборудованияOffline.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))                 КАК Номенклатура,
		|	ЕСТЬNULL(КодыТоваровПодключаемогоОборудованияOffline.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	Товары.АкцизнаяМарка                                                                                                               КАК АкцизнаяМарка,
		|	АкцизныеМаркиЕГАИС.Справка2                                                                                                        КАК Справка2,
		|	Товары.ШтрихкодАлкогольнойМарки                                                                                                    КАК ШтрихкодАлкогольнойМарки,
		|	Товары.УникальныйИдентификатор                                                                    	КАК УникальныйИдентификатор,
		|	Товары.НомерСмены                                                                    				КАК НомерСмены
		|ИЗ
		|	ВтТоварыСАкцизнымиМарками КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровПодключаемогоОборудованияOffline КАК КодыТоваровПодключаемогоОборудованияOffline
		|		ПО Товары.Код = КодыТоваровПодключаемогоОборудованияOffline.Код
		|			И КодыТоваровПодключаемогоОборудованияOffline.ПравилоОбмена = &ПравилоОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
		|		ПО Товары.АкцизнаяМарка = АкцизныеМаркиЕГАИС.АкцизнаяМарка
		|			И АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС = &ОрганизацияЕГАИС";
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);

	Конецесли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьАкцизныеМарки(ПараметрыКассовойСмены, ОтчетОРозничныхПродажахОбъект, ТаблицаАкцизныеМарки, ОрганизацияЕГАИС) Экспорт
	
	//++ Локализация
	ОтчетОРозничныхПродажахОбъект.ОрганизацияЕГАИС   = ОрганизацияЕГАИС;
	ОтборПоТаблицеАкцизныхМарок = Новый Структура("НомерСмены,УникальныйИдентификатор", ПараметрыКассовойСмены.НомерСмены, ПараметрыКассовойСмены.УникальныйИдентификатор);
	Для Каждого СтрокаАкциз Из ТаблицаАкцизныеМарки.НайтиСтроки(ОтборПоТаблицеАкцизныхМарок) Цикл
		
		Если ЗначениеЗаполнено(СтрокаАкциз.ШтрихкодАлкогольнойМарки) Тогда
			АкцизнаяМарка = СтрокаАкциз.АкцизнаяМарка;
			
			Если НЕ ЗначениеЗаполнено(АкцизнаяМарка) Тогда
				АкцизнаяМарка = ШтрихкодированиеЕГАИС.СгенерироватьАкцизнуюМарку(
					СтрокаАкциз.ШтрихкодАлкогольнойМарки,
					СтрокаАкциз.Номенклатура,
					СтрокаАкциз.Характеристика);
			КонецЕсли;
			НоваяСтрока = ОтчетОРозничныхПродажахОбъект.АкцизныеМарки.Добавить();
			НоваяСтрока.АкцизнаяМарка = АкцизнаяМарка;
			НоваяСтрока.Справка2 = СтрокаАкциз.Справка2;
			
		КонецЕсли;
		
	КонецЦикла;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

//++ Локализация

// Заполняет статусы акцизных марок
// 
// Параметры:
// 	ДокументОбъект - ДокументОбъект.ОтчетОРозничныхПродажах                 - заполненный документ
// 	ОрганизацияЕГАИС - Булево, СправочникСсылка.КлассификаторОрганизацийЕГАИС - организация для которой загружен отчет
Процедура ЗаполнитьСтатусыПоТабличнойЧастиАкцизныеМарки(ДокументОбъект, ОрганизацияЕГАИС) Экспорт
	
	Если (ОрганизацияЕГАИС = Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.АкцизныеМаркиЕГАИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОрганизацияЕГАИС.Установить(ОрганизацияЕГАИС);
	
	Для каждого СтрокаАкциз Из ДокументОбъект.АкцизныеМарки Цикл
		
		НаборЗаписей.Отбор.АкцизнаяМарка.Установить(СтрокаАкциз.АкцизнаяМарка);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 1 Тогда
			НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.Реализована;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//-- Локализация

Процедура ЗаписатьОшибкуВЖурналРегистрации(КраткоеПредставлениеОшибки, ПредставлениеОшибки, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	СтандартнаяОбработка = Ложь;
	ТекстОшибки = НСтр("ru = 'При записи акцизных марок произошла ошибка:
		|%1'");
	ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(ТекстОшибки, КраткоеПредставлениеОшибки));
	ИнтеграцияЕГАИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
		СтрШаблон(ТекстОшибки, ПредставлениеОшибки));
	//-- Локализация
	Возврат;
	
КонецПроцедуры
#КонецОбласти
