#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда

		МЧД = Справочники.МашиночитаемыеДоверенностиОрганизаций.НайтиПоРеквизиту("НомерДоверенности", НомерДоверенности);
		
		Если ЗначениеЗаполнено(МЧД) Тогда
			
			ДополнительныеСвойства.Вставить("МЧД", МЧД);
			ТекстСообщения = НСтр("ru = 'Доверенность с таким номером уже существует'");
			ВызватьИсключение ТекстСообщения;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Наименование = МашиночитаемыеДоверенности.ПредставлениеОбъекта(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(СведенияОбИнформационнойСистеме) Тогда
		СведенияОбИнформационнойСистеме = МашиночитаемыеДоверенности.СведенияОбИнформационнойСистеме();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли