////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "ТМЦ в эксплуатации".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Параметры подбора ТМЦ в эксплуатации.
// 
// Параметры:
//  Дата - Дата - На какую дату подбираются ТМЦ.
//  Организация - СправочникСсылка.Организации - Отбор ТМЦ по организации.
//  Подразделение - СправочникСсылка.СтруктураПредприятия - Отбор ТМЦ по подразделению.
// 
// Возвращаемое значение:
//  Структура - содержит:
//		* Дата - Дата, Неопределено - На какую дату подбираются ТМЦ.
//		* Организация - СправочникСсылка.Организации, Неопределено - Отбор ТМЦ по организации.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия, Неопределено - Отбор ТМЦ по подразделению.
//		* Номенклатура - СправочникСсылка.Номенклатура, Неопределено - Отбор ТМЦ по номенклатуре.
//		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры, Неопределено - Отбор ТМЦ по характеристике.
//		* Серия - СправочникСсылка.СерииНоменклатуры, Неопределено - Отбор ТМЦ по серии.
//		* СтатусУказанияСерий - Число, Неопределено - Для отбора ТМЦ по серии.
//		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица, Неопределено - Отбор ТМЦ по физ. лицу.
//		* СпособПогашенияСтоимостиБУ - ПеречислениеСсылка.СпособыПогашенияСтоимостиТМЦ, Неопределено - Отбор способу погашения стоимости.
//		* ИнвентарныйНомер - Строка, Неопределено - Отбор ТМЦ по инвентарному номеру.
//		* ИнвентарныйНомерСодержит - Строка, Неопределено - Отбор ТМЦ по совпадению текста в инвентарном номере.
//		* ВыбратьПервые - Число - Выбрать первые записи.
//		* ИнвентарныйУчет - Число, Неопределено - Отбор ТМЦ по признаку инвентарного учета (0 - Любой, 1 - Не ведется, 2 - Ведется).
//		* НазначенныйРесурс - Строка - (Выработан, НеВыработан).
//		* ТекущийРегистратор - ДокументСсылка, Неопределено - Заполняется, если нужно учесть изменение остатков документом.
//		* ДатаНачалаЭксплуатацииС - Дата - Отбор по дате начала эксплуатации.
//		* ДатаНачалаЭксплуатацииПо - Дата - Отбор по дате начала эксплуатации.
//		* ДляДинамическогоСписка - Булево - Истина, если подбор выполняется в дин. списке.
//	
Функция ПараметрыПодбораТМЦВЭксплуатации(Дата = Неопределено, Организация = Неопределено, Подразделение = Неопределено) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата", Дата);
	ПараметрыПодбора.Вставить("Организация", Организация);
	ПараметрыПодбора.Вставить("Подразделение", Подразделение);
	ПараметрыПодбора.Вставить("Номенклатура", Неопределено);
	ПараметрыПодбора.Вставить("Характеристика", Неопределено);
	ПараметрыПодбора.Вставить("Серия", Неопределено);
	ПараметрыПодбора.Вставить("СтатусУказанияСерий", Неопределено);
	ПараметрыПодбора.Вставить("ФизическоеЛицо", Неопределено);
	ПараметрыПодбора.Вставить("СпособПогашенияСтоимостиБУ", Неопределено);
	ПараметрыПодбора.Вставить("ТекущийРегистратор", Неопределено);
	ПараметрыПодбора.Вставить("ИнвентарныйНомер", Неопределено);
	ПараметрыПодбора.Вставить("ИнвентарныйНомерСодержит", Неопределено);
	ПараметрыПодбора.Вставить("ВыбратьПервые", 0);	
	ПараметрыПодбора.Вставить("НазначенныйРесурс", Неопределено);	
	ПараметрыПодбора.Вставить("ИнвентарныйУчет", 0);
	ПараметрыПодбора.Вставить("ДатаНачалаЭксплуатацииС", '000101010000');	
	ПараметрыПодбора.Вставить("ДатаНачалаЭксплуатацииПо", '000101010000');	
	ПараметрыПодбора.Вставить("ДляДинамическогоСписка", Ложь);	
	
	Возврат ПараметрыПодбора;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияСвойствЗависимыхРеквизитов_ВводОстатковТМЦВЭксплуатации(Объект, ИзмененныеРеквизиты = "") Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;

	Если СтруктураИзмененныхРеквизитов.Свойство("Дата")
		ИЛИ ОбновитьВсе Тогда
			
		ЗначениеСвойства = Ложь;
	
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СтатьяРасходов", 
			"ТМЦВЭксплуатацииСтатьяРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.АналитикаРасходов", 
			"ТМЦВЭксплуатацииАналитикаРасходов", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
			
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.Сумма", 
			"ТМЦВЭксплуатацииСумма", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СуммаВР", 
			"ТМЦВЭксплуатацииСуммаВР", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.СуммаПР", 
			"ТМЦВЭксплуатацииСуммаПР", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрыРеквизитаОбъекта(
			"ТМЦВЭксплуатации.ПервоначальнаяСумма", 
			"ТМЦВЭксплуатацииПервоначальнаяСумма", 
			"Видимость", 
			ЗначениеСвойства, 
			ПараметрыРеквизитовОбъекта);
		
	КонецЕсли;
	
	Возврат ПараметрыРеквизитовОбъекта;
	
КонецФункции

// 
// Параметры:
//  Объект - СправочникОбъект.КатегорииЭксплуатации, ДанныеФормыСтруктура - 
// 	ИзмененныеРеквизиты - Строка - список измененных реквизитов.
// 	
// Возвращаемое значение:
// 	Массив из см. НовыйПараметрРеквизитаОбъекта 
Функция ЗначенияСвойствЗависимыхРеквизитов_КатегорииЭксплуатации(Объект, ИзмененныеРеквизиты = "") Экспорт

	СтруктураИзмененныхРеквизитов = Новый Структура(ИзмененныеРеквизиты);
	ОбновитьВсе = СтруктураИзмененныхРеквизитов.Количество() = 0;
	
	ПараметрыРеквизитовОбъекта = Новый Массив;


	Возврат ПараметрыРеквизитовОбъекта;

КонецФункции

// Формирует новое значение выбора партии ТМЦ.
// 
// Возвращаемое значение:
//  Структура - содержит:
// 		* Номенклатура - СправочникСсылка.Номенклатура -
// 		* Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры -
// 		* Серия - СправочникСсылка.СерииНоменклатуры -
// 		* Партия - СправочникСсылка.ПартииТМЦВЭксплуатации -
// 		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица -
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности
// 		* ИнвентарныйНомер - Строка -
// 		* ИнвентарныйУчет - Булево -
// 		* УчетПоФизЛицам - Булево -
// 		* ОбъемНаработки - Число - 
// 		* Количество - Число -
// 		* КоличествоУпаковок - Число -
Функция НовоеЗначениеВыбора() Экспорт
	
	ЗначениеВыбора = Новый Структура("Номенклатура,Характеристика,Серия,
	|Партия,ФизическоеЛицо,НаправлениеДеятельности,ИнвентарныйНомер,
	|ИнвентарныйУчет,УчетПоФизЛицам,ОбъемНаработки,
	|Количество,КоличествоУпаковок");
	
	Возврат ЗначениеВыбора;
	
КонецФункции

#КонецОбласти
