#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбластьОбособленногоХранения Тогда
		КонтролироватьОбособление = Ложь;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не СкладыСервер.ИспользоватьСкладскиеПомещения(Владелец) Тогда
    	МассивНепроверяемыхРеквизитов.Добавить("Помещение");
	КонецЕсли;
				
	Если Не СкладыСервер.ИспользоватьАдресноеХранение(Владелец, Помещение) Тогда
		
		ТекстСообщения = НСтр("ru='По складу ""%Склад%"" не используется адресное хранение!'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Склад%",СкладыСервер.ПолучитьПредставлениеСклада(Владелец,Помещение));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"Склад","Объект",Отказ);
	КонецЕсли;
	
	Если ИспользованиеПериодичностиИнвентаризацииЯчеек 
		= Перечисления.ВариантыИспользованияПериодическойИнвентаризацииЯчеек.НеИспользовать Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоДнейМеждуИнвентаризациями");
			
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	// << 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	КР_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты);
	// >> 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
	
КонецПроцедуры

#КонецОбласти

#Область КР_ДобавленныеПроцедурыИФункции

// << 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
Процедура КР_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	СкладМагазин = (Владелец.КР_ВидСклада = Перечисления.КР_ВидыСкладов.Магазин);
	
	Если СкладМагазин Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("Помещение");	
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры // >> 31.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-751


#КонецОбласти
#КонецЕсли