&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтарыйМеханизмПроведенияСебестоимости = Константы.СтарыйМеханизмПроведенияСебестоимости.Получить();
	
КонецПроцедуры




&НаКлиенте
Процедура ПерепровестиДокументы(Команда)
	
	ПерепровестиДокументыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерепровестиДокументыНаСервере()
	
	Обработки.ТестированиеПроведенияДокументовПартионныйУчет.ПерепровестиДокументы(НачалоПериода, КонецПериода);
	
КонецПроцедуры



&НаКлиенте
Процедура АнализДвижений(Команда)
	
	ТабДок = АнализДвиженийНаСервере();
	
	ТабДок.Показать("Анализ движений себестоимости");
	
	ТабДок = ОписаниеОперацийНаСервере();
	
	ТабДок.Показать("Операции учета себестоимости");
	
КонецПроцедуры

&НаСервере
Функция АнализДвиженийНаСервере()
	
	ТаблицаДокументов = Обработки.ТестированиеПроведенияДокументовПартионныйУчет.ТаблицаДокументовРегистраСебестоимости(НачалоПериода, КонецПериода);
	ТабДок = Обработки.ТестированиеПроведенияДокументовПартионныйУчет.ТаблицуЗначенийВТабличныйДокумент(ТаблицаДокументов);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ОписаниеОперацийНаСервере()
	
	ТаблицаДокументов = Обработки.ТестированиеПроведенияДокументовПартионныйУчет.ПолучитьОписаниеОперацийДокументов();
	ТабДок = Обработки.ТестированиеПроведенияДокументовПартионныйУчет.ТаблицуЗначенийВТабличныйДокумент(ТаблицаДокументов);
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура СверитьДвижения(Команда)
	
	Результат = СверитьДвиженияНаСервере();
	
	Результат.ДвиженияСтарые.Показать("Движения старые");
	Результат.ДвиженияНовые.Показать("Движения новые");
	Результат.СверкаДвижений.Показать("Сверка движений");
	Результат.ТекстПроведения.Показать("Сообщения при проведении");
	
КонецПроцедуры

&НаСервере
Функция СверитьДвиженияНаСервере()
	
	Если НЕ РасчетСебестоимостиПовтИсп.ЗначенияТехнологическихПараметров().НеСохранятьРасчетныеДвижения Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Рекомендуется установить параметр отладки ""%1""'"),
			"НеСохранятьРасчетныеДвижения");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	Результат = Обработки.ТестированиеПроведенияДокументовПартионныйУчет.СверитьДвиженияДокументов(НачалоПериода, КонецПериода);
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура СтарыйМеханизмПроведенияСебестоимостиПриИзменении(Элемент)
	СтарыйМеханизмПроведенияСебестоимостиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтарыйМеханизмПроведенияСебестоимостиПриИзмененииНаСервере()
	
	Константы.СтарыйМеханизмПроведенияСебестоимости.Установить(СтарыйМеханизмПроведенияСебестоимости);
	
КонецПроцедуры


&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Если КонецПериода < НачалоПериода Тогда
		КонецПериода = НачалоПериода;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура НачалоПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоПериода = ДобавитьМесяц(НачалоМесяца(НачалоПериода), Направление);
	КонецПериода  = НачалоПериода;
	
КонецПроцедуры

