
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.Валюта = Запись.БазоваяВалюта
		И (Запись.КурсЧислитель <> 1 Или Запись.КурсЗнаменатель <> 1) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В поле валюта и базовая валюта выбрано одинаковое значение %1.
				|В поля Курс (Числитель) и Курс (Знаменатель) необходимо указать значение ""1""'"),
				Запись.Валюта);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ОтносительныеКурсыВалют", ПараметрыЗаписи, Запись);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		Запись.БазоваяВалюта = Справочники.Валюты.ПолучитьВалютуПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти