
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ИмяОбработкиПечатьЭтикетокИЦенников = ЦенообразованиеКлиент.ИмяОбработкиПечатьЭтикетокИЦенников();
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму(ИмяОбработкиПечатьЭтикетокИЦенников+".Форма", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти
